<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Atributos de clientes de servicios web - Ayuda en l&#237;nea de la consola de Sun Java System Federated Access Manager 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="agentconfig.webserviceclientedit"></a><h4>Atributos de clientes de servicios web</h4>
<p>El perfil de agente del cliente de servicios web describe la configuraci&#243;n
utilizada para proteger las solicitudes de servicios web salientes de un cliente
de servicios web. Los nombres de los servicios web deben ser exclusivos
para cada cliente de servicios web.</p>

<a name="gglmr"></a><h5>General</h5>
<p>Los siguientes atributos generales definen las propiedades b&#225;sicas del cliente de servicios
web:</p>

<a name="ggoue"></a><h5>Grupo</h5>
<p>El mecanismo de grupo permite definir un conjunto de tipos de agentes
similares. Debe definirse el grupo antes de incluir un agente espec&#237;fico en
un conjunto. </p>

<a name="ggowm"></a><h5>Password (Contrase&#241;a)</h5>
<p>Define la contrase&#241;a del atributo de cliente de servicios web.</p>

<a name="ggoti"></a><h5>Confirmar contrase&#241;a</h5>
<p> Confirme la contrase&#241;a.</p>

<a name="ggllf"></a><h5>Estado</h5>
<p>Define si el agente del cliente de servicios web participar&#225; en la
protecci&#243;n de las solicitudes de servicios salientes. Se establece de forma predeterminada
en <tt> Active</tt>, lo que implica que el agente participar&#225;. </p>

<a name="gglje"></a><h5>Identificador universal</h5>
<p>Enumera las propiedades de LDAP b&#225;sicas, que definen de forma exclusiva al
agente del cliente de servicios web.</p>

<a name="gglnb"></a><h5>Seguridad</h5>
<p>Los siguientes atributos definen los atributos de seguridad del cliente de servicios
web:</p>

<a name="ggliy"></a><h5>Mecanismo de seguridad</h5>
<p>Define el tipo de credenciales de seguridad que se utilizar&#225; para proteger
la solicitud del cliente de servicios web. Puede elegir entre los siguientes
tipos de seguridad:</p>
<ul><li><p>Anonymous: el mecanismo de seguridad an&#243;nimo no contiene ninguna credencial de seguridad.</p></li>
<li><p>LibertyDiscoverySecurity: utiliza los testigos de seguridad basados en Liberty para proteger la solicitud.</p></li>
<li><p>SAML-HolderOfKey: utiliza el tipo de aserci&#243;n de SAML 1.1 "Holder-Of-Key" (Contenedor de clave) para proteger la solicitud.</p></li>
<li><p>SAML-SenderVouches: utiliza el tipo de aserci&#243;n de SAML 1.1 "Sender Vouches" (Confirmaciones del remitente) para proteger la solicitud.</p></li>
<li><p>SAML2&#8211;HolderOfKey: utiliza el tipo de testigo de aserci&#243;n de SAML 2.0 "Holder-Of-Key" (Contenedor de clave) para proteger la solicitud.</p></li>
<li><p>SAML2&#8211;SenderVouches: utiliza el tipo de testigo de aserci&#243;n de SAML 2.0 "Sender Vouches" (Confirmaciones del remitente) para proteger la solicitud.</p></li>
<li><p>STSSecurity: establece que el cliente de servicios web debe obtener el testigo de seguridad del servicio de testigos de seguridad.</p></li>
<li><p>UserNameToken: utiliza un testigo de nombre de usuario para proteger las solicitudes del cliente de servicios web.</p></li>
<li><p>UserNameToken-Plain: utiliza un testigo de nombre de usuario con una contrase&#241;a de texto sin formato para proteger las solicitudes de servicios web.</p></li>
<li><p>X509Token: utiliza el certificado X509 para proteger las solicitudes de servicios web.</p></li></ul>


<a name="gglmn"></a><h5>Configuraci&#243;n de STS</h5>
<p>Este atributo se habilita cuando el cliente de servicios web utiliza el
servicio de testigos de seguridad (STS). Esta configuraci&#243;n describe una lista de
los perfiles de agentes de STS utilizados para proteger las solicitudes realizadas
al servicio STS.</p>

<a name="ggljq"></a><h5>Configuraci&#243;n de la detecci&#243;n</h5>
<p>Este atributo se habilita cuando el cliente de servicios web se habilita
para la seguridad del servicio de detecci&#243;n. Esta configuraci&#243;n describe una lista
de los perfiles de agentes de detecci&#243;n utilizados para proteger las solicitudes
realizadas al servicio de detecci&#243;n.</p>

<a name="ggljr"></a><h5>Autenticaci&#243;n de usuario necesaria</h5>
<p>Si se habilita, este atributo establece que es necesario autenticar un usuario
para la p&#225;gina protegida del cliente de servicios con el fin de
obtener acceso.</p>

<a name="gglmd"></a><h5>Conservar encabezados de seguridad del mensaje</h5>
<p>Si se habilita, este atributo permite conservar los encabezados de seguridad SOAP
en el cliente de servicios web para su posterior procesamiento.</p>

<a name="ggllx"></a><h5>URN de tipo de servicio de Liberty</h5>
<p>El URN (Nombre de recursos universal) describe el tipo de servicio de
Liberty que utilizar&#225; el cliente de servicios web para la b&#250;squeda de
servicios.</p>

<a name="gglji"></a><h5>Credencial del testigo de usuario</h5>
<p>Este atributo representa los secretos compartidos de nombre de usuario/contrase&#241;a que utiliza
el cliente de servicios web para generar un testigo de seguridad de
nombre de usuario.</p>

<a name="ggliu"></a><h5>Firma y cifrado</h5>
<p>Los siguientes atributos definen la configuraci&#243;n de firma y cifrado para la
protecci&#243;n de los servicios web:</p>

<a name="gglna"></a><h5>Se ha firmado la solicitud</h5>
<p>Si se habilita, el cliente de servicios web firma la solicitud mediante
un determinado tipo de testigo.</p>

<a name="ggllb"></a><h5>Se ha cifrado el encabezado de la solicitud</h5>
<p>Si se habilita, se cifrar&#225; el encabezado de seguridad de cliente de
los servicios web.</p>

<a name="gglnh"></a><h5>Se ha cifrado la solicitud</h5>
<p>Si se habilita, se habilitar&#225; la solicitud del cliente de servicios web.</p>

<a name="ggljs"></a><h5>Se ha verificado la firma de la respuesta</h5>
<p>Si se habilita, se verificar&#225; la firma de la respuesta de los
servicios web.</p>

<a name="gglks"></a><h5>Se ha descifrado la respuesta</h5>
<p>Si se habilita, se descifrar&#225; la respuesta de los servicios web.</p>

<a name="ggllsa"></a><h5>Almac&#233;n de claves</h5>
<p>Los siguientes atributos configuran el almac&#233;n de claves que se utilizar&#225; para
el almacenamiento y la recuperaci&#243;n de los certificados: </p>

<a name="ggllda"></a><h5>Alias de clave p&#250;blica del proveedor de servicios web</h5>
<p>Este atributo define el alias de clave p&#250;blica del certificado que se
ha utilizado para cifrar la solicitud de servicios web.</p>

<a name="gglmca"></a><h5>Alias de clave privada</h5>
<p>Este atributo define el alias de clave privada del certificado que se
ha utilizado para firmar/descifrar la respuesta del servicio web.</p>

<a name="ggljfa"></a><h5>Uso del almac&#233;n de claves</h5>
<p>Esta configuraci&#243;n define si se debe utilizar el almac&#233;n de claves predeterminado
o uno personalizado. Deben definirse los siguientes valores para un almac&#233;n de
claves personalizado:</p>
<ul><li><p>Ubicaci&#243;n del almac&#233;n de claves</p></li>
<li><p>Contrase&#241;a del almac&#233;n de claves</p></li>
<li><p>Contrase&#241;a de la clave</p></li></ul>


<a name="endpoint"></a><h5>Puntos finales</h5>
<p>Los siguientes atributos definen los puntos finales del servicio web:</p>

<a name="gglmpa"></a><h5>Punto final del servicio web</h5>
<p>Este atributo define el punto final del servicio web en el que
el cliente de servicios web realiza una solicitud.</p>
<br/>

</body>
</html>
