<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Dominios de autenticaci&#243;n
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="federation.fsauthdomains"></A><h2>Dominios de autenticaci&#243;n</h2>
<A NAME="indexterm-58"></A><p>Un <b>dominio de autenticaci&#243;n</b> es una federaci&#243;n de un n&#250;mero cualquiera de proveedores de servicios (y, al menos, un proveedor de identidades) con los que las entidades principales pueden tramitar negocios en un entorno seguro y aparentemente perfecto. Para crear y rellenar un dominio de autenticaci&#243;n, debe crear primero una <b>entidad</b> que albergue los <b>metadatos </b> (la informaci&#243;n de configuraci&#243;n que define una determinada arquitectura de servicios de identidades) para cada proveedor que ser&#225; miembro
del dominio de autenticaci&#243;n. A continuaci&#243;n, configure y guarde el dominio de autenticaci&#243;n. Por &#250;ltimo, para agregar una entidad (un proveedor configurado) al dominio de autenticaci&#243;n, edite las propiedades de la entidad.</p>
<p><hr size="1" noshade><p><b>Nota &#8211; </b>Para obtener m&#225;s informaci&#243;n sobre las entidades, consulte <A HREF="federation.fsentitydescriptors.html#federation.fsentitydescriptors">Entidades: proveedor o afiliado</A>.</p>
<hr size="1" noshade></p><p>Todos los dominios de autenticaci&#243;n configurados se muestran en Dominios de autenticaci&#243;n. A continuaci&#243;n se muestran distintas tareas asociadas a los dominios de autenticaci&#243;n:</p>
<ul><li><p><A HREF="federation.fsauthdomainsadd.html#federation.fsauthdomainsadd">Para crear un dominio de autenticaci&#243;n nuevo</A></p>
</li>
<li><p><A HREF="federation.fsauthdomainsedit.html#federation.fsauthdomainsedit">Para modificar un perfil de dominio de autenticaci&#243;n</A></p>
</li>
<li><p><A HREF="federation.fsauthdomainsselectprovider.html#federation.fsauthdomainsselectprovider">Para agregar proveedores a un dominio de autenticaci&#243;n</A></p>
</li>
<li><p><A HREF="deleteauthdomain.html#deleteauthdomain">Para eliminar un perfil de dominio de autenticaci&#243;n</A></p>
</li>
</ul>
<p><hr size="1" noshade><p><b>Nota &#8211; </b>Los miembros de un dominio de autenticaci&#243;n deben haber establecido anteriormente un acuerdo operativo de <b>c&#237;rculo de confianza</b> basado en las <A target="_blank" HREF="http://www.projectliberty.org/specs/liberty-trust-models-guidelines-v1.0.pdf">directrices del modelo de confianza de Liberty</A>.</p>
<hr size="1" noshade></p>
<br />

</body>
</html>
