<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Modification d'un profil de cercle d'approbation - Ayuda en l&#237;nea de la consola de Sun Federated Access Manager 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="federation.fsauthdomainsedit"></a><h4>Modification d'un profil de cercle d'approbation</h4><a name="indexterm-57"></a><p>Suivez cette proc&#233;dure pour modifier les attributs globaux d'un cercle d'approbation existant
ou pour lui ajouter des fournisseurs. Le point de d&#233;part est Cercle
d'approbation sous l'interface F&#233;d&#233;ration.</p><ol>
<li><b>Cliquez sur le nom d'un cercle d'approbation configur&#233; afin de modifier son
profil ou de lui ajouter des fournisseurs.</b><p>La page Modification du cercle d'approbation s'affiche.</p></li>
<li><b>Tapez les nouvelles valeurs ou modifiez celles pr&#233;sentes dans les attributs g&#233;n&#233;raux
du cercle d'approbation :</b><dl><dt>Nom</dt>
<dd><p>La valeur statique de cet attribut est le nom fourni lors de la cr&#233;ation du cercle d'approbation.</p></dd>
<dt>Description</dt>
<dd><p>La valeur de cet attribut est une description du cercle d'approbation. Si n&#233;cessaire, vous pouvez modifier la description d&#233;j&#224; saisie.</p></dd>
<dt>URL du service &#233;criture IDFF</dt>
<dd><p>Este atributo especifica la ubicaci&#243;n del servicio que escribe la cookie del dominio com&#250;n. La URL presenta el formato <tt><b> http://</tt><i>common-domain-host</i><tt>:</tt><i>port</i><tt>/common/idffwriter </b></tt> .</p></dd>
<dt>URL du service lecture IDFF</dt>
<dd><p>Este atributo especifica la ubicaci&#243;n del servicio que lee la cookie del dominio com&#250;n. La URL presenta el formato <tt><b> http://</tt><i>common-domain-host</i><tt>:</tt><i>port</i><tt>/common/idffreader </b></tt> .</p></dd>
<dt>URL du service &#233;criture SAML2</dt>
<dd><p>Cet attribut sp&#233;cifie l'emplacement du service &#233;criture SAML2 qui &#233;crit le cookie dans le domaine commun. La URL presenta el formato <tt><b>http://</tt><i>common-domain-host</i><tt>:</tt><i> port</i><tt>/common/saml2writer</b></tt></p></dd>
<dt>URL du service lecture SAML2</dt>
<dd><p>Cet attribut sp&#233;cifie l'emplacement du service &#233;criture SAML2 qui &#233;crit le cookie dans le domaine commun. La URL presenta el formato <tt><b>http://</tt><i>common-domain-host</i><tt>:</tt><i> port</i><tt>/common/saml2reader</b></tt></p></dd>
<dt>Estado</dt>
<dd><p>El estado predeterminado es &#8220;Activo&#8221; (Active). S&#233;lectionner Inactif d&#233;sactive la communication avec le cercle d'approbation.</p></dd>
</dl>
</li>
<li><b>Elija uno o varios de los proveedores disponibles y haga clic en
la flecha Agregar para seleccionarlos.</b><p>La lista proporcionada contiene los nombres de las entidades creadas y rellenadas
con proveedores. Pour plus d'informations, voir <a href="federation.fsauthdomainsselectprovider.html">Ajouts de fournisseurs &#224; un cercle d'approbation</a></p></li>
<li><b>Cliquez sur Enregistrer pour terminer l'op&#233;ration.</b></li></ol>
<br/>

</body>
</html>
