<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Para modificar los atributos generales de una entidad de proveedores o una entidad de afiliaci&#243;n
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="federation.fsentitydescriptorsprofile"></A><h3>Para modificar los atributos generales de una entidad de proveedores o una entidad de afiliaci&#243;n</h3>
<A NAME="indexterm-71"></A><A NAME="indexterm-72"></A><A NAME="indexterm-73"></A><p>Despu&#233;s de crear una entidad, puede editar su perfil. Esta tarea puede incluir la modificaci&#243;n de atributos, la adici&#243;n de proveedores de identidades y servicios, y la configuraci&#243;n de afiliaciones. La edici&#243;n de los atributos generales del perfil de una entidad puede llevar consigo la modificaci&#243;n de atributos comunes ya definidos, la adici&#243;n de una persona de contacto o la especificaci&#243;n opcional de informaci&#243;n organizativa. El siguiente procedimiento permite editar los atributos generales. El punto de partida es la pantalla Entidades en Federaci&#243;n.</p>
<ol><li><p><b>Seleccione el nombre de una entidad configurada para modificar su perfil. </b></p><p>La p&#225;gina de atributos generales del perfil de identidad se muestra de forma predeterminada. Si no se encuentra en esta p&#225;gina, puede seleccionar General en el men&#250; Ver.</p>
</li>
<li><p><b>Edite los valores de cualquiera de los atributos comunes de la entidad.</b></p><table border="0" cellspacing="5"><tr><td valign="top"><p>Nombre de entidad</p></td><td valign="top"><p>El valor est&#225;tico de este atributo es el nombre proporcionado al crear la entidad.</p>
</td></tr><tr><td valign="top"><p>Tipo</p></td><td valign="top"><p>El valor est&#225;tico de este atributo es el tipo de entidad, Proveedor o Afiliado.</p>
</td></tr><tr><td valign="top"><p>Descripci&#243;n</p></td><td valign="top"><p>El valor de este atributo es la descripci&#243;n proporcionada al crear la entidad. Puede modificar la descripci&#243;n introducida originalmente y agregar una si no hay ninguna.</p>
</td></tr></table>
</li>
<li><p><b>Proporcione valores para los atributos del perfil de persona de contacto de la entidad. </b></p><p>Estos atributos proporcionan informaci&#243;n sobre la persona con la que se debe poner en contacto en relaci&#243;n con la entidad. Son atributos opcionales.</p>
<table border="0" cellspacing="5"><tr><td valign="top"><p>Nombre</p></td><td valign="top"><p>Escriba el nombre espec&#237;fico de la persona de contacto de la entidad.</p>
</td></tr><tr><td valign="top"><p>Apellidos</p></td><td valign="top"><p>Escriba los apellidos de la persona de contacto de la entidad.</p>
</td></tr><tr><td valign="top"><p>Tipo</p></td><td valign="top"><p>Seleccione el tipo de contacto en el men&#250; desplegable.</p>
<ul><li><p>Administrative (Administrativo)</p>
</li>
<li><p>Billing (Facturaci&#243;n)</p>
</li>
<li><p>Technical (T&#233;cnico)</p>
</li>
<li><p>Other (Otro)</p>
</li>
</ul>
</td></tr><tr><td valign="top"><p>Compa&#241;&#237;a</p></td><td valign="top"><p>Escriba el nombre de la compa&#241;&#237;a en la que trabaja esta persona.</p>
</td></tr><tr><td valign="top"><p>Id. principal de Liberty</p></td><td valign="top"><p>Escriba un identificador de recursos uniformes (URI) que se&#241;ale a una instancia del perfil de informaci&#243;n personal de la persona de contacto.</p>
</td></tr><tr><td valign="top"><p>Correos electr&#243;nicos</p></td><td valign="top"><p>Escriba una o varias direcciones de correo electr&#243;nico de la persona de contacto y haga clic en Agregar.</p>
</td></tr><tr><td valign="top"><p>N&#250;meros de tel&#233;fono</p></td><td valign="top"><p>Escriba uno o varios n&#250;meros de tel&#233;fono de la persona de contacto y haga clic en Agregar.</p>
</td></tr></table>
</li>
<li><p><b>Proporcione valores para los atributos de perfiles de organizaciones.</b></p><p>Los atributos de perfiles de organizaciones ofrecen informaci&#243;n b&#225;sica que puede ser necesaria al interactuar con un principal. Son atributos opcionales.</p>
<p><hr size="1" noshade><p><b>Nota &#8211; </b>Si el atributo Nombres contiene un valor, es necesario agregar valores a los atributos Nombres de visualizaci&#243;n y URL.</p>
<hr size="1" noshade></p><table border="0" cellspacing="5"><tr><td valign="top"><p>Nombres</p></td><td valign="top"><p>Introduzca el nombre legal de la organizaci&#243;n de la entidad y haga clic en Agregar. El valor se define con el formato <i>locale</i>| <i>organization-name</i>. Por ejemplo, <tt>en</tt>| <tt> example.com</tt>.</p>
</td></tr><tr><td valign="top"><p>Nombres de visualizaci&#243;n</p></td><td valign="top"><p>Introduzca un nombre para la organizaci&#243;n de la entidad que sea adecuado para mostrarlo en un principal y haga clic en Agregar. El valor se define con el formato <i>locale</i>|<i>organization-display-name </i> . Por ejemplo, <tt>en</tt>|<tt>example.com</tt>. </p>
</td></tr><tr><td valign="top"><p>URL</p></td><td valign="top"><p>Introduzca la URL de la organizaci&#243;n y haga clic en Agregar. El valor se define con el formato <i>locale</i>|<i> organization-URL</i> . Por ejemplo, <tt>en</tt>|<tt> http://www.example.com</tt> .</p>
</td></tr></table>
</li>
<li><p><b>Haga clic en Guardar para completar la configuraci&#243;n o siga definiendo los valores del proveedor de identidades o de servicios, o los atributos de afiliados.</b></p><p>Si contin&#250;a con la configuraci&#243;n, consulte:</p>
<ul><li><p><b><A HREF="federation.fsidentityprovider.html#federation.fsidentityprovider">Para agregar un proveedor de identidades a una entidad de proveedores</A> para definir los valores de los atributos del proveedor de identidades.</b></p></li>
<li><p><b><A HREF="federation.fsserviceprovider.html#federation.fsserviceprovider">Para agregar un proveedor de servicios a una entidad de proveedores</A> para definir los valores de los atributos del proveedor de servicios.</b></p></li>
<li><p><b><A HREF="federation.fsentitydescriptorsaffiliate.html#federation.fsentitydescriptorsaffiliate">Para agregar miembros a una entidad de afiliaci&#243;n</A> para rellenar una entidad de afiliaci&#243;n con miembros.</b></p></li>
</ul>
</li>
</ol>
<br />

</body>
</html>
