<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>C&#237;rculo de confianza. - Ayuda en l&#237;nea de la consola de Sun Java System Federated Access Manager 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="federation.fsauthdomains"></a><h3>C&#237;rculo de confianza.</h3>
<a name="indexterm-57"></a><p>Un <b>c&#237;rculo de confianza</b>, denominado anteriormente dominio de autenticaci&#243;n, es una federaci&#243;n de un
n&#250;mero cualquiera de proveedores de servicios (y, al menos, un proveedor de
identidades) con los que las entidades principales pueden tramitar negocios en un
entorno seguro y aparentemente perfecto. Para crear y rellenar un c&#237;rculo de
confianza, debe crear primero una <b>entidad</b> que albergue los <b>metadatos </b> (la informaci&#243;n
de configuraci&#243;n que define una determinada arquitectura de servicios de identidades) para
cada proveedor que ser&#225; miembro del dominio de autenticaci&#243;n. A continuaci&#243;n, configure
y guarde el dominio de autenticaci&#243;n. Por &#250;ltimo, para agregar una entidad
(un proveedor configurado) al dominio de autenticaci&#243;n, edite las propiedades de la
entidad.</p>
<hr><p><b>Nota &#8211; </b>Para obtener m&#225;s informaci&#243;n sobre las entidades, consulte <a href="federation.fsentitydescriptors.html">Entidades: proveedor o afiliado</a>.</p>
<hr>
<p>A continuaci&#243;n se muestran distintas tareas asociadas a los dominios de autenticaci&#243;n:</p>
<ul><li><p><b>Broken Link (Target ID: FEDERATION.FSAUTHDOMAINSADD)</b></p></li>
<li><p><a href="federation.fsauthdomainsedit.html">Para modificar un perfil de c&#237;rculo de confianza</a></p></li>
<li><p><a href="federation.fsauthdomainsselectprovider.html">Para agregar proveedores a un c&#237;rculo de confianza</a></p></li>
<li><p><a href="deleteauthdomain.html">Para eliminar un perfil de c&#237;rculo de confianza</a></p></li></ul>

<br/>

</body>
</html>
