<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Para agregar miembros a una entidad de afiliaci&#243;n
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="federation.fsentitydescriptorsaffiliate"></A><h3>Para agregar miembros a una entidad de afiliaci&#243;n</h3>
<A NAME="indexterm-84"></A><A NAME="indexterm-85"></A><p>Despu&#233;s de crear una entidad de afiliaci&#243;n, puede agregar miembros a la afiliaci&#243;n. El punto de partida es Entidades en la interfaz Federaci&#243;n. </p>
<p><hr size="1" noshade><p><b>Nota &#8211; </b>Tambi&#233;n puede modificar los atributos comunes en esta pantalla.</p>
<hr size="1" noshade></p><ol><li><p><b>Seleccione el nombre de una entidad de afiliaci&#243;n configurada para modificar su perfil.</b></p><p>Aparece la p&#225;gina de perfil de la entidad.</p>
</li>
<li><p><b>Elija Affiliate (Afiliado) en el men&#250; View (Ver).</b></p></li>
<li><p><b>Seleccione cualquiera de las entidades disponibles para asignarla a la afiliaci&#243;n.</b></p></li>
<li><p><b>Modifique los valores de los atributos comunes.</b></p><p>Los atributos comunes contienen valores que definen generalmente el propio proveedor de identidades.</p>
<table border="0" cellspacing="5"><tr><td valign="top"><p>Nombre</p></td><td valign="top"><p>Escriba un nuevo URI para la afiliaci&#243;n si es necesario. El valor actual de este atributo es el URI asignado al atributo Nombre de afiliado al crear la entidad. Cualquier valor nuevo debe ser exclusivo entre los nombres de afiliados.</p>
</td></tr><tr><td valign="top"><p>Propietario</p></td><td valign="top"><p>Escriba un nuevo URI para definir un operador principal o propietario diferente para la afiliaci&#243;n. El valor actual de este atributo es el URI asignado al atributo Propietario de afiliado al crear la entidad. El nuevo valor de este atributo es un URI que coincidir&#225; con el valor definido en el atributo Nombre de entidad de la entidad a la que pertenece el nuevo proveedor/propietario. Cualquier valor nuevo debe ser exclusivo entre los nombres de afiliados.</p>
<p><hr size="1" noshade><p><b>Nota &#8211; </b>Si se define un proveedor como propietario de afiliado, esto no implica que se incluya autom&#225;ticamente como miembro de la afiliaci&#243;n. Si un propietario es tambi&#233;n miembro, el URI debe definirse en esta ubicaci&#243;n como propietario y, dentro de la propia entidad de afiliaci&#243;n, como miembro.</p>
<hr size="1" noshade></p></td></tr><tr><td valign="top"><p>Clave de firma: alias de clave</p></td><td valign="top"><p>Los certificados se guardan en un archivo de almac&#233;n de claves de Java. Cada certificado del archivo se asigna a un alias para recuperarlo. Escriba el alias de clave asociado al certificado que se utiliza para firmar las solicitudes y las respuestas.</p>
</td></tr><tr><td valign="top"><p>Clave de cifrado: alias de clave</p></td><td valign="top"><p>Los certificados se guardan en un archivo de almac&#233;n de claves de Java. Cada certificado del archivo se asigna a un alias para recuperarlo. Escriba el alias de clave asociado al certificado de seguridad del proveedor.</p>
</td></tr><tr><td valign="top"><p>Clave de cifrado: tama&#241;o de clave</p></td><td valign="top"><p>Escriba la longitud de las claves que utiliza el consumidor del servicio Web al interactuar con otra entidad.</p>
</td></tr><tr><td valign="top"><p>Clave de cifrado: m&#233;todo de cifrado</p></td><td valign="top"><p>Escriba un URI que se&#241;ale a la preferencia de m&#233;todo de cifrado</p>
</td></tr></table>
</li>
<li><p><b>Haga clic en Guardar.</b></p></li>
</ol>
<br />

</body>
</html>
