<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Para crear un dominio de autenticaci&#243;n nuevo
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="federation.fsauthdomainsadd"></A><h3>Para crear un dominio de autenticaci&#243;n nuevo</h3>
<A NAME="indexterm-59"></A><p>Siga este procedimiento para crear un dominio de autenticaci&#243;n nuevo. El punto de partida es Dominios de autenticaci&#243;n en la interfaz Federaci&#243;n.</p>
<ol><li><p><b>Haga clic en Nuevo para que se muestren los atributos del dominio de autenticaci&#243;n.</b></p><p>Aparece la p&#225;gina de perfiles Nuevo dominio de autenticaci&#243;n.</p>
</li>
<li><p><b>Escriba un nombre para el dominio de autenticaci&#243;n.</b></p></li>
<li><p><b>Escriba una descripci&#243;n del dominio de autenticaci&#243;n en el campo Descripci&#243;n.</b></p></li>
<li><p><b>Escriba un valor para la direcci&#243;n URL del servicio de escritor.</b></p><p>La direcci&#243;n URL del servicio de escritor especifica la ubicaci&#243;n del servlet que escribe la cookie del dominio com&#250;n. Utilice el formato <tt>http://</tt><i>common-domain-host <tt></i> :</tt><i>port<tt></i>/common/writer</tt>. </p>
</li>
<li><p><b>Escriba un valor para la direcci&#243;n URL del servicio de lector.</b></p><p>La direcci&#243;n URL del servicio de lector especifica la ubicaci&#243;n del servlet que lee la cookie del dominio com&#250;n. Utilice el formato <tt>http://</tt><i>common-domain-host <tt></i> :</tt><i>port<tt></i>/common/transfer</tt>. </p>
</li>
<li><p><b>Seleccione Activo o Inactivo.</b></p><p>El estado predeterminado es "Activo" (Active). Si selecciona Inactivo, se deshabilita la comunicaci&#243;n dentro del dominio de autenticaci&#243;n.</p>
</li>
<li><p><b>Haga clic en "Aceptar" para completar la configuraci&#243;n.</b></p><p>El nuevo dominio de autenticaci&#243;n se muestra en la pantalla Dominios de autenticaci&#243;n.</p>
</li>
</ol>
<br />

</body>
</html>
