<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>
<head>

  <meta http-equiv="Content-type" content="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Tipos de almacenes de datos de Federated Access Manager - Ayuda en l&#237;nea de la consola de Sun Java System Federated Access Manager 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &#169; 2008 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">



<a name="idrepoadd"></a><h4>Tipos de almacenes de datos de Federated Access Manager</h4>
<p>En la pantalla de selecci&#243;n de almacenes de datos de Federated Access
Manager puede crear los siguientes tipos de almacenes de datos:</p>

<a name="gdlnj"></a><h5>Complemento de repositorio de Federated Access Manager</h5>
<p>Este tipo de almac&#233;n de datos reside en la instancia de Sun
Java System Directory Server y contiene el &#225;rbol de informaci&#243;n de Federated
Access Manager. Adem&#225;s, utiliza las funciones de Directory Server que no forman
parte de la especificaci&#243;n LDAP versi&#243;n 3 como, por ejemplo, los roles
y la clase de servicio, y es compatible con las versiones anteriores
de Federated Access Manager.</p><p>Para conocer las definiciones de atributos, consulte <a href="amrepoattrs.html">Atributos de repositorio de Federated Access Manager</a>.</p>

<a name="gdlmv"></a><h5>Active Directory</h5>
<p>Este tipo de almac&#233;n de datos utiliza la especificaci&#243;n LDAP versi&#243;n 3
para escribir datos de identidades en una instancia de  Microsoft Active
Directory.</p><p>Para obtener las definiciones de atributos, consulte <a href="adattrs.html">Atributos de Active Directory</a>.</p>

<a name="gdlml"></a><h5>Repositorios de archivos sin formato</h5>
<p>Este repositorio permite almacenar datos e identidades en una estructura DIT sin
formato en la instancia de instalaci&#243;n local de Federated Access Manager sin
necesidad de crear un almac&#233;n de datos independiente. Normalmente se utiliza para
la realizaci&#243;n de pruebas o la implementaci&#243;n de prototipos.</p><p>Para obtener las definiciones de atributos, consulte <a href="flatfileattr.html">Atributos de repositorio de archivos sin formato</a>.</p>

<a name="gdlmr"></a><h5>LDAPv3 gen&#233;rico</h5>
<p>Este tipo de almac&#233;n de datos permite escribir datos de identidades en
cualquier base de datos compatible con LDAPv3. Si la base de datos
LDAPv3 que utiliza no admite la b&#250;squeda persistente, no podr&#225; utilizar la
funci&#243;n de almacenamiento en cach&#233;.</p><p>Para obtener las definiciones de atributos, consulte <a href="gdoto.html">Atributos LDAPv3 gen&#233;ricos</a>.</p>

<a name="gdlnw"></a><h5>Sun Directory Server con esquema de Federated Access Manager</h5>
<p>Este tipo de almac&#233;n de datos reside en la instancia de Sun
Java System Directory Server y contiene el &#225;rbol de informaci&#243;n de Federated
Access Manager. Se diferencia del complemento de repositorio de Federated Access Manager
en que dispone un mayor n&#250;mero de atributos de configuraci&#243;n, lo que
le permite personalizar de forma m&#225;s eficaz el almac&#233;n de datos.</p><p>Para obtener las definiciones de atributos, consulte <a href="sundirattrs.html">Sun Directory Server con atributos de esquema de Federated Access Manager</a>. </p>
<br/>

</body>
</html>
