<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Tipos de almacenes de datos de Access Manager
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="idrepoadd"></A><h3>Tipos de almacenes de datos de Access Manager</h3>
<p>En la pantalla de selecci&#243;n de almacenes de datos de Access Manager puede crear los siguientes tipos de almacenes de datos:</p>
<A NAME="gdlnj"></A><h4>Complemento de repositorio de Access Manager</h4>
<p>Este tipo de almac&#233;n de datos reside en la instancia de Sun Java System Directory Server y contiene el &#225;rbol de informaci&#243;n de Access Manager. Adem&#225;s, utiliza las funciones de Directory Server que no forman parte de la especificaci&#243;n LDAP versi&#243;n 3 como, por ejemplo, los roles y la clase de servicio, y es compatible con las versiones anteriores de Access Manager.</p>
<p>Para conocer las definiciones de atributos, consulte <A HREF="amrepoattrs.html#amrepoattrs">Atributos de repositorio de Access Manager</A>.</p>
<A NAME="gdlmv"></A><h4>Active Directory</h4>
<p>Este tipo de almac&#233;n de datos utiliza la especificaci&#243;n LDAP versi&#243;n 3 para escribir datos de identidades en una instancia de  Microsoft Active Directory.</p>
<p>Para obtener las definiciones de atributos, consulte <A HREF="adattrs.html#adattrs">Atributos de Active Directory</A>.</p>
<A NAME="gdlml"></A><h4>Repositorios de archivos sin formato</h4>
<p>Este repositorio permite almacenar datos e identidades en una estructura DIT sin formato en la instancia de instalaci&#243;n local de Access Manager sin necesidad de crear un almac&#233;n de datos independiente. Normalmente se utiliza para la realizaci&#243;n de pruebas o la implementaci&#243;n de prototipos.</p>
<p>Para obtener las definiciones de atributos, consulte <A HREF="flatfileattr.html#flatfileattr">Atributos de repositorio de archivos sin formato</A>.</p>
<A NAME="gdlmr"></A><h4>LDAPv3 gen&#233;rico</h4>
<p>Este tipo de almac&#233;n de datos permite escribir datos de identidades en cualquier base de datos compatible con LDAPv3. Si la base de datos LDAPv3 que utiliza no admite la b&#250;squeda persistente, no podr&#225; utilizar la funci&#243;n de almacenamiento en cach&#233;.</p>
<p>Para obtener las definiciones de atributos, consulte <A HREF="gdoto.html#gdoto">Atributos LDAPv3 gen&#233;ricos</A>.</p>
<A NAME="gdlnw"></A><h4>Sun Directory Server con esquema de Access Manager</h4>
<p>Este tipo de almac&#233;n de datos reside en la instancia de Sun Java System Directory Server y contiene el &#225;rbol de informaci&#243;n de Access Manager. Se diferencia del complemento de repositorio de Access Manager en que dispone un mayor n&#250;mero de atributos de configuraci&#243;n, lo que le permite personalizar de forma m&#225;s eficaz el almac&#233;n de datos.</p>
<p>Para obtener las definiciones de atributos, consulte <A HREF="sundirattrs.html#sundirattrs">Sun Directory Server con atributos de esquema de Access Manager</A>.</p>

<br />

</body>
</html>
