<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>JDBC
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="service.scserviceprofile.sunamauthjdbcservice"></A><h3>JDBC</h3>
<p><A NAME="indexterm-181"></A>El m&#243;dulo de autenticaci&#243;n Conectividad de base de datos de Java (JDBC, Java Database Connectivity) permite a Access Manager autenticar usuarios mediante cualquier base de datos de Lenguaje de consulta estructurado (SQL, Structured Query Language) que proporcione controladores habilitados para JDBC.  La conexi&#243;n a la base de datos SQL se puede realizar directamente mediante un controlador JDBC o mediante un grupo de conexi&#243;n JNDI. Los atributos de JDBC son atributos de dominio. Los atributos son:</p>
<ul><li><p><A HREF="service.scserviceprofile.sunamauthjdbcservice.html#fwajx">Tipo de conexi&#243;n</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.sunamauthjdbcservice.html#fwafb">Nombre JNDI de grupo de conexi&#243;n</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.sunamauthjdbcservice.html#fwaap">Controlador JDBC</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.sunamauthjdbcservice.html#fwarc">URL de JDBC</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.sunamauthjdbcservice.html#fwaum">Conectar este usuario a la base de datos</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.sunamauthjdbcservice.html#fwaeu">Contrase&#241;a para conectarse a la base de datos</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.sunamauthjdbcservice.html#fwavq">Contrase&#241;a para conectarse a la base de datos (confirmar)</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.sunamauthjdbcservice.html#fwads">Cadena de la columna de contrase&#241;a</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.sunamauthjdbcservice.html#fwapb">Declaraci&#243;n preparada</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.sunamauthjdbcservice.html#fwapv">Clase para transformar la sintaxis de la contrase&#241;a</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.sunamauthjdbcservice.html#fwavz">Nivel de autenticaci&#243;n</A></p>
</li>
</ul>
<A NAME="fwajx"></A><h4>Tipo de conexi&#243;n</h4>
<p>Especifica el tipo de conexi&#243;n a la base de datos SQL, utilizando un grupo de conexi&#243;n JNDI (Java Naming and Directory Interface) o un controlador JDBC. Las opciones son:</p>
<ul><li><p>El grupo de conexi&#243;n se recupera mediante JDNI</p>
</li>
<li><p>Conexi&#243;n JDBC no persistente</p>
</li>
</ul>
<p>El grupo de conexi&#243;n JNDI utiliza la configuraci&#243;n del contenedor Web subyacente.</p>
<A NAME="fwafb"></A><h4>Nombre JNDI de grupo de conexi&#243;n</h4>
<p>Si se selecciona JNDI en el tipo de conexi&#243;n, este campo especifica el nombre del grupo de conexi&#243;n. Debido a que la autenticaci&#243;n JDBC utiliza el grupo de conexi&#243;n JNDI que el contenedor Web proporciona, es posible que la configuraci&#243;n del grupo de conexi&#243;n JNDI no se adapte correctamente a otros contenedores Web. Consulte el documento Access Manager Administration Guide (Gu&#237;a de administraci&#243;n de Access Manager) para ver algunos ejemplos</p>
<A NAME="fwaap"></A><h4>Controlador JDBC</h4>
<p>Si se selecciona JDBC en <A HREF="service.scserviceprofile.sunamauthjdbcservice.html#fwajx">Tipo de conexi&#243;n</A>, este campo especifica el controlador JDBC que la base de datos SQL proporciona. Por ejemplo, <tt>com.mysql.jdbc.Driver</tt>.</p>
<A NAME="fwarc"></A><h4>URL de JDBC</h4>
<p>Especifica la direcci&#243;n URL de la base de datos si se selecciona JDBC en <A HREF="service.scserviceprofile.sunamauthjdbcservice.html#fwajx">Tipo de conexi&#243;n</A>. Por ejemplo, la direcci&#243;n URL para mySQL es <tt>jdbc.mysql://hostname:port/databaseName</tt>.</p>
<A NAME="fwaum"></A><h4>Conectar este usuario a la base de datos</h4>
<p>Especifica el nombre de usuario desde el que se realiza la conexi&#243;n a la base de datos para la conexi&#243;n JDBC.</p>
<A NAME="fwaeu"></A><h4>Contrase&#241;a para conectarse a la base de datos</h4>
<p>Define la contrase&#241;a para el usuario especificado en User to Connect to Database (Usuario para conectarse a la base de datos).</p>
<A NAME="fwavq"></A><h4>Contrase&#241;a para conectarse a la base de datos (confirmar)</h4>
<p>Confirme la contrase&#241;a.</p>
<A NAME="fwads"></A><h4>Cadena de la columna de contrase&#241;a</h4>
<p>Especifica el nombre de la columna de contrase&#241;as en la base de datos SQL.</p>
<A NAME="fwapb"></A><h4>Declaraci&#243;n preparada</h4>
<p>Especifica la instrucci&#243;n SQL que recupera la contrase&#241;a del usuario que ha iniciado una sesi&#243;n. Por ejemplo:</p>
<table cellpadding="4" border="1" cols="1" width="100%"><td><pre> select Password from Employees where USERNAME = ?</pre>
</td></table><br><A NAME="fwapv"></A><h4>Clase para transformar la sintaxis de la contrase&#241;a</h4>
<p>Especifica el nombre de la clase que transforma la contrase&#241;a recuperada de la base de datos al formato de los datos introducidos por el usuario, para comparar las contrase&#241;as. Esta clase debe implementar la interfaz <tt>JDBCPasswordSyntaxTransform</tt>. </p>
<A NAME="fwavz"></A><h4>Nivel de autenticaci&#243;n</h4>
<p>El nivel de autenticaci&#243;n se define de forma independiente para cada m&#233;todo de autenticaci&#243;n. El valor indica en qu&#233; medida se debe confiar en un mecanismo de autenticaci&#243;n. Una vez que el usuario se ha autenticado, este valor se guarda en el token SSO de la sesi&#243;n. Cuando se presenta el token SSO a una aplicaci&#243;n a la que desea acceder el usuario, la aplicaci&#243;n utiliza el valor almacenado para determinar si el nivel es suficiente para permitir el acceso al usuario. Si el nivel de autenticaci&#243;n guardado en un token SSO no satisface el valor m&#237;nimo necesario, la aplicaci&#243;n puede solicitar al usuario que se autentique de nuevo mediante un servicio con un mayor nivel de autenticaci&#243;n. El valor predeterminado es 0.</p>
<p><hr size="1" noshade><p><b>Nota &#8211; </b>Si no se especifica ning&#250;n nivel de autenticaci&#243;n, el token SSO almacena el valor especificado en el <A HREF="service.scserviceprofile.iplanetamauthservice.html#fwbfn">Nivel de autenticaci&#243;n predeterminado</A> del atributo de autenticaci&#243;n "Principal".</p>
<hr size="1" noshade></p>
<br />

</body>
</html>
