<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Configuraci&#243;n de pol&#237;ticas
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="service.scpolicy"></A><h3>Configuraci&#243;n de pol&#237;ticas</h3>
<p><A NAME="indexterm-198"></A>Los atributos de configuraci&#243;n de pol&#237;ticas permiten al administrador definir las propiedades de dominio y globales de configuraci&#243;n utilizadas por el servicio de pol&#237;tica.</p>
<ul><li><p><A HREF="service.scpolicy.html#fufnk">Propiedades globales</A></p>
</li>
<li><p><A HREF="service.scpolicy.html#fufmb">Atributos de dominio</A></p>
</li>
</ul>
<A NAME="fufnk"></A><h4>Propiedades globales</h4>
<p>Las propiedades globales son:</p>
<A NAME="gciwg"></A><h5>Comparador de recursos</h5>
<p>Especifica la informaci&#243;n del comparador de recursos, que se utiliza para comparar los recursos especificados en una definici&#243;n de regla de pol&#237;tica. La comparaci&#243;n de recursos se utiliza tanto para la creaci&#243;n como para la evaluaci&#243;n de pol&#237;ticas.</p>
<p>Haga clic en el bot&#243;n Agregar comparador y defina los siguientes atributos:</p>
<table border="0" cellspacing="5"><tr><td valign="top"><p>Tipo de servicio</p></td><td valign="top"><p>Especifica el servicio en el que se debe utilizar el comparador.</p>
</td></tr><tr><td valign="top"><p>Clase</p></td><td valign="top"><p>Define la clase de Java que implementa el algoritmo de comparaci&#243;n de recursos. </p>
</td></tr><tr><td valign="top"><p>Delimitador</p></td><td valign="top"><p>Especifica el delimitador que se va a utilizar en el nombre del recurso. </p>
</td></tr><tr><td valign="top"><p>Comod&#237;n</p></td><td valign="top"><p>Especifica el comod&#237;n que puede definirse en los nombres de recursos.</p>
</td></tr><tr><td valign="top"><p>Comod&#237;n de un nivel</p></td><td valign="top"><p>Hace coincidir cero o m&#225;s caracteres en el mismo l&#237;mite del delimitador.</p>
</td></tr><tr><td valign="top"><p>Distinci&#243;n entre may&#250;sculas y min&#250;sculas</p></td><td valign="top"><p>Especifica si la comparaci&#243;n de los dos recursos debe distinguir o no entre may&#250;sculas y min&#250;sculas. El valor False (Falso) ignora esta distinci&#243;n y True (Verdadero) la tiene en cuenta.</p>
</td></tr></table>
<A NAME="fufnh"></A><h5>&#191;Continuar evaluaci&#243;n tras decisi&#243;n de denegaci&#243;n?</h5>
<p>Especifica si la estructura de pol&#237;tica debe continuar evaluando o no las pol&#237;ticas posteriores, incluso si existe una decisi&#243;n de pol&#237;tica de denegaci&#243;n (DENY). Si no se selecciona esta opci&#243;n (predeterminado), la evaluaci&#243;n de pol&#237;ticas omitir&#225; las pol&#237;ticas siguientes una vez reconocida la decisi&#243;n de denegaci&#243;n (DENY).</p>
<A NAME="fufng"></A><h5>Avisos gestionables por Access Manager</h5>
<p>Define los nombres de claves de avisos de pol&#237;tica para los que el punto de aplicaci&#243;n de pol&#237;tica (Agente de pol&#237;tica) redirigir&#225; el agente de usuario a Access Manager. Si el agente recibe una decisi&#243;n de pol&#237;tica que no permite el acceso a un recurso, pero posee avisos, el agente comprobar&#225; si dispone de una clave de aviso en este atributo.</p>
<p>En caso de que se encuentre dicho aviso, el agente de usuario ser&#225; redirigido a Access Manager, permitiendo potencialmente el acceso al recurso.</p>
<A NAME="gdpdm"></A><h5>Referencias de alias de la organizaci&#243;n</h5>
<p>Si se establece en S&#237; (Yes), este atributo permite crear directivas en subdominios sin necesidad de crear directivas de referencias en el nivel superior o el dominio principal. S&#243;lo se pueden crear directivas para proteger los recursos HTTP o HTTPS cuyo nombre de host completo coincida con el alias de DNS del dominio. De forma predeterminada, este atributo se define como No. </p>
<A NAME="fufmb"></A><h4>Atributos de dominio</h4>
<p>Las propiedades de LDAP son las siguientes:</p>
<A NAME="fufmg"></A><h5>Servidor LDAP principal</h5>
<p>Establece el nombre de host y el n&#250;mero de puerto del servidor LDAP principal especificado durante la instalaci&#243;n de Access Manager que se utilizar&#225;n para buscar asuntos de pol&#237;tica, como usuarios de LDAP, roles de LDAP, grupos de LDAP, etc.</p>
<p>El formato es <i>hostname:port</i>. Por ejemplo: <tt>machine1.example.com:389</tt></p>
<p>Para la configuraci&#243;n de conmutaci&#243;n por error en varios hosts del servidor LDAP, este valor puede ser una lista de hosts delimitados por espacios. El formato es <i>hostname1:port1 hostname2:port2...</i></p>
<p>Por ejemplo: <tt>machine1.example1.com:389 machine2.example1.com:389 </tt></p>
<p>Si hay varias entradas, el nombre del servidor local debe ir en primer lugar. Esto permite configurar Access Manager espec&#237;ficos para que se conecten a determinados servidores Directory Server.</p>
<p>El formato es <i>servername|hostname:port</i>. Por ejemplo:</p>
<p><tt>machine1.example1.com|machine1.example1.com:389</tt></p>
<p><tt>machine1.example2.com|machine1.example2.com:389</tt></p>
<p>Para la configuraci&#243;n de conmutaci&#243;n por error:</p>
<p><tt>AM_Server1.example1.com|machine1.example1.com:389 machine2.example.com1:389 </tt></p>
<p><tt>AM_Server2.example2.com|machine1.example2.com:389 machine2.example2.com:389 </tt></p>
<A NAME="fufmc"></A><h5>DN de base de LDAP</h5>
<p>Especifica el DN base del servidor LDAP desde el que comenzar&#225; la b&#250;squeda. De forma predeterminada, es el dominio de nivel superior de la instalaci&#243;n de Access Manager.</p>
<A NAME="fufmd"></A><h5>DN de base de usuarios de LDAP</h5>
<p>Este atributo especifica el DN base utilizado por el asunto de usuarios de LDAP del servidor LDAP para comenzar la b&#250;squeda. De forma predeterminada, es el dominio de nivel superior de la base de instalaci&#243;n de Access Manager.</p>
<A NAME="fufmz"></A><h5>DN base de los roles de Access Manager</h5>
<p>Define el DN del dominio u organizaci&#243;n que se va utilizar como base mientras se buscan los valores de los roles de Access Manager. Este atributo lo utiliza el asunto de pol&#237;tica de <i>AccessManagerRoles</i>.</p>
<A NAME="fufme"></A><h5>DN de conexi&#243;n de LDAP</h5>
<p>Especifica el DN de conexi&#243;n del servidor LDAP.</p>
<A NAME="fufmf"></A><h5>Contrase&#241;a de conexi&#243;n de LDAP</h5>
<p>Define la contrase&#241;a que se va a utilizar para la conexi&#243;n con el servidor LDAP. La contrase&#241;a <tt>amldapuser</tt> que se introdujo durante la instalaci&#243;n se utiliza de forma predeterminada como usuario de conexi&#243;n.</p>
<A NAME="fufmn"></A><h5>Filtro de b&#250;squeda de organizaciones de LDAP</h5>
<p>Especifica el filtro de b&#250;squeda que se va a utilizar para encontrar las entradas de organizaci&#243;n. El valor predeterminado es <tt>(objectclass=sunMangagedOrganization)</tt>. </p>
<A NAME="fufmm"></A><h5>&#193;mbito de b&#250;squeda de organizaciones de LDAP</h5>
<p>Define el &#225;mbito que se va a utilizar para encontrar las entradas de organizaci&#243;n. El &#225;mbito debe ser uno de los siguientes:</p>
<ul><li><p>SCOPE_BASE</p>
</li>
<li><p>SCOPE_ONE</p>
</li>
<li><p>SCOPE_SUB (predeterminado)</p>
</li>
</ul>
<A NAME="fufmq"></A><h5>&#193;mbito de b&#250;squeda de grupos de LDAP</h5>
<p>Define el &#225;mbito que se va a utilizar para encontrar las entradas de grupo. El &#225;mbito debe ser uno de los siguientes:</p>
<ul><li><p>SCOPE_BASE</p>
</li>
<li><p>SCOPE_ONE</p>
</li>
<li><p>SCOPE_SUB (predeterminado)</p>
</li>
</ul>
<A NAME="fufmp"></A><h5>Filtro de b&#250;squeda de grupos de LDAP</h5>
<p>Especifica el filtro de b&#250;squeda que se va a utilizar para encontrar las entradas de grupo. El valor predeterminado es <tt>(objectclass=groupOfUniqueNames)</tt>.</p>
<A NAME="fufms"></A><h5>Filtro de b&#250;squeda de usuarios de LDAP</h5>
<p>Especifica el filtro de b&#250;squeda que se va a utilizar para encontrar las entradas de usuario. El valor predeterminado es <tt>(objectclass=inetorgperson)</tt>.</p>
<A NAME="fufmt"></A><h5>&#193;mbito de b&#250;squeda de usuarios de LDAP</h5>
<p>Define el &#225;mbito que se va a utilizar para encontrar las entradas de usuario. El &#225;mbito debe ser uno de los siguientes:</p>
<ul><li><p>SCOPE_BASE</p>
</li>
<li><p>SCOPE_ONE</p>
</li>
<li><p>SCOPE_SUB (predeterminado)</p>
</li>
</ul>
<A NAME="fufmv"></A><h5>Filtro de b&#250;squeda de roles de LDAP</h5>
<p>Especifica el filtro de b&#250;squeda que se va a utilizar para encontrar las entradas de los roles. El valor predeterminado es <tt>(&#38;(objectclass=ldapsubentry)(objectclass=nsroledefinitions)) </tt> .</p>
<A NAME="fufmw"></A><h5>&#193;mbito de b&#250;squeda de roles de LDAP</h5>
<p>Este atributo define el &#225;mbito que se va a utilizar para encontrar las entradas de los roles. El &#225;mbito debe ser uno de los siguientes:</p>
<ul><li><p>SCOPE_BASE</p>
</li>
<li><p>SCOPE_ONE</p>
</li>
<li><p>SCOPE_SUB (predeterminado)</p>
</li>
</ul>
<A NAME="fufmy"></A><h5>&#193;mbito de b&#250;squeda de los roles de Access Manager</h5>
<p>Define el &#225;mbito que se va a utilizar para encontrar entradas del asunto de los roles de Access Manager.</p>
<ul><li><p>SCOPE_BASE</p>
</li>
<li><p>SCOPE_ONE</p>
</li>
<li><p>SCOPE_SUB (predeterminado)</p>
</li>
</ul>
<A NAME="fufmo"></A><h5>Atributo de b&#250;squeda de organizaci&#243;n de LDAP</h5>
<p>Define el tipo de atributo mediante el que se realiza la b&#250;squeda en una organizaci&#243;n. El valor predeterminado es o.</p>
<A NAME="fufmr"></A><h5>Atributo de b&#250;squeda de grupos de LDAP</h5>
<p>Define el tipo de atributo mediante el que se realiza la b&#250;squeda en un grupo. El valor predeterminado es <tt>cn</tt>.</p>
<A NAME="fufmu"></A><h5>Atributo de b&#250;squeda de usuarios de LDAP</h5>
<p>Define el tipo de atributo mediante el que se realiza la b&#250;squeda en un usuario. El valor predeterminado es <tt>uid.</tt></p>
<A NAME="fufmx"></A><h5>Atributo de b&#250;squeda de roles de LDAP</h5>
<p>Este campo define el tipo de atributo mediante el que se realiza la b&#250;squeda en un rol. El valor predeterminado es <tt>cn</tt>.</p>
<A NAME="fufnj"></A><h5>N&#250;mero m&#225;ximo de resultados de b&#250;squeda</h5>
<p>Este campo define el n&#250;mero m&#225;ximo de resultados que muestra la b&#250;squeda. El valor predeterminado es 100. Si el l&#237;mite de b&#250;squeda supera la cantidad especificada, s&#243;lo se mostrar&#225;n las entradas recibidas hasta el n&#250;mero especificado.</p>
<A NAME="fufnl"></A><h5>Tiempo de espera de b&#250;squeda</h5>
<p>Especifica el intervalo de tiempo antes de que se produzca el tiempo de espera en la b&#250;squeda. Si la b&#250;squeda supera el tiempo especificado, s&#243;lo se mostrar&#225;n las entradas obtenidas hasta ese momento</p>
<A NAME="fufmi"></A><h5>SSL de LDAP</h5>
<p>Especifica si el servidor LDAP ejecuta o no SSL. Si se selecciona esta opci&#243;n, se habilitar&#225; SSL. Si no se selecciona (predeterminado), se deshabilitar&#225; SSL.</p>
<p>Si se est&#225; ejecutando el servidor LDAP con SSL habilitado (LDAPS), debe asegurarse de que Access Manager est&#233; configurado con los certificados SSL de confianza adecuados para que pueda conectarse a Directory Server con el protocolo LDAPS.</p>
<A NAME="fufmk"></A><h5>Tama&#241;o m&#237;nimo de grupo de conexi&#243;n LDAP</h5>
<p>Especifica el tama&#241;o m&#237;nimo de los grupos  de conexiones que se van a utilizar para conectarse a Directory Server, como se especifica en el atributo del servidor LDAP. El valor predeterminado es 1.</p>
<A NAME="fufmj"></A><h5>Tama&#241;o m&#225;ximo de conjunto de conexiones</h5>
<p>Este atributo especifica el tama&#241;o m&#225;ximo de los grupos de conexiones que se van a utilizar para conectarse a Directory Server, como se especifica en el atributo del servidor LDAP. El valor predeterminado es 10.</p>
<A NAME="fufna"></A><h5>Asuntos de pol&#237;tica seleccionados</h5>
<p>Permite seleccionar un conjunto de tipos de asuntos que se pueden utilizar para las definiciones de directivas en el dominio.</p>
<A NAME="fufnc"></A><h5>Condiciones de pol&#237;tica seleccionadas</h5>
<p>Permite seleccionar un conjunto de tipos de condiciones que se pueden utilizar para las definiciones de directivas en el dominio.</p>
<A NAME="fufnd"></A><h5>Referencias de pol&#237;tica seleccionadas</h5>
<p>Permite seleccionar un conjunto de tipos de referencias que se pueden utilizar para las definiciones de directivas en el dominio.</p>
<A NAME="fufml"></A><h5>Tiempo de vida de resultado de asuntos</h5>
<p>Este atributo especifica el tiempo (en minutos) que se puede utilizar un resultado de asunto almacenado en cach&#233; para evaluar la misma solicitud de pol&#237;tica en funci&#243;n del token de inicio de sesi&#243;n &#250;nico.</p>
<p>Cuando se eval&#250;a una pol&#237;tica por primera vez para un token SSO, las instancias de asunto de la pol&#237;tica se eval&#250;an para determinar si la pol&#237;tica se puede aplicar a un determinado usuario. El resultado del asunto, que est&#225; codificado por el Id. del token SSO, se almacena en la memoria cach&#233; de la pol&#237;tica. Si se lleva a cabo otra evaluaci&#243;n para la misma pol&#237;tica del mismo Id- de token SSO en el tiempo especificado en el atributo de tiempo de vida de resultado de asuntos, la estructura de pol&#237;tica recuperar&#225; el resultado de los asuntos almacenados en cach&#233; en lugar de evaluar las instancias del asunto. Esto reduce en gran medida el tiempo de evaluaci&#243;n de pol&#237;ticas.</p>
<A NAME="fufnm"></A><h5>Alias de usuario</h5>
<p>Este atributo debe estar habilitado si se crea una pol&#237;tica para proteger un recurso cuyo miembro de asunto en un Directory Server remoto asigna un alias a un usuario local. Este atributo debe estar habilitado, por ejemplo, si se crea <tt>uid=rmuser</tt> en el servidor de Directory Server remoto y, a continuaci&#243;n, se agrega <tt>rmuser</tt> como alias para el usuario local (por ejemplo, <tt>uid=luser</tt>) en Access Manager. Al iniciar una sesi&#243;n como <tt>rmuser</tt>, se crea una sesi&#243;n con el usuario local (<tt>luser</tt>) y la pol&#237;tica se aplica correctamente. </p>
<A NAME="fufni"></A><h5>Proveedores de respuesta seleccionados</h5>
<p>Define los complementos de proveedor de respuesta de pol&#237;tica que se van a habilitar para el dominio. S&#243;lo los complementos de proveedor de respuesta seleccionados en este atributo pueden agregarse a las pol&#237;ticas definidas en el dominio.</p>
<A NAME="fufnn"></A><h5>Atributos de respuesta din&#225;micos seleccionados</h5>
<p>Define los atributos de respuesta din&#225;micos que se van a habilitar para este dominio. S&#243;lo un subconjunto de nombres seleccionados en este atributo puede definirse en la lista de atributos din&#225;micos de <i>IDResponseProvider</i> para agregarlos a las pol&#237;ticas definidas en el dominio.</p>

<br />

</body>
</html>
