<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>RADIUS 
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="service.scserviceprofile.iplanetamauthradiusservice"></A><h3>RADIUS </h3>
<p><A NAME="indexterm-185"></A>Este m&#243;dulo permite realizar la autenticaci&#243;n mediante un servidor de Servicio de usuario de marcaci&#243;n de entrada de autenticaci&#243;n remota (RADIUS, Remote Authentication Dial-In User Service). Los atributos de autenticaci&#243;n RADIUS son atributos de dominio. Los atributos son:</p>
<ul><li><p><A HREF="service.scserviceprofile.iplanetamauthradiusservice.html#fwadp">Servidor 1</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthradiusservice.html#fwaom">Servidor 2</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthradiusservice.html#fwaka">Secreto compartido</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthradiusservice.html#fwapc">Confirmar secreto compartido</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthradiusservice.html#fwapn">N&#250;mero de puerto</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthradiusservice.html#fwaad">Tiempo de espera</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthradiusservice.html#fwabo">Nivel de autenticaci&#243;n</A></p>
</li>
</ul>
<A NAME="fwadp"></A><h4>Servidor 1</h4>
<p>Muestra la direcci&#243;n IP o el nombre de host completo del servidor RADIUS principal. La direcci&#243;n IP predeterminada es 127.0.0.1. El campo reconocer&#225; cualquier direcci&#243;n IP o nombre de host v&#225;lido. Si hay varias entradas, deber&#225;n tener el nombre del servidor local como prefijo como en la siguiente sintaxis:</p>
<p><tt>local_servername|ip_address local_servername2|ip_address ...</tt></p>
<A NAME="fwaom"></A><h4>Servidor 2</h4>
<p>Muestra la direcci&#243;n IP o el nombre de dominio completo (FQDN) del servidor RADIUS secundario. Se trata de un servidor de conmutaci&#243;n por error con el que se establecer&#225; comunicaci&#243;n si no se ha podido contactar con el servidor principal. La direcci&#243;n IP predeterminada es 127.0.0.1. El nombre de servidor local debe ir delante de las diferentes entradas con la siguiente sintaxis:</p>
<p><tt>local_servername|ip_address local_servername2|ip_address ...</tt></p>
<A NAME="fwaka"></A><h4>Secreto compartido</h4>
<p>Incorpora el secreto compartido de la autenticaci&#243;n RADIUS. El secreto compartido deber&#225; tener las mismas caracter&#237;sticas que una buena contrase&#241;a. No existe ning&#250;n valor predeterminado para este campo.</p>
<A NAME="fwapc"></A><h4>Confirmar secreto compartido</h4>
<p>Confirmaci&#243;n del secreto compartido de la autenticaci&#243;n RADIUS.</p>
<A NAME="fwapn"></A><h4>N&#250;mero de puerto</h4>
<p>Especifica el puerto en el que el servidor RADIUS recibe la comunicaci&#243;n. El valor predeterminado es 1645.</p>
<A NAME="fwaad"></A><h4>Tiempo de espera</h4>
<p>Especifica el intervalo de tiempo en segundos que se debe esperar a que un servidor RADIUS responda antes de que se agote el tiempo de espera. El valor predeterminado es de 3 segundos. Reconocer&#225; cualquier n&#250;mero que especifique el tiempo de espera en segundos.</p>
<A NAME="fwabo"></A><h4>Nivel de autenticaci&#243;n</h4>
<p>El nivel de autenticaci&#243;n se define de forma independiente para cada m&#233;todo de autenticaci&#243;n. El valor indica en qu&#233; medida se debe confiar en un mecanismo de autenticaci&#243;n. Una vez que el usuario se ha autenticado, este valor se guarda en el token SSO de la sesi&#243;n. Cuando se presenta el token SSO a una aplicaci&#243;n a la que desea acceder el usuario, la aplicaci&#243;n utiliza el valor almacenado para determinar si el nivel es suficiente para permitir el acceso al usuario. Si el nivel de autenticaci&#243;n guardado en un token SSO no satisface el valor m&#237;nimo necesario, la aplicaci&#243;n puede solicitar al usuario que se autentique de nuevo mediante un servicio con un mayor nivel de autenticaci&#243;n. El valor predeterminado es 0.</p>
<p><hr size="1" noshade><p><b>Nota &#8211; </b>Si no se especifica ning&#250;n nivel de autenticaci&#243;n, el token SSO almacena el valor especificado en el <A HREF="service.scserviceprofile.iplanetamauthservice.html#fwbfn">Nivel de autenticaci&#243;n predeterminado</A> del atributo de autenticaci&#243;n "Principal".</p>
<hr size="1" noshade></p>
<br />

</body>
</html>
