<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Restablecimiento de contrase&#241;a
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="service.scserviceprofile.iplanetampasswordresetservice"></A><h3>Restablecimiento de contrase&#241;a</h3>
<p><A NAME="indexterm-197"></A>Access Manager proporciona un servicio de restablecimiento de contrase&#241;as que permite a los usuarios recibir un mensaje de correo electr&#243;nico con una nueva contrase&#241;a o restablecer su contrase&#241;a para acceder a una aplicaci&#243;n o servicio espec&#237;fico protegido por Access Manager. Los atributos de restablecimiento de contrase&#241;a son atributos de dominio. Los atributos son:</p>
<ul><li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwe">Validaci&#243;n de usuario</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwd">Pregunta secreta</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwh">Filtro de b&#250;squeda</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwi">DN base</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwj">DN de conexi&#243;n</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwl">Contrase&#241;a de conexi&#243;n</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwk">Opci&#243;n de restablecimiento de contrase&#241;a</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwq">Opci&#243;n de notificaci&#243;n de cambio de contrase&#241;a</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwp">Restablecimiento de contrase&#241;a</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwm">Pregunta personal</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwo">N&#250;mero m&#225;ximo de preguntas</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwn">Cambio de contrase&#241;a obligatorio en el siguiente inicio de sesi&#243;n</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwr">Bloqueo por fallo de restablecimiento de contrase&#241;a</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuxh">Recuento de bloqueos por fallo de restablecimiento de contrase&#241;a</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuww">Intervalo de bloqueos por fallo de restablecimiento de contrase&#241;a</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuxg">Direcci&#243;n de correo electr&#243;nico para enviar notificaci&#243;n de bloqueo</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwt">Avisar a usuario despu&#233;s de N fallos</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuxa">Duraci&#243;n del bloqueo por fallo de restablecimiento de contrase&#241;a</A> </p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuxb">Nombre de atributo de bloqueo de restablecimiento de contrase&#241;a</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuxt">Valor de atributo de bloqueo de restablecimiento de contrase&#241;a</A></p>
</li>
</ul>
<A NAME="fsuwe"></A><h4>Validaci&#243;n de usuario</h4>
<p>Este atributo especifica el valor que se utiliza para buscar el usuario cuya contrase&#241;a se va a restablecer.</p>
<A NAME="fsuwd"></A><h4>Pregunta secreta</h4>
<p>Este campo permite agregar una lista de preguntas que el usuario puede utilizar para restablecer su contrase&#241;a. Para agregar una pregunta, escr&#237;bala en el campo Secret Question (Pregunta secreta) y haga clic en Agregar. Las preguntas seleccionadas aparecer&#225;n en la p&#225;gina User Profile (Perfil de usuario) del usuario. A continuaci&#243;n, el usuario puede seleccionar una pregunta para restablecer la contrase&#241;a. Los usuarios pueden crear su propia pregunta si se selecciona el atributo Personal Question Enabled (Pregunta personal habilitada).</p>
<A NAME="fsuwh"></A><h4>Filtro de b&#250;squeda</h4>
<p>Este atributo especifica el filtro de b&#250;squeda que se utilizar&#225; para encontrar entradas de usuario.</p>
<A NAME="fsuwi"></A><h4>DN base</h4>
<p>Este atributo especifica el DN desde el que se iniciar&#225; la b&#250;squeda de usuario. Si no se especifica ning&#250;n DN, la b&#250;squeda comenzar&#225; desde el DN de dominio. No se debe utilizar <tt>cn=directorymanager</tt> como el DN de base debido a conflictos de autenticaci&#243;n de proxy.</p>
<A NAME="fsuwj"></A><h4>DN de conexi&#243;n</h4>
<p>Este valor de atributo se utiliza con la contrase&#241;a de conexi&#243;n para restablecer la contrase&#241;a del usuario.</p>
<A NAME="fsuwl"></A><h4>Contrase&#241;a de conexi&#243;n</h4>
<p>Este valor de atributo se utiliza con el DN de conexi&#243;n para restablecer la contrase&#241;a del usuario.</p>
<A NAME="fsuwk"></A><h4>Opci&#243;n de restablecimiento de contrase&#241;a</h4>
<p>Este atributo determina el nombre de clase para restablecer la contrase&#241;a. El nombre de clase predeterminado es <tt>com.sun.identity.password.</tt><tt>RandomPasswordGenerator </tt> . La clase de restablecimiento de contrase&#241;a puede personalizarse mediante un complemento. La interfaz <tt>PasswordGenerator</tt> debe implementar esta clase.</p>
<A NAME="fsuwq"></A><h4>Opci&#243;n de notificaci&#243;n de cambio de contrase&#241;a</h4>
<p>Este atributo determina el m&#233;todo para notificar al usuario el restablecimiento de la contrase&#241;a. El nombre de clase predeterminado es: <tt>com.sun.identity.password.</tt><tt>EmailPassword </tt> La clase de notificaci&#243;n de contrase&#241;a puede personalizarse mediante un complemento. La interfaz <tt>NotifyPassword</tt> debe implementar esta clase. Consulte el documento Access Manager Developer's Guide (Gu&#237;a de desarrolladores de Access Manager) para obtener m&#225;s informaci&#243;n.</p>
<A NAME="fsuwp"></A><h4>Restablecimiento de contrase&#241;a</h4>
<p>La selecci&#243;n de este atributo habilitar&#225; la funci&#243;n de restablecimiento de contrase&#241;a.</p>
<A NAME="fsuwm"></A><h4>Pregunta personal</h4>
<p>La selecci&#243;n de este atributo permitir&#225; que un usuario cree una &#250;nica pregunta para el restablecimiento de la contrase&#241;a.</p>
<A NAME="fsuwo"></A><h4>N&#250;mero m&#225;ximo de preguntas</h4>
<p>Este valor especifica el n&#250;mero m&#225;ximo de preguntas que se presentar&#225;n en la p&#225;gina de restablecimiento de contrase&#241;a.</p>
<A NAME="fsuwn"></A><h4>Cambio de contrase&#241;a obligatorio en el siguiente inicio de sesi&#243;n</h4>
<p>Cuando se habilita, esta opci&#243;n obliga al usuario a cambiar su contrase&#241;a en el siguiente inicio de sesi&#243;n. Si desea que un administrador, distinto al de nivel superior, defina la opci&#243;n de forzar el restablecimiento de contrase&#241;a, deber&#225; modificar las ACI de permisos predeterminadas para que permitan el acceso a dicho atributo.</p>
<A NAME="fsuwr"></A><h4>Bloqueo por fallo de restablecimiento de contrase&#241;a</h4>
<p>Este atributo especifica si no se permite a los usuarios que restablezcan su contrase&#241;a si dicho usuario no consigue restablecerla con la aplicaci&#243;n de restablecimiento de contrase&#241;a. Esta funci&#243;n no est&#225; habilitada de forma predeterminada.</p>
<A NAME="fsuxh"></A><h4>Recuento de bloqueos por fallo de restablecimiento de contrase&#241;a</h4>
<p>Este atributo define el n&#250;mero de intentos que un usuario tiene para restablecer una contrase&#241;a en el intervalo de tiempo definido en Password Reset Failure Lockout Interval (Intervalo de bloqueos por fallo de restablecimiento de contrase&#241;a) antes de que se le bloquee. Por ejemplo, si el recuento de bloqueo de fallo de restablecimiento de contrase&#241;a se define en 5 y el intervalo de bloqueo de fallo de inicio de sesi&#243;n se definen en 5 minutos, el usuario tendr&#225; cinco oportunidades en cinco minutos para restablecer la contrase&#241;a antes de que se le bloquee.</p>
<A NAME="fsuww"></A><h4>Intervalo de bloqueos por fallo de restablecimiento de contrase&#241;a</h4>
<p>Este atributo define el tiempo (en minutos) en el que se pueden completar los intentos de restablecimiento de contrase&#241;a (como se ha definido en el recuento de bloqueos por fallo de restablecimiento de contrase&#241;a) antes del bloqueo.</p>
<A NAME="fsuxg"></A><h4>Direcci&#243;n de correo electr&#243;nico para enviar notificaci&#243;n de bloqueo</h4>
<p>Este atributo especifica la direcci&#243;n de correo electr&#243;nico que recibir&#225; la notificaci&#243;n si se bloquea a un usuario del servicio de restablecimiento de contrase&#241;a. Especifique varias direcciones de correo electr&#243;nico en una lista separada por espacios.</p>
<A NAME="fsuwt"></A><h4>Avisar a usuario despu&#233;s de N fallos</h4>
<p>Este atributo especifica el n&#250;mero de fallos de restablecimiento de contrase&#241;a que pueden producirse antes de que Access Manager env&#237;e un mensaje de advertencia en el que se indique que se bloquear&#225; el usuario.</p>
<A NAME="fsuxa"></A><h4>Duraci&#243;n del bloqueo por fallo de restablecimiento de contrase&#241;a</h4>
<p>Este atributo define el tiempo (en minutos) durante el que el usuario no podr&#225; intentar restablecer la contrase&#241;a si se ha producido un bloqueo.</p>
<A NAME="fsuxb"></A><h4>Nombre de atributo de bloqueo de restablecimiento de contrase&#241;a</h4>
<p>Este atributo contiene el valor <i>inetuserstatus</i>, que se define en el valor del atributo de bloqueo de restablecimiento de contrase&#241;a. Si el usuario queda bloqueado por Restablecimiento de contrase&#241;a y la variable "Duraci&#243;n de bloqueo por fallo de restablecimiento de contrase&#241;a" se define en 0 minutos, <i>inetuserstatus</i> se definir&#225; como inactivo, prohibiendo que el usuario intente restablecer la contrase&#241;a.</p>
<A NAME="fsuxt"></A><h4>Valor de atributo de bloqueo de restablecimiento de contrase&#241;a</h4>
<p>Este atributo especifica el valor de <i>inetuserstatus</i> (incluido en el nombre de atributo de bloqueo de restablecimiento de contrase&#241;a) del estado del usuario como activo o inactivo. Si el usuario queda bloqueado por Restablecimiento de contrase&#241;a y la variable "Duraci&#243;n de bloqueo por fallo de restablecimiento de contrase&#241;a" se define en 0 minutos, <i>inetuserstatus</i> se definir&#225; como inactivo, prohibiendo que el usuario intente restablecer la contrase&#241;a.</p>

<br />

</body>
</html>
