<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Registro 
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="service.scserviceprofile.iplanetamloggingservice"></A><h3>Registro </h3>
<p><A NAME="indexterm-206"></A>El servicio de registro proporciona mensajes de error y estado relacionados con la administraci&#243;n de Access Manager. Un administrador puede configurar valores como, por ejemplo, el tama&#241;o del archivo de registro y la ubicaci&#243;n de dicho archivo. Access Manager puede registrar eventos en archivos de texto sin formato o en una base de datos relacional. Los atributos del servicio de registro son atributos globales. Los atributos son:</p>
<ul><li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxbsv">Tama&#241;o m&#225;ximo de registro</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxbsg">N&#250;mero de archivos de historial</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxbzh">Ubicaci&#243;n del archivo de registro</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxbwg">Tipo de registro</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxbrd">Nombre de usuario de base de datos</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxcdf">Contrase&#241;a de usuario de base de datos</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxcep">Contrase&#241;a de usuario de base de datos (confirmar)</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxbvb">Nombre del controlador de base de datos</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxbsb">Campos de registro configurables</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxccb">Frecuencia de verificaci&#243;n de registro</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxbxe">Tiempo de firma de registro</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxcbz">Registro seguro</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxbxt">N&#250;mero m&#225;ximo de registros</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxbwp">N&#250;mero de archivos por archivaci&#243;n</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxbyw">Tama&#241;o de b&#250;fer</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxbvh">Tama&#241;o de b&#250;fer de memoria de fallo de DB</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxcea">Tiempo de almacenamiento en b&#250;fer</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamloggingservice.html#fxbsn">B&#250;fer de tiempo</A></p>
</li>
</ul>
<A NAME="fxbsv"></A><h4>Tama&#241;o m&#225;ximo de registro</h4>
<p>Este atributo acepta un valor para el tama&#241;o m&#225;ximo (en bytes) de un archivo de registro de Access Manager. El valor predeterminado es 1000000.</p>
<A NAME="fxbsg"></A><h4>N&#250;mero de archivos de historial</h4>
<p>Este atributo tiene un valor equivalente al n&#250;mero de archivos de registro de copia de seguridad que se retendr&#225;n para an&#225;lisis hist&#243;ricos. Se puede introducir cualquier n&#250;mero entero en funci&#243;n del tama&#241;o de la partici&#243;n y el espacio disponible en disco del sistema local. El valor predeterminado es 3.</p>
<p>Los archivos s&#243;lo son v&#225;lidos para el tipo de registro FILE. Si se establece en DB, no habr&#225; archivos de historial y Access Manager no establecer&#225; de forma expl&#237;cita el l&#237;mite de tama&#241;o de los archivos.</p>
<p><hr size="1" noshade><p><b>Nota &#8211; </b>Si se introduce el valor 0, se interpretar&#225; que es igual al valor 1, es decir, si se especifica 0, se crear&#225; un archivo de registro de historial.</p>
<hr size="1" noshade></p><A NAME="fxbzh"></A><h4>Ubicaci&#243;n del archivo de registro</h4>
<p>La funci&#243;n de registro basada en archivos necesita una ubicaci&#243;n en la que guardar los archivos de registro. Este campo acepta una ruta de directorio completa a dicha ubicaci&#243;n. La ubicaci&#243;n predeterminada es:</p>
<p><tt>/var/opt/SUNWam/logs</tt></p>
<p>Si se especifica un directorio diferente al predeterminado, Access Manager crear&#225; este directorio en caso de no existir. Deber&#237;a definir los permisos necesarios para ese directorio (por ejemplo, 0700).</p>
<p>Cuando se configura la ubicaci&#243;n para el registro de base de datos (como Oracle o MySQL), parte de la ubicaci&#243;n del registro distingue entre may&#250;sculas y min&#250;sculas. Por ejemplo, si el registro se realiza en una base de datos Oracle, la ubicaci&#243;n del registro deber&#237;a ser (advierta la utilizaci&#243;n de may&#250;sculas y min&#250;sculas):</p>
<p><tt>jdbc:oracle:thin:@machine.domain:port:DBName</tt></p>
<p>Para configurar el registro en la base de datos, agregue los archivos del controlador JDBC a la ruta de clase JVM del contenedor Web. Deber&#225; agregar manualmente los archivos del controlador JDBC a la ruta de clase de la secuencia de comandos <tt>amadmin</tt>, de lo contrario, el registro de <tt>amadmin</tt> no puede cargar el controlador JDBC.</p>
<p>Los cambios realizados en los atributos de registro se aplican normalmente despu&#233;s de guardarlos. No es necesario reiniciar el servidor. Sin embargo, s&#237; debe reiniciarlo si realiza cambios en el registro de seguridad.</p>
<A NAME="fxbwg"></A><h4>Tipo de registro</h4>
<p>Permite especificar File (Archivo) para el registro de archivo sin formato, o DB para el registro de base de datos.</p>
<p>Si el nombre de usuario o la contrase&#241;a de base de datos no es v&#225;lida, esto afectar&#225; gravemente al procesamiento de Access Manager. Si Access Manager o la consola se vuelven inestables, debe definir la siguiente propiedad en <tt>AMConfig.properties</tt>:</p>
<p><i>com.iplanet.am.logstatus=INACTIVE</i></p>
<p>Una vez definida la propiedad, reinicie el servidor. A continuaci&#243;n, puede iniciar una sesi&#243;n en la consola y restablecer el atributo de registro. A continuaci&#243;n, cambie la propiedad <i>logstatus</i> a <i>ACTIVE </i> y reinicie el servidor.</p>
<A NAME="fxbrd"></A><h4>Nombre de usuario de base de datos</h4>
<p>Este atributo acepta el nombre del usuario que se conectar&#225; a la base de datos cuando el atributo de tipo de registro se establece en DB.</p>
<A NAME="fxcdf"></A><h4>Contrase&#241;a de usuario de base de datos</h4>
<p>Este atributo acepta la contrase&#241;a del usuario de la base de datos cuando el tipo de registro se ha definido en DB.</p>
<A NAME="fxcep"></A><h4>Contrase&#241;a de usuario de base de datos (confirmar)</h4>
<p>Confirme la contrase&#241;a de la base de datos.</p>
<A NAME="fxbvb"></A><h4>Nombre del controlador de base de datos</h4>
<p>Este atributo permite especificar el controlador que se utiliza para la clase de implementaci&#243;n del registro.</p>
<A NAME="fxbsb"></A><h4>Campos de registro configurables</h4>
<p>Representa la lista de campos que se van a registrar. De forma predeterminada, se registran todos los campos: Los campos son:</p>
<ul><li><p>CONTEXTID</p>
</li>
<li><p>DOMAIN</p>
</li>
<li><p>HOSTNAME</p>
</li>
<li><p>IPADDRESS</p>
</li>
<li><p>LOGGED BY</p>
</li>
<li><p>LOGLEVEL</p>
</li>
<li><p>LOGINID</p>
</li>
<li><p>MESSAGEID</p>
</li>
<li><p>MODULENAME</p>
</li>
</ul>
<p>Como m&#237;nimo, deben registrarse CONTEXTID, DOMAIN, HOSTNAME, LOGINID y MESSAGEID.</p>
<A NAME="fxccb"></A><h4>Frecuencia de verificaci&#243;n de registro</h4>
<p>Este atributo define la frecuencia (en segundos) con la que el servidor deber&#237;a verificar los registros para detectar una manipulaci&#243;n no autorizada. El valor predeterminado es de 3.600 segundos. Este par&#225;metro s&#243;lo es v&#225;lido para el registro seguro.</p>
<A NAME="fxbxe"></A><h4>Tiempo de firma de registro</h4>
<p>Este par&#225;metro define la frecuencia (en segundos) con la que se firmar&#225; el registro. El valor predeterminado es de 900 segundos. Este par&#225;metro s&#243;lo es v&#225;lido para el registro seguro.</p>
<A NAME="fxcbz"></A><h4>Registro seguro</h4>
<p>Este atributo habilita o deshabilita el registro seguro. De forma predeterminada, esta funci&#243;n est&#225; desactivada. El registro seguro habilita la detecci&#243;n de cambios o un uso no autorizado en los registros de seguridad.</p>
<A NAME="fxbxt"></A><h4>N&#250;mero m&#225;ximo de registros</h4>
<p>Este atributo define el n&#250;mero m&#225;ximo de registros que mostrar&#225;n las interfaces de Java <!-- was interface. No mapping rule. -->LogReader, independientemente de los registros que coincidan con la consulta de lectura. De forma predeterminada, est&#225; definido en 500. El usuario que llama a la API de registro mediante la clase <i>LogQuery</i> puede anular este registro.</p>
<A NAME="fxbwp"></A><h4>N&#250;mero de archivos por archivaci&#243;n</h4>
<p>Este atributo s&#243;lo es v&#225;lido para el registro seguro. Especifica cu&#225;ndo se deben archivar los archivos de registro y el almac&#233;n de claves, y cu&#225;ndo se debe regenerar el almac&#233;n de claves seguro para posteriores registros de seguridad. El valor predeterminado es de cinco archivos por registrador.</p>
<A NAME="fxbyw"></A><h4>Tama&#241;o de b&#250;fer</h4>
<p>Este atributo especifica la cantidad m&#225;xima de registros que se almacenar&#225;n en el b&#250;fer antes de que el servicio de registro intente escribirlos en el repositorio de registro. El valor predeterminado es de un registro.</p>
<A NAME="fxbvh"></A><h4>Tama&#241;o de b&#250;fer de memoria de fallo de DB</h4>
<p>Este atributo define el n&#250;mero m&#225;ximo de registros que se conservar&#225; en la memoria si el registro de la base de datos (DB) falla. Este atributo s&#243;lo es v&#225;lido cuando se ha especificado el registro de DB. Cuando el servicio de registro de Access Manager pierde la conexi&#243;n con la base de datos, guardar&#225; en b&#250;fer el n&#250;mero de registros especificados. Este atributo tiene como valor predeterminado el doble del valor definido en el atributo de tama&#241;o de b&#250;fer.</p>
<A NAME="fxcea"></A><h4>Tiempo de almacenamiento en b&#250;fer</h4>
<p>Este atributo especifica la cantidad de tiempo que los registros se conservar&#225;n en el b&#250;fer antes de que se env&#237;en al servicio de registro. Este atributo se aplica si Enable Time Buffering (Activar tiempo de almacenamiento en b&#250;fer) est&#225; definido en ON (Activado). El valor predeterminado es 3.600 segundos.</p>
<A NAME="fxbsn"></A><h4>B&#250;fer de tiempo</h4>
<p>Cuando se selecciona como ON (Activado), Access Manager define un l&#237;mite de tiempo para guardar en b&#250;fer los registros. La cantidad de tiempo se define en el atributo de tiempo de almacenamiento en b&#250;fer.</p>

<br />

</body>
</html>
