<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>
<head>

  <meta http-equiv="Content-type" content="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Plataforma - Ayuda en l&#237;nea de la consola de Sun Java System Federated Access Manager 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &#169; 2008 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">



<a name="service.scplatform"></a><h4>Plataforma</h4>
<p><a name="indexterm-208"></a>El servicio de plataforma es aqu&#233;l en el que se pueden agregar
servidores adicionales a las configuraciones de Federated Access Manager, as&#237; como otras
opciones aplicadas en el nivel superior de la aplicaci&#243;n Federated Access Manager.
Los atributos del servicio de plataforma son globales. Los atributos son:</p>
<ul><li><p><a href="#fxcsy">Nombre del sitio</a></p></li>
<li><p><a href="#fxcqf">Nombre de ejemplo</a></p></li>
<li><p><a href="#fxcgy">Idioma de plataforma</a></p></li>
<li><p><a href="#fxcpo">Dominios de cookies</a></p></li>
<li><p><a href="#fxcsh">URL de servicio de inicio de sesi&#243;n</a></p></li>
<li><p><a href="#fxcrt">URL de servicio de cierre de sesi&#243;n</a></p></li>
<li><p><a href="#fxcmi">Idiomas disponibles</a></p></li>
<li><p><a href="#fxctg">Conjunto de caracteres del cliente</a></p></li></ul>


<a name="fxcsy"></a><h5>Nombre del sitio</h5>
<p>El servicio de asignaci&#243;n de nombres lee este atributo en el momento
de la inicializaci&#243;n. La lista identifica de forma exclusiva el nombre FQDN
con el n&#250;mero de puerto del equilibrador de carga o el SRA
de equilibrado de carga para los servidores secundarios de Federated Access Manager.
Si el host especificado en una solicitud para una URL de servicio
no se encuentra en la lista, el servicio de asignaci&#243;n de nombres
rechazar&#225; la solicitud. En este atributo s&#243;lo debe utilizarse el protocolo de
servicio de asignaci&#243;n de nombres. Consulte <a href="service.scplatformsitelistadd.html">Para crear un nombre de sitio nuevo</a>.</p>

<a name="fxcqf"></a><h5>Nombre de ejemplo</h5>
<p>El servicio de asignaci&#243;n de nombres lee este atributo en el momento
de la inicializaci&#243;n. Esta lista contiene los servidores de la sesi&#243;n de
Federated Access Manager en una &#250;nica configuraci&#243;n de Federated Access Manager. Por
ejemplo, si hay dos instancias de Federated Access Manager instaladas que deben
funcionar como una, deben incluirse ambas en esta lista. Si el host
especificado en una solicitud para una URL de servicio no se encuentra
en la lista, el servicio de asignaci&#243;n de nombres rechazar&#225; la solicitud.
En este atributo s&#243;lo debe utilizarse el protocolo de servicio de asignaci&#243;n
de nombres. Consulte <a href="service.scplatformserverlistadd.html">Para crear un nombre de instancia nuevo</a>.</p>

<a name="fxcgy"></a><h5>Idioma de plataforma</h5>
<p>El valor de configuraci&#243;n regional de la plataforma es el subtipo de
idioma predeterminado con el que se instal&#243; Federated Access Manager. Los servicios
administraci&#243;n, registro y autenticaci&#243;n se administran con el idioma de este valor.
El valor predeterminado es en_US. Consulte <a href="supportedlang.html">Idiomas admitidos</a> para obtener una lista de
los subtipos de idiomas admitidos.</p>

<a name="fxcpo"></a><h5>Dominios de cookies</h5>
<p>La lista de dominios que se devolver&#225;n en el encabezado de cookie
al configurar una cookie en el explorador del usuario durante la autenticaci&#243;n.
Si se deja vac&#237;o, no se configurar&#225; ning&#250;n dominio de cookie. Es
decir, la cookie de sesi&#243;n de Federated Access Manager s&#243;lo se reenviar&#225;
a Federated Access Manager y no al resto de servidores del dominio.</p><p>Si se requiere SSO con otros servidores del dominio, este atributo debe
configurarse con el dominio de cookies. Si dispone de dos interfaces en
dominios distintos de una instancia de Federated Access Manager, deber&#225; configurar ambos
dominios de cookies en este atributo. Si se utiliza un equilibrador de
carga, el dominio de cookies debe ser el del dominio del equilibrador
de carga y no los servidores detr&#225;s del equilibrador. El valor predeterminado
de este campo es el dominio del Federated Access Manager instalado.</p>

<a name="fxcsh"></a><h5>URL de servicio de inicio de sesi&#243;n</h5>
<p>Este campo especifica la URL de la p&#225;gina de inicio de sesi&#243;n.
El valor predeterminado de este atributo es <tt>/Service_DEPLOY_URI/UI/Login</tt>. </p>

<a name="fxcrt"></a><h5>URL de servicio de cierre de sesi&#243;n</h5>
<p>Este campo especifica la URL de la p&#225;gina de cierre de sesi&#243;n.
El valor predeterminado de este atributo es <tt>/Service_DEPLOY_URI/UI/Logout</tt>. </p>

<a name="fxcmi"></a><h5>Idiomas disponibles</h5>
<p>Este atributo almacena todos las configuraciones regionales configuradas para la plataforma. Considere
una aplicaci&#243;n que permite al usuario elegir la configuraci&#243;n regional del usuario.
La aplicaci&#243;n obtendr&#225; el atributo del perfil de la plataforma y mostrar&#225;
al usuario la lista de configuraciones regionales. El usuario elegir&#225; una configuraci&#243;n
regional y la aplicaci&#243;n la configurar&#225; en la entrada de usuario <i>preferredLocale</i>.</p>

<a name="fxctg"></a><h5>Conjunto de caracteres del cliente</h5>
<p>Este atributo especifica el conjunto de caracteres establecido para los distintos clientes
en el nivel de la plataforma. Contiene una lista con los tipos
de clientes y los correspondientes conjuntos de caracteres. Consulte <a href="service.scplatformclientcharsetsadd.html">Para crear un conjunto de caracteres nuevo</a> para obtener
m&#225;s informaci&#243;n.</p>
<br/>

</body>
</html>
