<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Authentifizierung
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="authentication.authproperties"></A><h2>Authentifizierung</h2>
<p><A NAME="indexterm-5"></A>Der allgemeine Authentifizierungsdienst muss f&#252;r einen Bereich als Dienst registriert werden, bevor sich ein Benutzer &#252;ber die anderen Authentifizierungsmodultypen anmelden kann. &#220;ber den Core-Authentifizierungsdienst kann der Access Manager-Administrator Standardwerte f&#252;r die Authentifizierungsparameter eines Bereichs festlegen. Diese Werte werden verwendet, wenn keine vorrangigen Werte in den betreffenden Authentifizierungsmodulen angegeben sind. Die Standardwerte des Core-Authentifizierungsdienstes werden nach der Installation in der Datei <tt>amAuth.xml </tt>festgelegt und in Directory Server gespeichert.</p>
<p>Es gibt folgende Authentifizierungseigenschaften:</p>
<table border="0" cellspacing="5"><tr><td valign="top"><p>Erweiterte Eigenschaften</p></td><td valign="top"><p>&#220;ber diese Schaltfl&#228;che zeigen Sie die Core-Authentifizierungsattribute an, die f&#252;r den Bereich festgelegt werden k&#246;nnen. Die globalen Attribute sind auf einen Bereich nicht anwendbar und werden daher nicht angezeigt.</p>
</td></tr><tr><td valign="top"><p>Standard-Authentifizierungskette</p></td><td valign="top"><p>Legt die Authentifizierungskette f&#252;r den Bereich fest. Jede Kette, die Sie im Attribut Authentifizierungsverkettung erstellen, wird in der Pulldown-Liste angezeigt und kann ausgew&#228;hlt werden. Weitere Informationen finden Sie unter <A HREF="authentication.newauthconfig.html#authentication.newauthconfig">So erstellen Sie eine neue Authentifizierungskette</A>.</p>
</td></tr><tr><td valign="top"><p>Administrator-Authentifizierungskette</p></td><td valign="top"><p>Definiert die Authentifizierungskette ausschlie&#223;lich f&#252;r Administratoren. Dieses Attribut kann verwendet werden, wenn f&#252;r Administratoren eine andere Authentifizierungskette verwendet werden soll als f&#252;r Endbenutzer. Die in diesem Attribut konfigurierten Module werden beim Zugriff auf die Access Manager-Konsole &#252;bernommen.</p>
</td></tr><tr><td valign="top"><p>Standarderfolgs-URL</p></td><td valign="top"><p>Gibt den URL an, an den der Benutzer nach erfolgreicher Authentifizierung beim Bereich weitergeleitet wird.</p>
</td></tr><tr><td valign="top"><p>Modulinstanzen</p></td><td valign="top"><p>Definiert und konfiguriert die Standard-Authentifizierungsmodule von Access Manager f&#252;r den Bereich. Sie k&#246;nnen auch mehrere Instanzen des gleichen Authentifizierungsmoduls hinzuf&#252;gen. Weitere Informationen finden Sie unter <A HREF="authentication.newauthinstance.html#authentication.newauthinstance">So erstellen Sie eine neue Authentifizierungsmodulinstanz</A>.</p>
</td></tr><tr><td valign="top"><p>Authentifizierungsverkettung</p></td><td valign="top"><p>Sie k&#246;nnen ein oder mehrere Authentifizierungsmodule konfigurieren, denen ein Benutzer seine Anmeldeinformationen vorlegen muss. Dieser Vorgang wird als Authentifizierungsverkettung bezeichnet. Mit diesem Attribut k&#246;nnen Sie die Optionen f&#252;r die Authentifizierungsverkettung f&#252;r den Bereich definieren. Die von Ihnen erstellten Ketten werden in der Liste Standard-Authentifizierungskette angezeigt. Weitere Informationen finden Sie unter <A HREF="authentication.newauthconfig.html#authentication.newauthconfig">So erstellen Sie eine neue Authentifizierungskette</A>.</p>
</td></tr></table>

<br />

</body>
</html>
