<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>So f&#252;gen Sie einer Anbieter-Entity einen neuen Remote-Dienstanbieter hinzu
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="federation.fsserviceproviderremoteadd"></A><h3>So f&#252;gen Sie einer Anbieter-Entity einen neuen Remote-Dienstanbieter hinzu</h3>
<p>Ein <b>Remote-Anbieter</b> befindet sich nicht auf demselben Server wie Access Manager. Die Konfiguration der Attribute eines neuen Remote-Dienstanbieters beinhaltet das Hinzuf&#252;gen der Metadaten des Dienstanbieters zum Entity-Profil. Der Ausgangspunkt f&#252;r dieses Verfahren ist <A HREF="federation.fsserviceprovider.html#federation.fsserviceprovider">So f&#252;gen Sie einer Anbieter-Entity einen Dienstanbieter hinzu</A>.</p>
<p><hr size="1" noshade><p><b>Hinweis &#8211; </b>Zus&#228;tzliche Attribute k&#246;nnen konfiguriert werden, sie werden jedoch auf der Seite f&#252;r die anf&#228;ngliche Konfiguration nicht angezeigt. Siehe <A HREF="federation.fsserviceproviderremoteprofile.html#federation.fsserviceproviderremoteprofile">So &#228;ndern Sie einen Remote-Dienstanbieter in einer Anbieter-Entity</A>.</p>
<hr size="1" noshade></p><ol><li><p><b>Geben Sie Informationen f&#252;r die allgemeinen Attribute an.</b></p><p>Allgemeine Attribute enthalten Werte, die den Identity-Anbieter selbst allgemein beschreiben.</p>
<table border="0" cellspacing="5"><tr><td valign="top"><p>Beschreibung</p></td><td valign="top"><p>Der Wert dieses Attributs ist die Beschreibung, die Sie bei der Erstellung der Entity eingegeben haben. Sie k&#246;nnen die urspr&#252;nglich eingegebene Beschreibung &#228;ndern bzw. eine hinzuf&#252;gen, wenn noch keine vorhanden ist.</p>
</td></tr><tr><td valign="top"><p>Protokollunterst&#252;tzungsaufz&#228;hlung</p></td><td valign="top"><p>W&#228;hlen Sie die von dieser Entity unterst&#252;tzte Version von Liberty Alliance Project Liberty Identity Federation Framework (Liberty ID-FF) aus.</p>
<ul><li><p><tt>urn:liberty:iff:2003-08</tt> bezieht sich auf Liberty ID-FF-Version 1.2.</p>
</li>
<li><p><tt>urn:liberty:iff:2002-12</tt> bezieht sich auf Liberty ID-FF-Version 1.1.</p>
</li>
</ul>
</td></tr></table>
</li>
<li><p><b>W&#228;hlen Sie eine der zur Verf&#252;gung stehenden Authentifizierungsdom&#228;nen aus, um sie dem Anbieter zuzuweisen.</b></p><p>Anbieter k&#246;nnen zu einer oder mehreren Authentifizierungsdom&#228;nen geh&#246;ren. Ein Anbieter, bei dem keine Authentifizierungsdom&#228;ne angegeben ist, kann jedoch nicht an Kommunikationen teilnehmen, die auf den  Liberty Alliance Project-Spezifikationen beruhen. Wenn keine Authentifizierungsdom&#228;nen erstellt wurden, k&#246;nnen Sie dieses Attribut sp&#228;ter definieren.</p>
</li>
<li><p><b>Geben Sie Informationen f&#252;r die Dienstanbieterattribute an.</b></p><p>Dienstanbieterattribute legen allgemeine Informationen zum Dienstanbieter fest.</p>
<table border="0" cellspacing="5"><tr><td valign="top"><p>Assertion Consumer-URL</p></td><td valign="top"><p>Geben Sie einen URL zu dem Endpunkt ein, der alle SAML-Assertionen empf&#228;ngt und verarbeitet, die an den Dienstanbieter gesendet werden.</p>
</td></tr><tr><td valign="top"><p>URL-ID des Assertion Consumer-Dienstes</p></td><td valign="top"><p>Wenn der Wert des allgemeinen Attributs der Protokollunterst&#252;tzung <tt>urn:liberty:iff:2003-08</tt> lautet, geben Sie die erforderliche ID ein.</p>
</td></tr><tr><td valign="top"><p>URL des Assertion Consumer-Dienstes als Standard festlegen</p></td><td valign="top"><p>Aktivieren Sie dieses Kontrollk&#228;stchen, wenn Sie den URL des Assertion Consumer-Dienstes als Standardwert verwenden m&#246;chten, falls eine Anforderung keinen Bezeichner enth&#228;lt.</p>
</td></tr></table>
</li>
<li><p><b>Klicken Sie auf &#8220;OK&#34;, um den Anbieter zur Entity hinzuzuf&#252;gen.</b></p></li>
<li><p><b>W&#228;hlen Sie eine andere Option aus dem Men&#252; &#8220;Ansicht&#34; aus, um weitere Einstellungen der Entity zu konfigurieren, oder klicken Sie auf &#8220;Speichern&#34;, um die Konfiguration abzuschlie&#223;en.</b></p></li>
</ol>
<br />

</body>
</html>
