<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>
<head>

  <meta http-equiv="Content-type" content="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Authentifizierungsdom&#228;nen - Online-Hilfe zur Sun Java System Federated Access Manager 8.0-Konsole
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &#169; 2008 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">



<a name="federation.fsauthdomains"></a><h3>Authentifizierungsdom&#228;nen</h3>
<a name="indexterm-58"></a><p>Eine <b>Authentifizierungsdom&#228;ne</b> ist eine Verbindung aus mehreren Dienstanbietern und mindestens einem Identity-Anbieter,
mit denen Principals Gesch&#228;ftstransaktionen in einer sicheren und nahtlosen Umgebung ausf&#252;hren k&#246;nnen.
Zum Erstellen und Auff&#252;llen einer Authentifizierungsdom&#228;ne erstellen Sie zun&#228;chst eine <b>Entity</b> zur
Verwaltung der <b>Metadaten</b> (Konfigurationsinformationen, die eine bestimmte Identit&#228;tsdienstarchitektur definieren), und zwar f&#252;r
jeden Anbieter, der Mitglied der Authentifizierungsdom&#228;ne sein soll. Dann konfigurieren und speichern
Sie die Authentifizierungsdom&#228;ne. Abschlie&#223;end bearbeiten Sie die Eigenschaften der Entity, um der
Authentifizierungsdom&#228;ne eine Entity (einen konfigurierten Anbieter) hinzuzuf&#252;gen.</p>
<hr><p><b>Hinweis &#8211; </b>Weitere Informationen zu Entities finden Sie unter <a href="federation.fsentitydescriptors.html">Entities: Anbieter und Partner</a>.</p>
<hr>
<p>Alle konfigurierten Authentifizierungsdom&#228;nen sind unter der entsprechenden &#220;berschrift aufgelistet. In Verbindung mit
Authentifizierungsdom&#228;nen m&#252;ssen die folgenden Aufgaben ausgef&#252;hrt werden:</p>
<ul><li><p><a href="federation.fsauthdomainsadd.html">So erstellen Sie eine neue Authentifizierungsdom&#228;ne</a></p></li>
<li><p><a href="federation.fsauthdomainsedit.html">So &#228;ndern Sie das Profil einer Authentifizierungsdom&#228;ne</a></p></li>
<li><p><a href="federation.fsauthdomainsselectprovider.html">So f&#252;gen Sie einer Authentifizierungsdom&#228;ne Anbieter hinzu</a></p></li>
<li><p><a href="deleteauthdomain.html">So l&#246;schen Sie das Profil einer Authentifizierungsdom&#228;ne</a></p></li></ul>

<hr><p><b>Hinweis &#8211; </b>Die Mitglieder einer Authentifizierungsdom&#228;ne m&#252;ssen im Vorfeld eine  <b>Circle of Trust</b>-Betriebsvereinbarung basierend auf
den <a href="http://www.projectliberty.org/specs/liberty-trust-models-guidelines-v1.0.pdf">Liberty Trust Model Guidelines</a> getroffen haben.</p>
<hr>

<br/>

</body>
</html>
