<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>So &#228;ndern Sie einen Remote-Dienstanbieter in einer Anbieter-Entity
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="federation.fsserviceproviderremoteprofile"></A><h3>So &#228;ndern Sie einen Remote-Dienstanbieter in einer Anbieter-Entity</h3>
<A NAME="indexterm-81"></A><p>Nach dem Erstellen einer Entity und dem Hinzuf&#252;gen eines Dienstanbieters k&#246;nnen Sie das Profil des Dienstanbieters bearbeiten. Hierbei ist es m&#246;glicherweise erforderlich, Werte zu Attributen hinzuzuf&#252;gen, die beim anf&#228;nglichen Hinzuf&#252;gen des Dienstanbieters nicht konfiguriert werden konnten, oder konfigurierte Daten zu &#228;ndern. Der Ausgangspunkt ist &#8220;Entities&#34; in der Verbindungsschnittstelle.</p>
<ol><li><p><b>Klicken Sie auf den Namen einer konfigurierten Anbieter-Entity, um deren Profil zu &#228;ndern.</b></p><p>Die Profilseite der Entity wird angezeigt.</p>
</li>
<li><p><b>W&#228;hlen Sie im Men&#252; &#8220;Ansicht&#34; die Option &#8220;Dienstanbieter&#34; aus.</b></p></li>
<li><p><b>&#196;ndern Sie die Werte f&#252;r die allgemeinen Attribute.</b></p><p>Allgemeine Attribute enthalten Werte, die den Identity-Anbieter selbst allgemein beschreiben.</p>
<table border="0" cellspacing="5"><tr><td valign="top"><p>Anbietertyp</p></td><td valign="top"><p>Der statische Wert dieses Attributs legt fest, ob es sich um einen Host- oder einen Remote-Anbieter handelt.</p>
</td></tr><tr><td valign="top"><p>Beschreibung</p></td><td valign="top"><p>Der Wert dieses Attributs ist die Beschreibung, die Sie bei der Erstellung der Entity eingegeben haben. Sie k&#246;nnen die urspr&#252;nglich eingegebene Beschreibung &#228;ndern bzw. eine hinzuf&#252;gen, wenn noch keine vorhanden ist.</p>
</td></tr><tr><td valign="top"><p>Protokollunterst&#252;tzungsaufz&#228;hlung</p></td><td valign="top"><p>W&#228;hlen Sie die von dieser Entity unterst&#252;tzte Version von Liberty Alliance Project Liberty Identity Federation Framework (Liberty ID-FF) aus.</p>
<ul><li><p><tt>urn:liberty:iff:2003-08</tt> bezieht sich auf Liberty ID-FF-Version 1.2.</p>
</li>
<li><p><tt>urn:liberty:iff:2002-12</tt> bezieht sich auf Liberty ID-FF-Version 1.1.</p>
</li>
</ul>
</td></tr><tr><td valign="top"><p>Zuordnungs-Binding Servernamen-ID</p></td><td valign="top"><p>Durch die Namensbezeichnerzuordnung kann ein Dienstanbieter einen Namensbezeichner f&#252;r einen Principal erhalten, der sich im Namespace eines anderen Dienstanbieters zusammengeschlossen hat. So kann der Anbieter, von dem die Anforderung ausgeht, mit dem anderen Dienstanbieter &#252;ber den Principal kommunizieren, ohne dass eine Identity-Verbindung f&#252;r den Principal zwischen ihnen vorliegt. Geben Sie einen URI an, der das zum Ermitteln des Bezeichners verwendete Protokoll angibt, und klicken Sie auf &#8220;Hinzuf&#252;gen&#34;.</p>
<p><hr size="1" noshade><p><b>Hinweis &#8211; </b>Derzeit unterst&#252;tzt das Profil f&#252;r die Namensbezeichnerzuordnung in Access Manager nur SOAP. Bei Verwendung dieses Attributs muss dieser Wert wie folgt lauten: <tt>http://projectliberty.org/profiles/nim-sp-http</tt>.</p>
<hr size="1" noshade></p></td></tr><tr><td valign="top"><p>Signaturschl&#252;ssel: Schl&#252;sselalias</p></td><td valign="top"><p>Zertifikate werden in einer Java-Keystore-Datei gespeichert. Jedes Zertifikat in der Datei wird einem Alias zugeordnet, der dazu verwendet wird, das betreffende Zertifikat abzurufen. Geben Sie den Schl&#252;ssel-Alias ein, der dem Zertifikat zugeordnet ist, das zum Signieren von Anforderungen und Antworten verwendet wird.</p>
</td></tr><tr><td valign="top"><p>Verschl&#252;sselungsschl&#252;ssel: Schl&#252;sselalias</p></td><td valign="top"><p>Zertifikate werden in einer Java-Keystore-Datei gespeichert. Jedes Zertifikat in der Datei wird einem Alias zugeordnet, der dazu verwendet wird, das betreffende Zertifikat abzurufen. Geben Sie den Schl&#252;ssel-Alias ein, der dem Sicherheitszertifikat des Anbieters zugeordnet ist.</p>
</td></tr><tr><td valign="top"><p>Verschl&#252;sselungsschl&#252;ssel: Schl&#252;sselgr&#246;&#223;e</p></td><td valign="top"><p>Geben Sie die Schl&#252;ssell&#228;nge ein, die f&#252;r die Interaktion eines Webdienstbenutzers mit einer anderen Entity verwendet wird.</p>
</td></tr><tr><td valign="top"><p>Verschl&#252;sselungsschl&#252;ssel: Verschl&#252;sselungsmethode</p></td><td valign="top"><p>W&#228;hlen Sie eine Verschl&#252;sselungsmethode aus. Zur Auswahl stehen:</p>
<ul><li><p>Keine</p>
</li>
<li><p>AES</p>
</li>
<li><p>DESede</p>
</li>
</ul>
</td></tr><tr><td valign="top"><p>Verschl&#252;sselung des Namensbezeichners</p></td><td valign="top"><p>Aktivieren Sie dieses Kontrollk&#228;stchen, um die Verschl&#252;sselung des Namensbezeichners zu aktivieren.</p>
</td></tr></table>
</li>
<li><p><b>&#196;ndern Sie die Werte f&#252;r die Kommunikations-URL-Attribute.</b></p><p>Kommunikations-URL-Attribute enthalten Orte, an die die Anbieter &#220;bertragungen senden k&#246;nnen, die f&#252;r den betreffenden Identity-Anbieter vorgesehen sind.</p>
<table border="0" cellspacing="5"><tr><td valign="top"><p>SOAP-Endpunkt</p></td><td valign="top"><p>Geben Sie einen URL f&#252;r den SOAP-Nachrichtenempf&#228;nger des Identity-Anbieters ein. Dieser Wert legt die Adresse des SOAP-Empf&#228;ngers f&#252;r Kommunikationen fest, die nicht &#252;ber einen Browser erfolgen.</p>
</td></tr><tr><td valign="top"><p>Einzelabmeldungsdienst</p></td><td valign="top"><p>Geben Sie einen URL ein, an den Dienstanbieter Abmeldeanforderungen senden k&#246;nnen. Die Einzelabmeldung synchronisiert die Abmeldefunktion &#252;ber alle von diesem Identity-Anbieter authentifizierten Sitzungen.</p>
</td></tr><tr><td valign="top"><p>Umleitungs-URL f&#252;r Einzelabmeldung</p></td><td valign="top"><p>Geben Sie einen URL ein, an den der Identity-Anbieter den Principal nach einer Abmeldung umleiten kann.</p>
</td></tr><tr><td valign="top"><p>Verbindungstrennungsdienst</p></td><td valign="top"><p>Geben Sie einen URL ein, an den Dienstanbieter Verbindungstrennungsanforderungen senden k&#246;nnen.</p>
</td></tr><tr><td valign="top"><p>Umleitungs-URL f&#252;r Verbindungstrennung</p></td><td valign="top"><p>Geben Sie einen URL ein, an den der Identity-Anbieter den Principal nach einer Verbindungstrennung umleiten kann.</p>
</td></tr><tr><td valign="top"><p>Namensregistrierungsdienst</p></td><td valign="top"><p>Geben Sie einen URL ein, an den Dienstanbieter Anforderungen zur Angabe eines Namensbezeichners senden k&#246;nnen, der f&#252;r die Kommunikation mit dem Identity-Anbieter &#252;ber einen bestimmten Principal verwendet wird. Dieser optionale Dienst kann erst nach der Einrichtung einer Verbindungssitzung implementiert werden.</p>
</td></tr><tr><td valign="top"><p>Umleitungs-URL f&#252;r Namensregistrierung</p></td><td valign="top"><p>Geben Sie einen URL ein, an den der Identity-Anbieter den Principal nach einer HTTP Redirect-basierten Namensregistrierung umleitet.</p>
</td></tr></table>
</li>
<li><p><b>&#196;ndern Sie die Werte f&#252;r die Kommunikationsprofilattribute.</b></p><p>Ein Liberty Alliance Project-<b>Profil</b> legt die Kombination aus dem Inhalt einer Nachricht und dem zu ihrem Transport verwendeten Mechanismus fest. Die folgenden Kommunikationsprofilattribute legen die Profile fest, die vom Identity-Anbieter f&#252;r die einzelnen Funktionen verwendet werden.</p>
<table border="0" cellspacing="5"><tr><td valign="top"><p>Verbindungstrennung</p></td><td valign="top"><p>W&#228;hlen Sie ein Profil aus, das der Identity-Anbieter verwenden kann, um andere Anbieter &#252;ber die Verbindungstrennung eines Principals zu unterrichten.</p>
<ul><li><p>HTTP Redirect</p>
</li>
<li><p>SOAP</p>
</li>
</ul>
</td></tr><tr><td valign="top"><p>Einzelabmeldung</p></td><td valign="top"><p>W&#228;hlen Sie ein Profil aus, das der Identity-Anbieter verwenden kann, um andere Anbieter &#252;ber die Abmeldung eines Principals zu unterrichten.</p>
<ul><li><p>HTTP Redirect</p>
</li>
<li><p>HTTP Get</p>
</li>
<li><p>SOAP</p>
</li>
</ul>
</td></tr><tr><td valign="top"><p>Namensregistrierung</p></td><td valign="top"><p>W&#228;hlen Sie ein Profil aus, das andere Anbieter verwenden k&#246;nnen, wenn sie Kontakt mit dem betreffenden Identity-Anbieter aufnehmen, um einen neuen Namensbezeichner f&#252;r einen Principal zu registrieren.</p>
<ul><li><p>HTTP Redirect</p>
</li>
<li><p>SOAP</p>
</li>
</ul>
</td></tr><tr><td valign="top"><p>Single Sign-On/Verbindung</p></td><td valign="top"><p>W&#228;hlen Sie das Profil aus, das dieser Identity-Anbieter beim Senden von Antworten zur Authentifizierung oder von Verbindungsanforderungen verwenden soll.</p>
<ul><li><p>Browser-Ver&#246;ffentlichung (Browser-basiertes HTTP POST-Protokoll)</p>
</li>
<li><p>Browser-Produkt (nicht Browser-basiertes SOAP-Protokoll)</p>
</li>
<li><p>LECP (Liberty-f&#228;higer Client-Proxy)</p>
</li>
</ul>
</td></tr></table>
</li>
<li><p><b>W&#228;hlen Sie eine der zur Verf&#252;gung stehenden Authentifizierungsdom&#228;nen aus, um sie dem Anbieter zuzuweisen.</b></p><p>Anbieter k&#246;nnen zu einer oder mehreren Authentifizierungsdom&#228;nen geh&#246;ren. Ein Anbieter, bei dem keine Authentifizierungsdom&#228;ne angegeben ist, kann jedoch nicht an Kommunikationen teilnehmen, die auf den  Liberty Alliance Project-Spezifikationen beruhen. Wenn keine Authentifizierungsdom&#228;nen erstellt wurden, k&#246;nnen Sie dieses Attribut sp&#228;ter definieren.</p>
</li>
<li><p><b>&#196;ndern Sie die Werte f&#252;r die Dienstanbieterattribute.</b></p><p>Dienstanbieterattribute legen allgemeine Informationen zum Dienstanbieter fest.</p>
<table border="0" cellspacing="5"><tr><td valign="top"><p>Assertion Consumer-URL</p></td><td valign="top"><p>Geben Sie einen URL zu dem Endpunkt ein, der alle SAML-Assertionen empf&#228;ngt und verarbeitet, die an den Dienstanbieter gesendet werden.</p>
</td></tr><tr><td valign="top"><p>URL-ID des Assertion Consumer-Dienstes</p></td><td valign="top"><p>Wenn der Wert des allgemeinen Attributs der Protokollunterst&#252;tzung <tt>urn:liberty:iff:2003-08</tt> lautet, geben Sie die erforderliche ID ein.</p>
</td></tr><tr><td valign="top"><p>URL des Assertion Consumer-Dienstes als Standard festlegen</p></td><td valign="top"><p>Aktivieren Sie dieses Kontrollk&#228;stchen, wenn Sie den URL des Assertion Consumer-Dienstes als Standardwert verwenden m&#246;chten, falls eine Anforderung keinen Bezeichner enth&#228;lt.</p>
</td></tr><tr><td valign="top"><p>Authentifizierungsanforderung signieren</p></td><td valign="top"><p>Aktivieren Sie dieses Kontrollk&#228;stchen, wenn der Dienstanbieter Authentifizierungsanforderungen immer signieren soll.</p>
</td></tr><tr><td valign="top"><p>Namensregistrierung nach Verbindung</p></td><td valign="top"><p>Aktivieren Sie dieses Kontrollk&#228;stchen, um einem Dienstanbieter die Teilnahme an der Namensregistrierung zu erm&#246;glichen, nachdem die Verbindung mit einem Principal hergestellt wurde. </p>
</td></tr><tr><td valign="top"><p>Namens-ID-Richtlinie</p></td><td valign="top"><p>W&#228;hlen Sie die Option aus, die dem anfordernden Benutzer Einfluss auf die Namens-ID-Richtlinie beim Identity-Anbieter gew&#228;hrt. Zur Auswahl stehen folgende Optionen:</p>
<table border="0" cellspacing="5"><tr><td valign="top"><p>Keine</p></td><td valign="top"><p>Der Identity-Anbieter gibt den bzw. die Namensbezeichner der Verbindung zur&#252;ck, die zwischen dem Identity-Anbieter und dem anfordernden Dienstanbieter bzw. der Partnergruppe des Principals besteht. Falls keine Verbindung besteht, wird ein Fehler zur&#252;ckgegeben.</p>
</td></tr><tr><td valign="top"><p>Einmalig</p></td><td valign="top"><p>Der Identity-Anbieter gibt nach der Verbindung einen tempor&#228;ren, einmaligen Bezeichner f&#252;r den Principal aus.</p>
</td></tr><tr><td valign="top"><p>F&#246;deriert</p></td><td valign="top"><p>Der Identity-Anbieter kann eine neue Identit&#228;tsverbindung starten, wenn f&#252;r den Principal noch keine Verbindung besteht.</p>
</td></tr></table>
</td></tr><tr><td valign="top"><p>Affiliation Federation (Partnerverbindung)</p></td><td valign="top"><p>Aktivieren Sie dieses Kontrollk&#228;stchen, wenn Sie die Zuordnungsf&#246;derierung aktivieren m&#246;chten.</p>
</td></tr></table>
</li>
<li><p><b>Geben Sie Informationen zu den Attributen der Proxy-Authentifizierungskonfiguration an.</b></p><p>Ein Identity-Anbieter, der aufgefordert wird, einen Principal zu authentifizieren, der sich bereits bei einem anderen Identity-Anbieter authentifiziert hat, kann die Authentifizierungsanforderung im Namen des anfordernden Dienstanbieters an den Identity-Anbieter weitergeben, der die Authentifizierung durchgef&#252;hrt hatte. Dieser Vorgang wird als <b>dynamisches Identity-Anbieter-Proxying</b> bezeichnet. Proxy-Authentifizierungskonfigurationsattribute definieren Werte f&#252;r das dynamische Identity-Anbieter-Proxying.</p>
<table border="0" cellspacing="5"><tr><td valign="top"><p>Proxy-Authentifizierung</p></td><td valign="top"><p>Aktivieren Sie dieses Kontrollk&#228;stchen, um dynamisches Identity-Anbieter-Proxying zu aktivieren.</p>
</td></tr><tr><td valign="top"><p>Liste der Proxy-Identity-Anbieter</p></td><td valign="top"><p>Eine Liste mit Identity-Anbietern, die f&#252;r dynamisches Identity-Anbieter-Proxying verwendet werden k&#246;nnen. Der Wert dieses Attributs ist ein URI, der mit dem Wert &#252;bereinstimmt, der im Attribut &#8220;Entity-Name&#34; der Entity definiert wurde, zu der der Eigent&#252;mer/Anbieter geh&#246;rt.</p>
</td></tr><tr><td valign="top"><p>Maximale Anzahl an Proxies</p></td><td valign="top"><p>Geben Sie die maximale Anzahl an Proxy-Identity-Anbietern an, an die eine Anforderung gesendet werden kann.</p>
</td></tr><tr><td valign="top"><p>Einf&#252;hrungs-Cookie f&#252;r Proxyvorgang verwenden</p></td><td valign="top"><p>Aktivieren Sie dieses Kontrollk&#228;stchen, wenn zum Auffinden des Proxy-Identity-Anbieters Einf&#252;hrungen verwendet werden sollen.</p>
</td></tr></table>
</li>
<li><p><b>Geben Sie die Werte f&#252;r die Organisationsprofilattribute an.</b></p><p>Die Attribute des Organisationsprofils beinhalten grundlegende Informationen, die bei der Interaktion mit einem Principal verlangt werden k&#246;nnen. Diese Attribute sind optional.</p>
<p><hr size="1" noshade><p><b>Hinweis &#8211; </b>Wenn das Namensattribut einen Wert enth&#228;lt, m&#252;ssen Werte zu den Anzeigenamen- und URL-Attributen hinzugef&#252;gt werden.</p>
<hr size="1" noshade></p><table border="0" cellspacing="5"><tr><td valign="top"><p>Namen</p></td><td valign="top"><p>Geben Sie den zul&#228;ssigen Namen f&#252;r die Organisation der Entity ein und klicken Sie dann auf &#8220;Hinzuf&#252;gen&#34;. Der Wert wird im Format <i>locale</i>|<i> organization-name</i> definiert. Beispiel: <tt>en</tt>|<tt>example.com</tt>.</p>
</td></tr><tr><td valign="top"><p>Anzeigename</p></td><td valign="top"><p>Geben Sie einen Namen f&#252;r die Organisation der Entity ein, der sich f&#252;r die Anzeige f&#252;r einen Principal eignet, und klicken Sie dann auf &#8220;Hinzuf&#252;gen&#34;. Der Wert wird im Format <i>locale</i>|<i>organization-display-name</i> definiert. Beispiel: <tt>en</tt>|<tt>example.com</tt>. </p>
</td></tr><tr><td valign="top"><p>URL</p></td><td valign="top"><p>Geben Sie den URL der Organisation ein und klicken Sie dann auf &#8220;Hinzuf&#252;gen&#34;. Der Wert wird im Format <i>locale</i>|<i>organization-URL</i> definiert. Beispiel: <tt>en</tt>|<tt>http://www.example.com</tt>.</p>
</td></tr></table>
</li>
<li><p><b>Zur Konfiguration von Kontaktpersonen f&#252;r den Anbieter klicken Sie auf &#8220;Neue Kontaktperson&#34;.</b></p><p>Dieses Attribut ist optional. Weitere Informationen finden Sie unter <A HREF="federation.fscreatecontactperson.html#federation.fscreatecontactperson">So f&#252;gen Sie einem Anbieter in einer Anbieter-Entity eine Kontaktperson hinzu</A>.</p>
</li>
<li><p><b>Klicken Sie auf &#8220;Speichern&#34;, um die Konfiguration abzuschlie&#223;en.</b></p></li>
</ol>
<br />

</body>
</html>
