<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>So &#228;ndern Sie das Profil einer Authentifizierungsdom&#228;ne
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="federation.fsauthdomainsedit"></A><h3>So &#228;ndern Sie das Profil einer Authentifizierungsdom&#228;ne</h3>
<A NAME="indexterm-60"></A><p>F&#252;hren Sie die folgenden Schritte aus, um die allgemeinen Attribute einer vorhandenen Authentifizierungsdom&#228;ne zu &#228;ndern oder der Dom&#228;ne Anbieter hinzuzuf&#252;gen. Der Ausgangspunkt ist der Eintrag f&#252;r Authentifizierungsdom&#228;nen der Verbindungsschnittstelle.</p>
<ol><li><p><b>Klicken Sie auf den Namen einer konfigurierten Authentifizierungsdom&#228;ne, um ihr Profil zu &#228;ndern oder um ihr Anbieter hinzuzuf&#252;gen.</b></p><p>Die Seite &#8220;Authentifizierungs-Dom&#228;ne bearbeiten&#34; wird angezeigt.</p>
</li>
<li><p><b>Geben Sie neue Werte ein oder bearbeiten Sie bestehende Werte f&#252;r die Attribute der Authentifizierungsdom&#228;ne unter &#8220;Allgemein&#34;:</b></p><table border="0" cellspacing="5"><tr><td valign="top"><p>Name</p></td><td valign="top"><p>Der statische Wert dieses Attributs ist der Name, den Sie bei der Erstellung der Authentifizierungsdom&#228;ne eingegeben haben.</p>
</td></tr><tr><td valign="top"><p>Beschreibung</p></td><td valign="top"><p>Beim Wert dieses Attributs handelt es sich um eine Beschreibung der Authentifizierungsmethode. Die bereits eingegebene Beschreibung kann im Bedarfsfall ge&#228;ndert werden.</p>
</td></tr><tr><td valign="top"><p>URL des Schreibprogramm-Dienstes</p></td><td valign="top"><p>Dieses Attribut legt den Pfad des Dienstes fest, der das allgemeine Dom&#228;nencookie erstellt. Der URL hat folgendes Format: <tt><b> http://</tt><i>common-domain-host<tt></i>:</tt><i>port<tt></i>/common/writer </b></tt>.</p>
</td></tr><tr><td valign="top"><p>URL des Leseprogramm-Dienstes</p></td><td valign="top"><p>Dieses Attribut legt den Pfad des Dienstes fest, der das allgemeine Dom&#228;nencookie liest. Der URL hat folgendes Format: <tt><b> http://</tt><i>common-domain-host<tt></i>:</tt><i>port<tt></i>/common/transfer </b></tt>.</p>
</td></tr><tr><td valign="top"><p>Status</p></td><td valign="top"><p>Der Standardstatus ist &#8220;Aktiv&#34;. Durch Auswahl von &#8220;Inaktiv&#34; deaktivieren Sie die Kommunikation mit der Authentifizierungsdom&#228;ne.</p>
</td></tr></table>
</li>
<li><p><b>Klicken Sie auf &#8220;Hinzuf&#252;gen&#34;, um der Authentifizierungsdom&#228;ne Anbieter hinzuzuf&#252;gen.</b></p><p>Die Seite zur Auswahl vertrauensw&#252;rdiger Partner wird angezeigt.</p>
</li>
<li><p><b>W&#228;hlen Sie einen oder mehrere Anbieter aus und klicken Sie auf den Pfeil zum Hinzuf&#252;gen, um sie zu markieren.</b></p><p>Die Liste enth&#228;lt die Namen von Entities, die erstellt und mit Anbietern aufgef&#252;llt wurden. Weitere Informationen finden Sie unter <A HREF="federation.fsauthdomainsselectprovider.html#federation.fsauthdomainsselectprovider">So f&#252;gen Sie einer Authentifizierungsdom&#228;ne Anbieter hinzu</A>.</p>
</li>
<li><p><b>Klicken Sie auf &#8220;OK&#34;, um die Anbieter in der Authentifizierungsdom&#228;ne zu speichern.</b></p><p>Sie kehren zum vorherigen Profilfenster der Authentifizierungsdom&#228;ne zur&#252;ck.</p>
</li>
<li><p><b>Klicken Sie auf &#8220;Speichern&#34;, um den Vorgang abzuschlie&#223;en.</b></p></li>
</ol>
<br />

</body>
</html>
