<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>So &#228;ndern Sie die allgemeinen Attribute einer Anbieter-Entity oder einer Partner-Entity
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="federation.fsentitydescriptorsprofile"></A><h3>So &#228;ndern Sie die allgemeinen Attribute einer Anbieter-Entity oder einer Partner-Entity</h3>
<A NAME="indexterm-71"></A><A NAME="indexterm-72"></A><A NAME="indexterm-73"></A><p>Nachdem Sie eine Entity erstellt haben, k&#246;nnen Sie deren Profil bearbeiten. Dazu kann die &#196;nderung von Attributen, das Hinzuf&#252;gen von Identity-Anbietern und Dienstanbietern bzw. das Konfigurieren von Partnerschaften geh&#246;ren. Das Bearbeiten der allgemeinen Attribute eines Entity-Profils kann eine &#196;nderung der bereits festgelegten allgemeinen Attribute, das Hinzuf&#252;gen einer Kontaktperson oder die Eingabe optionaler Organisationsinformationen umfassen. Folgendes Verfahren dient zur Bearbeitung der allgemeinen Attribute. Der Ausgangspunkt ist der Bildschirm &#8220;Entities&#34; unter &#8220;Verbindung&#34;.</p>
<ol><li><p><b>W&#228;hlen Sie den Namen einer konfigurierten Entity, um deren Profil zu &#228;ndern. </b></p><p>Standardm&#228;&#223;ig wird die Seite f&#252;r die allgemeinen Attribute des Profils der Entity angezeigt. Wenn Sie sich nicht auf der Seite f&#252;r die allgemeinen Attribute befinden, k&#246;nnen Sie im Men&#252; &#8220;Ansicht&#34; die Option &#8220;Allgemein&#34; ausw&#228;hlen.</p>
</li>
<li><p><b>Bearbeiten Sie die Werte einer der allgemeinen Entity-Attribute.</b></p><table border="0" cellspacing="5"><tr><td valign="top"><p>Entity-Name</p></td><td valign="top"><p>Der statische Wert dieses Attributs ist der Name, den Sie bei der Erstellung der Entity eingegeben haben.</p>
</td></tr><tr><td valign="top"><p>Typ</p></td><td valign="top"><p>Der statische Wert dieses Attributs ist der Entity-Typ, &#8220;Anbieter&#34; bzw. &#8220;Partner&#34;.</p>
</td></tr><tr><td valign="top"><p>Beschreibung</p></td><td valign="top"><p>Der Wert dieses Attributs ist die Beschreibung, die Sie bei der Erstellung der Entity eingegeben haben. Sie k&#246;nnen die urspr&#252;nglich eingegebene Beschreibung &#228;ndern bzw. eine hinzuf&#252;gen, wenn noch keine vorhanden ist.</p>
</td></tr></table>
</li>
<li><p><b>Geben Sie die Werte f&#252;r die Attribute von &#8220;Profil der Entity-Kontaktperson&#34; an. </b></p><p>Die Attribute von &#8220;Profil der Entity-Kontaktperson&#34; bieten Informationen dazu, an wen man sich in Bezug auf die Entity wenden kann. Diese Attribute sind optional.</p>
<table border="0" cellspacing="5"><tr><td valign="top"><p>Vorname</p></td><td valign="top"><p>Geben Sie den Vornamen der Entity-Kontaktperson ein.</p>
</td></tr><tr><td valign="top"><p>Nachname</p></td><td valign="top"><p>Geben Sie den Nachnamen der Entity-Kontaktperson ein.</p>
</td></tr><tr><td valign="top"><p>Typ</p></td><td valign="top"><p>W&#228;hlen Sie den Kontakttyp im Dropdown-Men&#252; aus:</p>
<ul><li><p>Administrativ</p>
</li>
<li><p>Rechnungswesen</p>
</li>
<li><p>Technisch</p>
</li>
<li><p>Weitere</p>
</li>
</ul>
</td></tr><tr><td valign="top"><p>Firma</p></td><td valign="top"><p>Geben Sie den Namen der Firma ein, bei der diese Person besch&#228;ftigt ist.</p>
</td></tr><tr><td valign="top"><p>Liberty-Haupt-ID</p></td><td valign="top"><p>Geben Sie einen URI (Uniform Resource Identifier) ein, der auf eine Instanz des (URI) Profils mit den personenbezogenen Informationen zu der Kontaktperson verweist.</p>
</td></tr><tr><td valign="top"><p>E-Mails</p></td><td valign="top"><p>Geben Sie mindestens eine E-Mail-Adresse f&#252;r die Kontaktperson ein und klicken Sie dann auf &#8220;Hinzuf&#252;gen&#34;.</p>
</td></tr><tr><td valign="top"><p>Telefonnummern</p></td><td valign="top"><p>Geben Sie mindestens eine Telefonnumer f&#252;r die Kontaktperson ein und klicken Sie dann auf &#8220;Hinzuf&#252;gen&#34;.</p>
</td></tr></table>
</li>
<li><p><b>Geben Sie die Werte f&#252;r die Organisationsprofilattribute an.</b></p><p>Die Attribute des Organisationsprofils beinhalten grundlegende Informationen, die bei der Interaktion mit einem Principal verlangt werden k&#246;nnen. Diese Attribute sind optional.</p>
<p><hr size="1" noshade><p><b>Hinweis &#8211; </b>Wenn das Namensattribut einen Wert enth&#228;lt, m&#252;ssen Werte zu den Anzeigenamen- und URL-Attributen hinzugef&#252;gt werden.</p>
<hr size="1" noshade></p><table border="0" cellspacing="5"><tr><td valign="top"><p>Namen</p></td><td valign="top"><p>Geben Sie den zul&#228;ssigen Namen f&#252;r die Organisation der Entity ein und klicken Sie dann auf &#8220;Hinzuf&#252;gen&#34;. Der Wert wird im Format <i>locale</i>| <i> organization-name</i> definiert. Beispiel: <tt>en</tt>|<tt> example.com</tt>.</p>
</td></tr><tr><td valign="top"><p>Anzeigename</p></td><td valign="top"><p>Geben Sie einen Namen f&#252;r die Organisation der Entity ein, der sich f&#252;r die Anzeige f&#252;r einen Principal eignet, und klicken Sie dann auf &#8220;Hinzuf&#252;gen&#34;. Der Wert wird im Format <i>locale</i>|<i>organization-display-name</i> definiert. Beispiel: <tt>en</tt>|<tt>example.com</tt>. </p>
</td></tr><tr><td valign="top"><p>URL</p></td><td valign="top"><p>Geben Sie den URL der Organisation ein und klicken Sie dann auf &#8220;Hinzuf&#252;gen&#34;. Der Wert wird im Format <i>locale</i>|<i>organization-URL</i> definiert. Beispiel: <tt>en</tt>|<tt>http://www.example.com</tt>.</p>
</td></tr></table>
</li>
<li><p><b>Klicken Sie auf &#8220;Speichern&#34;, um die Konfiguration abzuschlie&#223;en, oder legen Sie weitere Werte f&#252;r Identity-Anbieter, Dienstanbieter oder Partner fest.</b></p><p>Wenn Sie Ihre Konfiguration fortsetzen m&#246;chten, beachten Sie folgende Informationen:</p>
<ul><li><p><b><A HREF="federation.fsidentityprovider.html#federation.fsidentityprovider">So f&#252;gen Sie einer Anbieter-Entity einen Identity-Anbieter hinzu</A> zur Definition von Werten f&#252;r Identity-Anbieter-Attribute.</b></p></li>
<li><p><b><A HREF="federation.fsserviceprovider.html#federation.fsserviceprovider">So f&#252;gen Sie einer Anbieter-Entity einen Dienstanbieter hinzu</A> zur Definition von Werten f&#252;r Dienstanbieter-Attribute.</b></p></li>
<li><p><b><A HREF="federation.fsentitydescriptorsaffiliate.html#federation.fsentitydescriptorsaffiliate">So f&#252;gen Sie Mitglieder zu einer Partner-Entity hinzu</A> zum F&#252;llen einer Partner-Entity mit Mitgliedern.</b></p></li>
</ul>
</li>
</ol>
<br />

</body>
</html>
