<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>So erstellen Sie eine neue normale Richtlinie
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="policy.policynormaladd"></A><h4>So erstellen Sie eine neue normale Richtlinie</h4>
<ol><li><p><b>W&#228;hlen Sie den Bereich aus, f&#252;r den Sie eine Richtlinie erstellen m&#246;chten.</b></p></li>
<li><p><b>Klicken Sie in der Liste &#8220;Richtlinien&#34; auf &#8220;Neue Richtlinie&#34;.</b></p></li>
<li><p><b>Geben Sie einen Namen und eine Beschreibung f&#252;r die Richtlinie ein.</b></p></li>
<li><p><b>Wenn die Richtlinie aktiv sein soll, m&#252;ssen Sie f&#252;r das Attribut &#8220;Aktiv&#34; die Option &#8220;Ja&#34; w&#228;hlen. </b></p><p>&#8220;Ja&#34; ist standardm&#228;&#223;ig ausgew&#228;hlt. Wenn die Richtlinie w&#228;hrend der Richtlinienevaluierung nicht angewendet werden soll, heben Sie die Auswahl dieses Attributs auf, um es inaktiv zu machen.</p>
</li>
<li><p><b>Es ist nicht erforderlich, zu diesem Zeitpunkt alle Felder f&#252;r normale Richtlinien zu definieren. Sie k&#246;nnen die Richtlinie erstellen und sp&#228;ter Regeln, Betreffe, Bedingungen und Response-Anbieter hinzuf&#252;gen. Falls Sie diese Felder jetzt festlegen m&#246;chten, lesen Sie die folgenden Themen:</b></p><ul><li><p><A HREF="policy.ruleadd.html#policy.ruleadd">So f&#252;gen Sie einer Richtlinie eine Regel hinzu.</A></p>
</li>
<li><p><A HREF="policy.subjectadd.html#policy.subjectadd">So f&#252;gen Sie einer Richtlinie einen Betreff hinzu.</A></p>
</li>
<li><p><A HREF="policy.conditionadd.html#policy.conditionadd">So f&#252;gen Sie einer Richtlinie eine Bedingung hinzu.</A></p>
</li>
<li><p><A HREF="policy.responseprovideradd.html#policy.responseprovideradd">So f&#252;gen Sie einer Richtlinie einen Response-Anbieter hinzu.</A></p>
</li>
</ul>
</li>
<li><p><b>Klicken Sie auf &#8220;OK&#34;.</b></p></li>
</ol>
<br />

</body>
</html>
