<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Windows NT
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="service.scserviceprofile.iplanetamauthntservice"></A><h3>Windows NT</h3>
<p><A NAME="indexterm-191"></A>Das Authentifizierungsmodul &#8220;Windows NT&#34; erm&#246;glicht die Authentifizierung bei einem Microsoft Windows NT-Server. Bei diesen Attributen handelt es sich um Bereichsattribute. Die diesen Attributen in der Dienstkonfiguration zugewiesenen Werte werden in der Windows NT-Authentifizierungsvorlage als Standardwerte verwendet. Die Dienstvorlage muss nach der Registrierung des Dienstes f&#252;r den Bereich erstellt werden. Die Standardwerte k&#246;nnen nach der Registrierung vom Bereichsadministrator ge&#228;ndert werden. Die Bereichsattribute werden nicht von Eintr&#228;gen in den Unterstrukturen des Bereichs &#252;bernommen.</p>
<p>Zur Aktivierung des Windows NT-Authentifizierungsmoduls muss Samba Client 2.2.2 heruntergeladen und im folgenden Verzeichnis installiert werden: </p>
<p><tt></tt><i>AcessManager-base<tt></i>/SUNWam/bin</tt></p>
<p>Der Samba Client ist ein Datei- und Druckserver f&#252;r die Integration von Windows- und UNIX-Computern ohne Verwendung eines separaten Windows NT/2000-Servers.</p>
<p>Red Hat Linux wird bereits mit einem Samba Client ausgeliefert, der sich im Verzeichnis <tt>/usr/bin </tt> befindet.</p>
<p>Zur Authentifizierung mit dem Windows NT-Authentifizierungsdienst f&#252;r Linux m&#252;ssen Sie die Bin&#228;rdatei des Client in das Verzeichnis  <tt></tt><i>AccessManager-base <tt></i>/identity/bin</tt> kopieren.</p>
<p>Die Windows NT-Attribute sind:</p>
<ul><li><p><A HREF="service.scserviceprofile.iplanetamauthntservice.html#fumve">Authentifizierungsdom&#228;ne</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthntservice.html#fumvp">Authentifizierungs-Host</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthntservice.html#fumvq">Dateiname f&#252;r Samba-Konfiguration</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthntservice.html#fumwi">Authentifizierungsebene</A></p>
</li>
</ul>
<A NAME="fumve"></A><h4>Authentifizierungsdom&#228;ne</h4>
<p>Legt den Namen der Dom&#228;ne fest, zu der der Benutzer geh&#246;rt.</p>
<A NAME="fumvp"></A><h4>Authentifizierungs-Host</h4>
<p>Legt den Hostnamen f&#252;r die Windows NT-Authentifizierung fest. Der Hostname sollte der netBIOS-Name sein und nicht der voll qualifizierte Dom&#228;nenname (FQDN). Standardm&#228;&#223;ig ist der erste Teil des FQDN der netBIOS-Name.</p>
<p>Falls DHCP (Dynamic Host Configuration Protocol) verwendet wird, f&#252;gen Sie einen entsprechenden Eintrag in die HOSTS-Datei auf dem Windows 2000-Computer ein. </p>
<p>Die Namensaufl&#246;sung basiert auf dem netBIOS-Namen. Falls Sie in Ihrem Subnet &#252;ber keinen Server verf&#252;gen, der die netBIOS-Namensaufl&#246;sung bereitstellt, sollten Hardcode-Zuordnungen durchgef&#252;hrt werden. Der Hostname sollte beispielsweise im Format <tt>example1</tt> eingegeben werden (nicht im Format <tt>example1.company1.com</tt>). </p>
<A NAME="fumvq"></A><h4>Dateiname f&#252;r Samba-Konfiguration</h4>
<p>Legt den Dateinamen f&#252;r die Samba-Konfiguration fest und unterst&#252;tzt im Befehl <tt>smbclient</tt> die Option<tt>-s </tt>. Der Wert muss der vollst&#228;ndige Pfad des Verzeichnisses sein, in dem sich die Samba-Konfigurationsdatei befindet. Beispiel: <tt>/etc/opt/SUNWam/config/smb.conf</tt></p>
<A NAME="fumwi"></A><h4>Authentifizierungsebene</h4>
<p>Die Authentifizierungsebene wird f&#252;r jede Authentifizierungsmethode einzeln festgelegt. Mit diesem Wert wird angegeben, wie stark einem Authentifizierungsmechanismus vertraut wird. Sobald ein Benutzer authentifiziert wurde, wird der Wert im SSO-Token der aktuellen Sitzung gespeichert. Wird der SSO-Token einer Anwendung, auf die der Benutzer zugreifen m&#246;chte, vorgelegt, bestimmt die Anwendung anhand des gespeicherten Werts, ob die Ebene ausreicht, um den Benutzer Zugriff zu gew&#228;hren. Wenn die im SSO-Token gespeicherte Authentifizierungsebene nicht den erforderlichen Mindestwert aufweist, wird der Benutzer aufgefordert, sich erneut &#252;ber einen Dienst mit einer h&#246;heren Authentifizierungsebene zu authentifizieren. Der Standardwert ist 0.</p>
<p><hr size="1" noshade><p><b>Hinweis &#8211; </b>Hinweis: Wenn keine Authentifizierungsebene angegeben wird, wird im SSO-Token der im Kern-Authentifizierungsattribut <A HREF="service.scserviceprofile.iplanetamauthservice.html#fwbfn">Standard-Authentifizierungsebene</A> angegebene Wert verwendet.</p>
<hr size="1" noshade></p>
<br />

</body>
</html>
