<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>UNIX 
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="service.scserviceprofile.iplanetamauthunixservice"></A><h3>UNIX </h3>
<p><A NAME="indexterm-189"></A>Dieses Modul gilt nur f&#252;r Solaris und erm&#246;glicht die Authentifizierung mithilfe der UNIX-Identifikation und des UNIX-Passworts eines Benutzers. Nach einer &#196;nderung der UNIX-Authentifizierungsattribute m&#252;ssen sowohl Access Manager als auch der amunixd Helper neu gestartet werden. Bei den UNIX-Authentifizierungsattributen handelt es sich sowohl um globale als auch um Bereichsattribute. Es existieren folgende Attribute:</p>
<ul><li><p><A HREF="service.scserviceprofile.iplanetamauthunixservice.html#fwbsy">Konfigurationsanschluss</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthunixservice.html#fwbqv">Authentifizierungsanschluss</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthunixservice.html#fwbrv">Zeit&#252;berschreitung</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthunixservice.html#fwbls">Threads</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthunixservice.html#fwbra">Authentifizierungsebene</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthunixservice.html#fwbky">Name des PAM-Dienstes</A></p>
</li>
</ul>
<A NAME="fwbsy"></A><h4>Konfigurationsanschluss</h4>
<p>Gibt den Anschluss an, an dem UNIX-Helper nach dem Starten die Konfigurationsinformationen der Attribute &#8220;UNIX-Helper-Authentifizierungsanschluss&#34;, &#8220;UNIX-Helper Zeit&#252;berschreitung&#34; und &#8220;UNIX-Helper-Threads&#34; empf&#228;ngt. Der Standardanschluss ist 58946.</p>
<p> Falls Sie dieses Attribut &#228;ndern, m&#252;ssen Sie auch den Eintrag <i>unixHelper.port </i> in der Datei <tt>AMConfig.properties</tt> entsprechend &#228;ndern und Access Manager neu starten.</p>
<A NAME="fwbqv"></A><h4>Authentifizierungsanschluss</h4>
<p>Gibt den Anschluss an, an dem UNIX-Helper nach der Konfiguration Authentifizierungsanforderungen empf&#228;ngt. Der Standardanschluss ist 57946.</p>
<A NAME="fwbrv"></A><h4>Zeit&#252;berschreitung</h4>
<p>Gibt die Zeit in Minuten an, die Benutzern zum Abschluss der Authentifizierung zur Verf&#252;gung steht. &#220;berschreitet ein Benutzer diesen Zeitraum, schl&#228;gt die Authentifizierung automatisch fehl. Der Standardwert ist 3 Minuten.</p>
<A NAME="fwbls"></A><h4>Threads</h4>
<p>Gibt die maximale Anzahl an gleichzeitig zugelassenen UNIX-Authentifizierungssitzungen an. Ist der maximale Wert erreicht, werden alle nachfolgenden Authentifizierungsversuche so lange verweigert, bis eine andere Sitzung beendet wird. Der Standardwert ist 5.</p>
<A NAME="fwbra"></A><h4>Authentifizierungsebene</h4>
<p>Die Authentifizierungsebene wird f&#252;r jede Authentifizierungsmethode einzeln festgelegt. Mit diesem Wert wird angegeben, wie stark einem Authentifizierungsmechanismus vertraut wird. Sobald ein Benutzer authentifiziert wurde, wird der Wert im SSO-Token der aktuellen Sitzung gespeichert. Wird der SSO-Token einer Anwendung, auf die der Benutzer zugreifen m&#246;chte, vorgelegt, bestimmt die Anwendung anhand des gespeicherten Werts, ob die Ebene ausreicht, um den Benutzer Zugriff zu gew&#228;hren. Wenn die im SSO-Token gespeicherte Authentifizierungsebene nicht den erforderlichen Mindestwert aufweist, wird der Benutzer aufgefordert, sich erneut &#252;ber einen Dienst mit einer h&#246;heren Authentifizierungsebene zu authentifizieren. Der Standardwert ist 0.</p>
<p><hr size="1" noshade><p><b>Hinweis &#8211; </b>Hinweis: Wenn keine Authentifizierungsebene angegeben wird, wird im SSO-Token der im Kern-Authentifizierungsattribut <A HREF="service.scserviceprofile.iplanetamauthservice.html#fwbfn">Standard-Authentifizierungsebene</A> angegebene Wert verwendet.</p>
<hr size="1" noshade></p><A NAME="fwbky"></A><h4>Name des PAM-Dienstes</h4>
<p>Definiert die PAM-Konfiguration bzw. den PAM-Stapel (Pluggable Authentication Module), der f&#252;r Ihr Betriebssystem ausgeliefert und f&#252;r die UNIX-Authentifizierung verwendet wird. F&#252;r Solaris l&#228;uft die Konfiguration in der Regel unter der Bezeichnung <tt>other</tt> und f&#252;r Linux unter der Bezeichnung <tt>password</tt>.</p>

<br />

</body>
</html>
