<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Windows Desktop SSO
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="service.scserviceprofile.iplanetamauthwindowsdesktopssoservice"></A><h3>Windows Desktop SSO</h3>
<p><A NAME="indexterm-190"></A>Dieses Modul ist speziell f&#252;r Windows bestimmt und ist auch als Kerberos-Authentifizierung bekannt. Der Benutzer legt Access Manager &#252;ber das SPNEGO-Protokoll (Simple and Protected GSS-API Negotiation Mechanism) ein Kerberos-Token vor. Das Windows Desktop SSO-Authentifizierungs-Plugin stellt dem Client (Benutzer) auf dem Desktop Single Sign-On-Funktionalit&#228;t bereit. Das bedeutet, dass ein Benutzer, der sich bereits bei einem Schl&#252;sselverteilungscenter authentifiziert hat, in Access Manager ohne erneute Eingabe der Anmeldeinformationen authentifiziert werden kann. Bei den Windows Desktop SSO-Attributen handelt es sich um globale Attribute. Es existieren folgende Attribute:</p>
<ul><li><p><A HREF="service.scserviceprofile.iplanetamauthwindowsdesktopssoservice.html#fwbfr">Dienst-Principal</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthwindowsdesktopssoservice.html#fwbfo">Keytab-Dateiname</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthwindowsdesktopssoservice.html#fwbhy">Kerberos-Bereich</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthwindowsdesktopssoservice.html#fwbid">Kerberos-Servername</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthwindowsdesktopssoservice.html#fwbhw">Principal mit Dom&#228;nennamen zur&#252;ckgeben</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthwindowsdesktopssoservice.html#fwbic">Authentifizierungsebene</A></p>
</li>
</ul>
<A NAME="fwbfr"></A><h4>Dienst-Principal</h4>
<p>Gibt den Kerberos-Principal an, der zur Authentifizierung verwendet wird. Verwenden Sie das folgende Format:</p>
<p><tt><b>HTTP/</tt><i>hostname.domainname@dc_domain_name<tt></i></b></tt></p>
<p><b>hostname</b> und <b>domainame</b> stehen f&#252;r den Hostnamen bzw. den Dom&#228;nennamen des Access Manager-Objekts. <b>dc_domain_name </b> ist die Kerberos-Dom&#228;ne, in der sich der Windows 2000 Kerberos-Server (Dom&#228;nen-Controller) befindet. Unter Umst&#228;nden unterscheidet sich dieser Dom&#228;nenname vom Dom&#228;nennamen in Access Manager.</p>
<A NAME="fwbfo"></A><h4>Keytab-Dateiname</h4>
<p>Gibt die zur Authentifizierung verwendete Kerberos-Keytab-Datei an. Folgendes Format wird empfohlen, auch wenn es nicht vorgeschrieben ist:</p>
<p><tt><b></tt><i>hostname<tt></i>.HTTP.keytab</b></tt></p>
<p><b>hostname</b> ist der Hostname des Access Manager-Objekts.</p>
<A NAME="fwbhy"></A><h4>Kerberos-Bereich</h4>
<p>Gibt den Dom&#228;nennamen des Kerberos-Verteilungscenters (Dom&#228;nencontroller) an. Je nach Konfiguration ist der Dom&#228;nenname des Dom&#228;nencontrollers nicht identisch mit dem Dom&#228;nennamen von Access Manager.</p>
<A NAME="fwbid"></A><h4>Kerberos-Servername</h4>
<p>Gibt den Hostnamen des Kerberos-Verteilungscenters (Dom&#228;nencontroller) an. Hier ist der vollst&#228;ndig qualifizierte Dom&#228;nenname (FQDN) des Dom&#228;nencontrollers erforderlich.</p>
<A NAME="fwbhw"></A><h4>Principal mit Dom&#228;nennamen zur&#252;ckgeben</h4>
<p>Wenn aktiviert, kann Access Manager w&#228;hrend der Authentifizierung den Kerberos-Principal mit dem Dom&#228;nennamen des Dom&#228;nencontrollers automatisch zur&#252;ckgeben.</p>
<A NAME="fwbic"></A><h4>Authentifizierungsebene</h4>
<p>Die Authentifizierungsebene wird f&#252;r jede Authentifizierungsmethode einzeln festgelegt. Mit diesem Wert wird angegeben, wie stark einem Authentifizierungsmechanismus vertraut wird. Sobald ein Benutzer authentifiziert wurde, wird der Wert im SSO-Token der aktuellen Sitzung gespeichert. Wird der SSO-Token einer Anwendung, auf die der Benutzer zugreifen m&#246;chte, vorgelegt, bestimmt die Anwendung anhand des gespeicherten Werts, ob die Ebene ausreicht, um den Benutzer Zugriff zu gew&#228;hren. Wenn die im SSO-Token gespeicherte Authentifizierungsebene nicht den erforderlichen Mindestwert aufweist, wird der Benutzer aufgefordert, sich erneut &#252;ber einen Dienst mit einer h&#246;heren Authentifizierungsebene zu authentifizieren. Der Standardwert ist 0.</p>
<p><hr size="1" noshade><p><b>Hinweis &#8211; </b>Hinweis: Wenn keine Authentifizierungsebene angegeben wird, wird im SSO-Token der im Kern-Authentifizierungsattribut <A HREF="service.scserviceprofile.iplanetamauthservice.html#fwbfn">Standard-Authentifizierungsebene</A> angegebene Wert verwendet.</p>
<hr size="1" noshade></p>
<br />

</body>
</html>
