<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Zertifikat 
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="service.scserviceprofile.iplanetamauthcertservice"></A><h3>Zertifikat </h3>
<p><A NAME="indexterm-177"></A>Mit diesem Modul kann sich ein Benutzer &#252;ber ein pers&#246;nliches digitales Zertifikat  (PDC) anmelden. Die Modulinstanz kann zur Ermittlung des Zertifikatstatus die Anwendung des Online Certificate Status Protocol (OCSP) verlangen. Die Verwendung des OCSP ist jedoch optional. Der Zugriff auf eine Ressource wird dem Benutzer auf Basis der G&#252;ltigkeit seines Zertifikats gew&#228;hrt oder verweigert. Bei den Attributen f&#252;r die Zertifikatauthentifizierung handelt es sich um Bereichsattribute. Es existieren folgende Attribute:</p>
<ul><li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbia">Zertifikat auf LDAP-Server vergleichen</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbiq">Zum Durchsuchen von LDAP nach Zertifikaten verwendetes DN-Attribut des Betreffs</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbim">Zertifikat mit CRL vergleichen</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbik">Zum Durchsuchen von LDAP nach CRLs verwendetes DN-Attribut des Herausgebers</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbin">HTTP-Parameter f&#252;r CRL-Aktualisierung</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbil">OCSP-&#220;berpr&#252;fung</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbij">LDAP-Server, auf dem die Zertifikate gespeichert sind</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbtp">LDAP-DN f&#252;r Start der Suche</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbqp">Principal-Benutzer f&#252;r LDAP-Server</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbst">Principal-Passwort f&#252;r LDAP-Server</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbiu">Principal-Passwort f&#252;r LDAP-Server (Best&#228;tigung)</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwblo">LDAP-Attribut f&#252;r Profil-ID</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwblm">SSL f&#252;r LDAP-Zugriff verwenden</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbof">F&#252;r den Zugriff auf das Benutzerprofil verwendetes Zertifikatsfeld</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbna">F&#252;r den Zugriff auf das Benutzerprofil verwendetes weiteres Zertifikatsfeld</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbiw">Vertrauensw&#252;rdige Remote-Hosts</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbkd">SSL-Anschlussnummer</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwblx">Authentifizierungsebene</A></p>
</li>
</ul>
<A NAME="fwbia"></A><h4>Zertifikat auf LDAP-Server vergleichen</h4>
<p>Legt fest, ob &#252;berpr&#252;ft werden soll, ob das bei der Anmeldung vorgelegte Benutzerzertifikat auf dem LDAP-Server gespeichert ist. Wenn keine &#220;bereinstimmung gefunden wird, wird dem Benutzer der Zugriff verweigert. Wenn eine &#220;bereinstimmung gefunden wird und keine weitere Validierung erforderlich ist, erh&#228;lt der Benutzer Zugriff. In der Standardeinstellung f&#252;hrt der Dienst f&#252;r die Zertifikatauthentifizierung keine Pr&#252;fung des Benutzerzertifikats durch.</p>
<p><hr size="1" noshade><p><b>Hinweis &#8211; </b>Ein auf dem Directory Server gespeichertes Zertifikat ist nicht in jedem Fall g&#252;ltig; unter Umst&#228;nden befindet es sich in der Liste der zur&#252;ckgezogenen Zertifikate. Siehe <A HREF="service.scserviceprofile.iplanetamauthcertservice.html#fwbim">Zertifikat mit CRL vergleichen</A>. Der Webcontainer kann jedoch die G&#252;ltigkeit des bei der Anmeldung eingegebenen Benutzerzertifikats &#252;berpr&#252;fen.</p>
<hr size="1" noshade></p><A NAME="fwbiq"></A><h4>Zum Durchsuchen von LDAP nach Zertifikaten verwendetes DN-Attribut des Betreffs</h4>
<p>Gibt das Attribut des <i>SubjectDN</i>-Werts von Zertifikaten an, der f&#252;r die Suche nach Zertifikaten in LDAP verwendet wird. Dieses Attribut muss einen Benutzereintrag eindeutig identifizieren. Der angegebene Wert wird f&#252;r die Suche verwendet. Der Standardwert ist <tt>cn</tt>.</p>
<A NAME="fwbim"></A><h4>Zertifikat mit CRL vergleichen</h4>
<p>Legt fest, ob das Benutzerzertifikat mit der CRL (Certificate Revocation List, Liste zur&#252;ckgezogener Zertifikate) auf dem LDAP-Server verglichen werden soll. Die CRL wird durch einen der Attributnamen im <i>SubjectDN</i> des Ausstellers angegeben. Wenn das Zertifikat in der CRL gespeichert ist, wird dem Benutzer der Zugriff verweigert; anderenfalls darf er fortfahren. Dieses Attribut ist standardm&#228;&#223;ig deaktiviert.</p>
<p>Zertifikate werden in der Regel zur&#252;ckgezogen, wenn sich der Status des Zertifikateigent&#252;mers ge&#228;ndert hat und er somit nicht mehr berechtigt ist, das Zertifikat zu verwenden, oder wenn der private Schl&#252;ssel eines Zertifikateigent&#252;mers ung&#252;ltig geworden ist.</p>
<A NAME="fwbik"></A><h4>Zum Durchsuchen von LDAP nach CRLs verwendetes DN-Attribut des Herausgebers</h4>
<p>Gibt das Attribut des <i>subjectDN</i>-Werts des Ausstellers des empfangenen Zertifikats an, der f&#252;r die Suche nach CRLs in LDAP verwendet wird. Dieses Feld wird nur verwendet, wenn das Attribut &#34;Zertifikat mit CRL vergleichen&#34; aktiviert ist. Der angegebene Wert wird f&#252;r die Suche verwendet. Der Standardwert ist <tt>cn</tt>.</p>
<A NAME="fwbin"></A><h4>HTTP-Parameter f&#252;r CRL-Aktualisierung</h4>
<p>Gibt die HTTP-Parameter an, die bei der Aktualisierung einer CRL zum Abrufen der CRL von einem Servlet verwendet werden. Die Werte dieser Parameter erhalten Sie von Ihrem ZA-Administrator. </p>
<A NAME="fwbil"></A><h4>OCSP-&#220;berpr&#252;fung</h4>
<p>Aktiviert die Durchf&#252;hrung der OCSP-&#220;berpr&#252;fung durch einen Verbindungsaufbau zum jeweiligen OCSP-Empf&#228;nger. Der OCSP-Empf&#228;nger wird bei der Ausf&#252;hrung wie folgt festgelegt:</p>
<ul><li><p>Wenn <tt>com.sun.identity.authentication.ocspCheck</tt>  aktiviert ist und der OCSP-Empf&#228;nger im Attribut <i>com.sun.identity.authentication.ocsp.repsonder.url </i> angegeben ist, wird der Wert des Attributs als OSCP-Empf&#228;nger verwendet.</p>
</li>
<li><p>Wenn <tt>com.sun.identity.authentication.ocspCheck</tt> aktiviert ist, der Wert des Attributs in der Datei <tt> AMConfig.properties</tt>  jedoch nicht festgelegt ist, wird der OSCP-Empf&#228;nger im Client-Zertifikat als OCSP-Empf&#228;nger verwendet. </p>
</li>
<li><p>Wenn <tt>com.sun.identity.authentication.ocspCheck</tt> deaktiviert ist oder wenn <i>com.sum.identity.authentication.ocspCheck</i> aktiviert ist, jedoch kein OCSP-Empf&#228;nger gefunden wird, wird keine OCSP-&#220;berpr&#252;fung durchgef&#252;hrt.</p>
</li>
</ul>
<p>Stellen Sie vor dem Aktivieren der OCSP-&#220;berpr&#252;fung sicher, dass die Uhrzeit des Access Manager-Computers mit der des OCSP-Empf&#228;ngercomputers m&#246;glichst &#252;bereinstimmt. Die Uhrzeit auf dem Access Manager-Computer darf keinesfalls nach der Uhrzeit des OCSP-Empf&#228;ngers liegen. Beispiel:</p>
<p><tt>OCSP responder machine - 12:00:00 pm</tt></p>
<p><tt>Access Manager machine - 12:00:30 pm</tt> </p>
<A NAME="fwbij"></A><h4>LDAP-Server, auf dem die Zertifikate gespeichert sind</h4>
<p>Gibt den Namen und die Anschlussnummer des LDAP-Servers an, auf dem die Zertifikate gespeichert sind. Der Standardwert ist der bei der Installation von Access Manager angegebene Hostname und Anschluss. Hier k&#246;nnen Hostname und Anschluss jedes LDAP-Servers angegeben werden, auf dem Zertifikate gespeichert werden. Das Format lautet <tt>hostname:port</tt>.</p>
<A NAME="fwbtp"></A><h4>LDAP-DN f&#252;r Start der Suche</h4>
<p>Gibt den DN des Knotens an, bei dem die Suche nach dem Benutzerzertifikat beginnen soll. Es gibt keinen Standardwert. Das Feld erkennt jede beliebige g&#252;ltige DN.</p>
<p>Bei Mehrfacheingaben muss der lokale Servername vorangestellt werden. Das Attribut hat folgendes Format:</p>
<p><tt>servername|search dn</tt> </p>
<p>F&#252;r Mehrfacheingaben:</p>
<p><tt>servername1|search dn servername2|search dn servername3|search dn...</tt></p>
<p>Wenn unter der Root-Organisation mehrere Eintr&#228;ge mit derselben Benutzer-ID vorhanden sind, sollte dieser Parameter so festgelegt werden, dass nur nach einem einzigen Eintrag zur Authentifizierung gesucht bzw. nur ein einziger gefunden werden kann. Wenn beispielsweise die Agenten-ID und die Benutzer-ID unter der Root-Organisation identisch sind, sollte dieser Parameter <tt>ou=Agents</tt> (f&#252;r die Authentifizierung der Root-Organisation mithilfe der Agenten-ID) und <tt>ou=People, </tt> (f&#252;r die Authentifizierung der Root-Organisation mithilfe der Benutzer-ID) lauten.</p>
<A NAME="fwbqp"></A><h4>Principal-Benutzer f&#252;r LDAP-Server</h4>
<p>Gibt den DN des Principal-Benutzers des LDAP-Servers an, auf dem die Zertifikate gespeichert sind. F&#252;r dieses Feld gibt es keinen Standardwert; jeder g&#252;ltige DN ist zul&#228;ssig. Der Principal-Benutzer muss zum Lesen und Durchsuchen der auf dem Directory Server gespeicherten Zertifikatdaten berechtigt sein.</p>
<A NAME="fwbst"></A><h4>Principal-Passwort f&#252;r LDAP-Server</h4>
<p>Gibt das LDAP-Passwort des im Feld &#8220;Principal-Benutzer f&#252;r LDAP-Server&#34; festgelegten Benutzers an. F&#252;r dieses Feld gibt es keinen Standardwert; das g&#252;ltige LDAP-Passwort f&#252;r den angegebenen Principal-Benutzer ist zul&#228;ssig. 	Dieser Wert wird als lesbarer Text im Verzeichnis gespeichert.</p>
<A NAME="fwbiu"></A><h4>Principal-Passwort f&#252;r LDAP-Server (Best&#228;tigung)</h4>
<p>Best&#228;tigen Sie das Passwort.</p>
<A NAME="fwblo"></A><h4>LDAP-Attribut f&#252;r Profil-ID</h4>
<p>Gibt das Attribut des Directory Server-Eintrags an, das dem Zertifikat entspricht, dessen Wert zur Identifizierung des richtigen Benutzerprofils verwendet werden soll. F&#252;r dieses Feld gibt es keinen Standardwert; jedes als Benutzer-ID verwendbare g&#252;ltige Attribut in einem Benutzereintrag (z. B. (<i>cn</i> oder <i> sn</i>) ist hier zul&#228;ssig.</p>
<A NAME="fwblm"></A><h4>SSL f&#252;r LDAP-Zugriff verwenden</h4>
<p>Legt fest, ob SSL f&#252;r den Zugriff auf den LDAP-Server eingesetzt werden soll. In der Standardeinstellung greift der Dienst f&#252;r die Zertifikatauthentifizierung ohne SSL auf den LDAP-Server zu.</p>
<A NAME="fwbof"></A><h4>F&#252;r den Zugriff auf das Benutzerprofil verwendetes Zertifikatsfeld</h4>
<p>Gibt an, welches Feld im Betreff-DN des Zertifikats f&#252;r die Suche nach einem &#252;bereinstimmenden Benutzerprofil verwendet werden soll. Wenn Sie beispielsweise &#8220;E-Mail-Adresse&#34; ausw&#228;hlen, sucht der Dienst f&#252;r die Zertifikatauthentifizierung das Benutzerprofil, das mit dem Attribut <i>emailAddr</i> im Benutzerzertifikat &#252;bereinstimmt. F&#252;r den Benutzer, der sich daraufhin anmeldet, wird dann das ermittelte Profil verwendet. Das Standardfeld ist <i>subject CN</i>. Diese Liste enth&#228;lt folgende Komponenten:</p>
<ul><li><p>E-Mail-Adresse</p>
</li>
<li><p>Subject CN</p>
</li>
<li><p>Subject DN</p>
</li>
<li><p>Subject UID</p>
</li>
<li><p>Weitere</p>
</li>
</ul>
<A NAME="fwbna"></A><h4>F&#252;r den Zugriff auf das Benutzerprofil verwendetes weiteres Zertifikatsfeld</h4>
<p>Wenn der Wert des Attributs &#8220;F&#252;r den Zugriff auf das Benutzerprofil verwendetes Zertifikatsfeld&#34; auf &#8220;Weitere&#34; gesetzt ist, gibt dieses Feld das Attribut an, das aus dem <i>subjectDN </i>-Wert des empfangenen Zertifikats ausgew&#228;hlt wird. Der Authentifizierungsdienst sucht dann nach dem Benutzerprofil, das dem Wert dieses Attributs entspricht.</p>
<A NAME="fwbiw"></A><h4>Vertrauensw&#252;rdige Remote-Hosts</h4>
<p>Legt eine Liste der vertrauensw&#252;rdigen Hosts fest, denen die Versendung von Zertifikaten an Access Manager anvertraut wird. Access Manager muss &#252;berpr&#252;fen, ob das Zertifikat von einem dieser Hosts stammt. Dieses Attribut wird nur f&#252;r den SSL-Anschluss verwendet. </p>
<table border="0" cellspacing="5"><tr><td valign="top"><p>Keiner</p></td><td valign="top"><p>Deaktiviert das Attribut. Dies ist die Standardeinstellung.</p>
</td></tr><tr><td valign="top"><p>Alle</p></td><td valign="top"><p>Akzeptiert die Portal Server Gateway-Zertifikatauthentifizierung von jeder Client-IP-Adresse.</p>
</td></tr><tr><td valign="top"><p>IP-ADDR</p></td><td valign="top"><p>Gibt eine Liste der IP-Adressen an (IP-Adressen der Gateways), von denen Portal Server Gateway-Zertifikatauthentifizierungsanforderungen akzeptiert werden. Das Attribut wird auf Bereichsebene konfiguriert.</p>
</td></tr></table>
<A NAME="fwbkd"></A><h4>SSL-Anschlussnummer</h4>
<p>Gibt die Anschlussnummer f&#252;r die Secure Socket Layer-Schicht (SSL) an. Zurzeit wird das Attribut nur vom Gateway-Servlet verwendet. Bevor Sie eine SSL-Anschlussnummer hinzuf&#252;gen oder &#228;ndern, sollten Sie den Abschnitt &#8220;Policy-Based Resource Management&#34; (Richtliniengest&#252;tzte Ressourcenverwaltung) im Access Manager Administration Guide lesen.</p>
<A NAME="gcabp"></A><h4>HTTP-Header-Name f&#252;r Clientzertifikat</h4>
<p>Dieses Attribut wird nur verwendet, wenn das Attribut &#8220;Vertrauensw&#252;rdige Remote-Hosts&#34; auf &#8220;Alle&#34; eingestellt ist bzw. f&#252;r dieses Attribut ein spezifischer Hostname definiert wurde. Der Administrator muss den HTTP-Header-Namen f&#252;r das Clientzertifikat angeben, das vom Load Balancer bzw. von SRA eingef&#252;gt wird. </p>
<A NAME="fwblx"></A><h4>Authentifizierungsebene</h4>
<p>Die Authentifizierungsebene wird f&#252;r jede Authentifizierungsmethode einzeln festgelegt. Mit diesem Wert wird angegeben, wie stark einem Authentifizierungsmechanismus vertraut wird. Sobald ein Benutzer authentifiziert wurde, wird der Wert im SSO-Token der aktuellen Sitzung gespeichert. Wird der SSO-Token einer Anwendung, auf die der Benutzer zugreifen m&#246;chte, vorgelegt, bestimmt die Anwendung anhand des gespeicherten Werts, ob die Ebene ausreicht, um den Benutzer Zugriff zu gew&#228;hren. Wenn die im SSO-Token gespeicherte Authentifizierungsebene nicht den erforderlichen Mindestwert aufweist, wird der Benutzer aufgefordert, sich erneut &#252;ber einen Dienst mit einer h&#246;heren Authentifizierungsebene zu authentifizieren. Der Standardwert ist 0.</p>
<p><hr size="1" noshade><p><b>Hinweis &#8211; </b>Wenn keine Authentifizierungsebene angegeben wird, wird im SSO-Token der im Kern-Authentifizierungsattribut <A HREF="service.scserviceprofile.iplanetamauthservice.html#fwbfn">Standard-Authentifizierungsebene</A> angegebene Wert verwendet.</p>
<hr size="1" noshade></p>
<br />

</body>
</html>
