<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Webdienste
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="webservices"></A><h1>Webdienste</h1>
<p>Beim Webdienste-Modul handelt es sich um die Access Manager-Implementierung der Liberty Alliance Project <b>Identity Web Services Framework</b>  (ID-WSF)-Spezifikationen. Die ID-WSF baut auf der <b>Liberty Identity Federation Framework (ID-FF)</b> auf und enth&#228;lt Spezifikationen zum Erstellen von Webdiensten f&#252;r das Abrufen, Aktualisieren bzw. Ausf&#252;hren von Vorg&#228;ngen f&#252;r Identit&#228;tsdaten in einer Netzwerkumgebung. Die Spezifikationen bieten einen &#220;berblick &#252;ber die technischen Komponenten, die zum Erstellen von Webdiensten notwendig sind, beispielsweise Kalenderdienste, Wallet-Dienste oder Alarmdienste.</p>
<p><hr size="1" noshade><p><b>Hinweis &#8211; </b><b>Identit&#228;tsdaten</b> enthalten Attribute zum Festlegen des Vor- und Nachnamens, der Anschrift, der Gesch&#228;ftsadresse und des Kontakts f&#252;r Notf&#228;lle. Es k&#246;nnen jedoch auch weitere Attribute enthalten sein.</p>
<hr size="1" noshade></p><p>Webdienste bilden die Grundlage f&#252;r verteilte Netzwerke im Internet. Ein Webdienstbenutzer (Web Service Consumer, WSC) sucht nach einem Webdienst und ruft die vom Webdienst bereitgestellten Prozesse durch das Senden einer Anfrage auf. Bei einem Webdienstanbieter (Web Service Provider, WSP) handelt es sich um die Anwendung, die den Webdienst basierend auf der Anforderung implementiert; er kann sich auf derselben Java&#8482; Virtual Machine wie der WSC befinden oder Tausende Kilomenter entfernt sein. Wenn ein WSC Identit&#228;tsattribute von einem WSP abruft, kontaktiert der WSC zun&#228;chst einen Discovery-Dienst, um den Speicherort der ben&#246;tigten Attribute zu ermitteln. Sobald diese Informationen zur&#252;ckgegeben wurden, kontaktiert der WSC den WSP (beispielsweise ein pers&#246;nlicher Profildienst), um die ben&#246;tigten Attribute abzurufen.</p>
<p>Das Modul &#8220;Webdienste&#34; der Access Manager-Konsole ist eine Schnittstelle zum Konfigurieren folgender Dienste:</p>
<ul><li><p><A HREF="webservices.wspersonalprofileservice.html#webservices.wspersonalprofileservice">Pers&#246;nlicher Liberty-Profildienst</A></p>
</li>
<li><p><A HREF="service.smdiscoveryservice.html#service.smdiscoveryservice">Discovery-Dienst</A></p>
</li>
<li><p><A HREF="service.scsoapbinding.html#service.scsoapbinding">SOAP Binding-Dienst</A></p>
</li>
<li><p><A HREF="webservices.wsauthnservices.html#webservices.wsauthnservices">Authentifizierungs-Webdienst</A></p>
</li>
</ul>

<br />

</body>
</html>
