<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Attributs du client de service Web - Aide en ligne de la console Sun Java System Federated Access Manager 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="agentconfig.webserviceclientedit"></a><h4>Attributs du client de service Web</h4>
<p>Le profil d'agent du client du service Web d&#233;crit la configuration utilis&#233;e
pour s&#233;curiser les demandes de service Web sortantes d'un client de service
Web. Les noms des services Web doivent &#234;tre uniques &#224; chaque client
de service Web.</p>

<a name="gglmr"></a><h5>D'ordre g&#233;n&#233;ral</h5>
<p>Les attributs d'ordre g&#233;n&#233;ral suivants d&#233;finissent les propri&#233;t&#233;s du client de service
Web de base&#160;:</p>

<a name="ggoue"></a><h5>Groupe</h5>
<p>Le m&#233;canisme de groupe permet de d&#233;finir un ensemble de types d'agents
similaires. Vous devez d&#233;finir le groupe avant d'inclure l'agent sp&#233;cifique dans un
ensemble. </p>

<a name="ggowm"></a><h5>Mot de passe</h5>
<p>D&#233;finit le mot de passe de l'attribut du client du service Web.</p>

<a name="ggoti"></a><h5>Confirmation de mot de passe</h5>
<p>Confirmez le mot de passe.</p>

<a name="ggllf"></a><h5>Statut</h5>
<p>D&#233;termine si l'agent du client du service Web participe ou non &#224;
la s&#233;curisation des demandes de service sortantes. Par d&#233;faut, cet attribut est
d&#233;fini sur <tt>Active</tt>, ce qui signifie que l'agent participe &#224; la s&#233;curisation.
</p>

<a name="gglje"></a><h5>Identificateur universel</h5>
<p>R&#233;pertorie les propri&#233;t&#233;s LDAP de base qui d&#233;finissent de mani&#232;re unique l'agent
du client du service Web.</p>

<a name="gglnb"></a><h5>S&#233;curit&#233;</h5>
<p>Les attributs suivants d&#233;finissent les attributs de s&#233;curit&#233; du client du service
Web&#160;:</p>

<a name="ggliy"></a><h5>M&#233;canisme de s&#233;curit&#233;</h5>
<p>D&#233;finit le type de r&#233;f&#233;rence de s&#233;curit&#233; utilis&#233; pour s&#233;curiser la demande
du client du service Web. Vous pouvez effectuer un choix parmi les
types de s&#233;curit&#233; suivants&#160;:</p>
<ul><li><p>Anonyme &#8212; Le m&#233;canisme de s&#233;curit&#233; anonyme ne contient aucune r&#233;f&#233;rence de s&#233;curit&#233;.</p></li>
<li><p>LibertyDiscoverySecurity &#8212; Utilise les jetons de s&#233;curit&#233; Liberty pour s&#233;curiser la demande.</p></li>
<li><p>SAML-HolderOfKey &#8212; Utilise le type d'assertion SAML 1.1 Holder-Of-Key pour s&#233;curiser la demande.</p></li>
<li><p>SAML-SenderVouches &#8212; Utilise le type d'assertion SAML 1.1 Sender Vouches pour s&#233;curiser la demande.</p></li>
<li><p>SAML2&#8211;HolderOfKey &#8212; Utilise le type de jeton d'assertion SAML 2.0 Holder-Of-Key pour s&#233;curiser la demande.</p></li>
<li><p>SAML2&#8211;SenderVouches &#8212; Utilise le type de jeton d'assertion SAML 2.0 Sender Vouches pour s&#233;curiser la demande.</p></li>
<li><p>STSSecurity &#8212; Sp&#233;cifie que le client du service Web obtient le jeton de s&#233;curit&#233; aupr&#232;s du service de jeton de s&#233;curit&#233;.</p></li>
<li><p>UserNameToken &#8212; Utilise un jeton de nom d'utilisateur pour s&#233;curiser les demandes du client du service Web.</p></li>
<li><p>UserNameToken-Plain &#8212; Utilise un jeton de nom d'utilisateur avec un mot de passe en texte clair pour s&#233;curiser les demandes du service Web.</p></li>
<li><p>X509Token &#8212; Utilise le certificat X509 pour s&#233;curiser les demandes du service Web.</p></li></ul>


<a name="gglmn"></a><h5>Configuration STS</h5>
<p>Cet attribut est activ&#233; lorsque le client du service Web utilise le
service de jeton de s&#233;curit&#233; (STS, Security Token Service). Cette configuration d&#233;crit
une liste de profils d'agent STS utilis&#233;s pour s&#233;curiser les demandes au
service STS.</p>

<a name="ggljq"></a><h5>Configuration de la d&#233;tection</h5>
<p>Cet attribut est activ&#233; lorsque le client du service Web est activ&#233;
pour la s&#233;curit&#233; du service de d&#233;couverte. Cette configuration d&#233;crit une liste
de profils d'agent de d&#233;couverte utilis&#233;s pour s&#233;curiser les demandes au service
de d&#233;couverte.</p>

<a name="ggljr"></a><h5>Authentification utilisateur requise</h5>
<p>Lorsque cet attribut est activ&#233;, il sp&#233;cifie que la page prot&#233;g&#233;e du
client des services n&#233;cessite que l'utilisateur soit authentifi&#233; pour obtenir l'acc&#232;s.</p>

<a name="gglmd"></a><h5>Pr&#233;server les en-t&#234;tes de s&#233;curit&#233; dans les messages</h5>
<p>Lorsque cet attribut est activ&#233;, il indique que les en-t&#234;tes de s&#233;curit&#233;
SOAP sont conserv&#233;s pour le client du service Web en vue d'un
traitement approfondi.</p>

<a name="ggllx"></a><h5>URN de type de service Liberty</h5>
<p>L'URN (Universal Resource Name) d&#233;crit un type de service Liberty que le
client du service Web utilise pour les recherches de services.</p>

<a name="gglji"></a><h5>R&#233;f&#233;rences du jeton d'utilisateur</h5>
<p>L'attribut repr&#233;sente les secrets partag&#233;s nom d'utilisateur/mot de passe que le client
du service Web utilise pour g&#233;n&#233;rer un jeton de s&#233;curit&#233; de nom
d'utilisateur.</p>

<a name="ggliu"></a><h5>Signature et chiffrement</h5>
<p>Les attributs suivants d&#233;finissent la configuration de signature et de chiffrement pour
la s&#233;curit&#233; du service Web&#160;:</p>

<a name="gglna"></a><h5>La demande est sign&#233;e</h5>
<p>Lorsque cet attribut est activ&#233;, le client du service Web signe la
demande avec un type de jeton donn&#233;.</p>

<a name="ggllb"></a><h5>L'en-t&#234;te de demande est chiffr&#233;</h5>
<p>Lorsque cet attribut est activ&#233;, l'en-t&#234;te de s&#233;curit&#233; du client du service
Web est chiffr&#233;.</p>

<a name="gglnh"></a><h5>La demande est chiffr&#233;e</h5>
<p>Lorsque cet attribut est activ&#233;, la demande du client du service Web
est activ&#233;e.</p>

<a name="ggljs"></a><h5>La signature de r&#233;ponse est v&#233;rifi&#233;e</h5>
<p>Lorsque cet attribut est activ&#233;, la signature de r&#233;ponse du service Web
est v&#233;rifi&#233;e.</p>

<a name="gglks"></a><h5>La r&#233;ponse est d&#233;chiffr&#233;e</h5>
<p>Lorsque cet attribut est activ&#233;, la r&#233;ponse du service Web est d&#233;chiffr&#233;e.</p>

<a name="ggllsa"></a><h5>Keystore</h5>
<p>Les attributs suivants configurent le keystore &#224; utiliser pour le stockage et
l'extraction du certificat&#160;: </p>

<a name="ggllda"></a><h5>Alias de cl&#233; publique du fournisseur de services Web</h5>
<p>Cet attribut d&#233;finit l'alias de cl&#233; de certificat publique utilis&#233; pour chiffrer
la demande du service Web.</p>

<a name="gglmca"></a><h5>Alias de cl&#233; priv&#233;e</h5>
<p>Cet attribut d&#233;finit l'alias de cl&#233; de certificat priv&#233;e utilis&#233; pour signer/d&#233;chiffrer
la r&#233;ponse du service Web.</p>

<a name="ggljfa"></a><h5>Utilisation du keystore</h5>
<p>Cette configuration sp&#233;cifie d'utiliser le keystore par d&#233;faut ou un keystore personnalis&#233;.
Les valeurs suivantes doivent &#234;tre d&#233;finies pour un keystore personnalis&#233;&#160;:</p>
<ul><li><p>Emplacement du keystore</p></li>
<li><p>Mot de passe du keystore</p></li>
<li><p>Mot de passe de cl&#233;</p></li></ul>


<a name="endpoint"></a><h5>Points d'arriv&#233;e</h5>
<p>Les attributs suivants d&#233;finissent les points d'arriv&#233;e du service Web&#160;:</p>

<a name="gglmpa"></a><h5>Point d'arriv&#233;e de service Web</h5>
<p>Cet attribut d&#233;finit un point d'arriv&#233;e de service Web auquel le client
du service Web fait une demande.</p>
<br/>

</body>
</html>
