<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Modification d'un profil de domaine d'authentification
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="federation.fsauthdomainsedit"></A><h3>Modification d'un profil de domaine d'authentification</h3>
<A NAME="indexterm-60"></A><p>Suivez cette proc&#233;dure pour modifier les attributs globaux d'un domaine d'authentification existant ou pour lui ajouter des fournisseurs. Le point de d&#233;part est Domaines d'authentification sous l'interface F&#233;d&#233;ration.</p>
<ol><li><p><b>Cliquez sur le nom d'un domaine d'authentification configur&#233; afin de modifier son profil ou de lui ajouter des fournisseurs.</b></p><p>La page &#201;diter le domaine d'authentification s'affiche.</p>
</li>
<li><p><b>Tapez les nouvelles valeurs ou modifiez celles pr&#233;sentes dans les attributs g&#233;n&#233;raux du domaine d'authentification :</b></p><table border="0" cellspacing="5"><tr><td valign="top"><p>Nom</p></td><td valign="top"><p>La valeur statique de cet attribut est le nom fourni lors de la cr&#233;ation du domaine d'authentification.</p>
</td></tr><tr><td valign="top"><p>Description</p></td><td valign="top"><p>Cet attribut est une description du domaine d'authentification. Si n&#233;cessaire, vous pouvez modifier la description d&#233;j&#224; saisie.</p>
</td></tr><tr><td valign="top"><p>URL du service &#233;criture</p></td><td valign="top"><p>Cet attribut indique l'emplacement du service qui &#233;crit le cookie du domaine commun. L'URL a le format <tt><b> http://</tt><i>common-domain-host<tt></i>:</tt><i>port<tt></i>/common/writer </b></tt>.</p>
</td></tr><tr><td valign="top"><p>URL du service lecture</p></td><td valign="top"><p>Cet attribut indique l'emplacement du service qui lit le cookie du domaine commun. L'URL a le format <tt><b> http://</tt><i>common-domain-host<tt></i>:</tt><i>port<tt></i>/common/transfer </b></tt> .</p>
</td></tr><tr><td valign="top"><p>&#201;tat</p></td><td valign="top"><p>Le statut par d&#233;faut est Actif. La s&#233;lection de Inactif d&#233;sactive les communications au sein du domaine d'authentification.</p>
</td></tr></table>
</li>
<li><p><b>Cliquez sur Ajouter pour ajouter des fournisseurs au domaine d'authentification.</b></p><p>La page de s&#233;lection d'un partenaire de confiance s'affiche.</p>
</li>
<li><p><b>Choisissez un ou plusieurs fournisseurs disponibles et cliquez sur la fl&#232;che Ajouter pour les s&#233;lectionner.</b></p><p>La liste fournie contient les noms des entit&#233;s cr&#233;&#233;es et renseign&#233;es avec des fournisseurs. Pour plus d'informations, voir <A HREF="federation.fsauthdomainsselectprovider.html#federation.fsauthdomainsselectprovider">Ajout de fournisseurs &#224; un domaine d'authentification</A>.</p>
</li>
<li><p><b>Cliquez sur OK pour enregistrer les fournisseurs du domaine d'authentification.</b></p><p>Vous revenez &#224; l'&#233;cran Profil du domaine d'authentification.</p>
</li>
<li><p><b>Cliquez sur Enregistrer pour terminer l'op&#233;ration.</b></p></li>
</ol>
<br />

</body>
</html>
