<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Modification du profil d'un contact dans une entit&#233; fournisseur
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="federation.fseditcontactperson"></A><h3>Modification du profil d'un contact dans une entit&#233; fournisseur</h3>
<A NAME="indexterm-83"></A><p>Les informations relatives &#224; un contact (individu) pour un fournisseur de services ou d'identit&#233;s particulier peuvent &#234;tre ajout&#233;es au profil du fournisseur dans une entit&#233; fournisseur. Le point de d&#233;part est l'&#233;cran Entit&#233;s sous F&#233;d&#233;ration.</p>
<ol><li><p><b>Cliquez sur le nom d'une entit&#233; configur&#233;e pour modifier son profil.</b></p></li>
<li><p><b>S&#233;lectionnez Fournisseur d'identit&#233;s ou Fournisseur de services dans le menu Affichage.</b></p></li>
<li><p><b>Cliquez sur le nom d'un contact configur&#233; pour modifier son profil.</b></p></li>
<li><p><b>Fournissez les valeurs nouvelles ou modifi&#233;es du profil du contact.</b></p><table border="0" cellspacing="5"><tr><td valign="top"><p>Pr&#233;nom</p></td><td valign="top"><p>Tapez le nom de bapt&#234;me du contact de l'entit&#233;.</p>
</td></tr><tr><td valign="top"><p>Nom</p></td><td valign="top"><p>Tapez le nom de famille du contact de l'entit&#233;.</p>
</td></tr><tr><td valign="top"><p>Type</p></td><td valign="top"><p>Choisissez le type du contact dans le menu d&#233;roulant :</p>
<ul><li><p>Administration</p>
</li>
<li><p>Facturation</p>
</li>
<li><p>Technique</p>
</li>
<li><p>Autre</p>
</li>
</ul>
</td></tr><tr><td valign="top"><p>Soci&#233;t&#233;</p></td><td valign="top"><p>Tapez le nom de la soci&#233;t&#233; qui emploie cette personne.</p>
</td></tr><tr><td valign="top"><p>ID principal Liberty</p></td><td valign="top"><p>Tapez un URI qui pointe sur une instance en ligne du profil d'informations personnelles du contact.</p>
</td></tr><tr><td valign="top"><p>Adresses e-mail</p></td><td valign="top"><p>Tapez une ou plusieurs adresses e-mail pour le contact, puis cliquez sur Ajouter.</p>
</td></tr><tr><td valign="top"><p>Num&#233;ros de t&#233;l&#233;phone</p></td><td valign="top"><p>Tapez un ou plusieurs num&#233;ros de t&#233;l&#233;phone pour le contact, puis cliquez sur Ajouter.</p>
</td></tr></table>
</li>
<li><p><b>Cliquez sur Enregistrer pour terminer la configuration du contact.</b></p></li>
<li><p><b>Cliquez sur Enregistrer dans la page Profil de l'entit&#233; pour terminer la configuration de l'entit&#233;.</b></p></li>
</ol>
<br />

</body>
</html>
