<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Cr&#233;ation d'un cercle d'approbation - Aide en ligne de la console Sun Java System Federated Access Manager 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &copy; 2008 by Sun Microsystems, Inc. All Rights Reserved." />

</head>

<body class="HlpBdy">



<a name="federation.createcot"></a><h4>Cr&#233;ation d'un cercle d'approbation</h4><a name="indexterm-58"></a><p>Proc&#233;dez comme suit pour cr&#233;er un cercle d'approbation. Le point de d&#233;part
est Nouveau cercle d'approbation sous l'interface F&#233;d&#233;ration.</p><ol>
<li><b>Cliquez sur Nouveau pour afficher le cercle d'attributs d'approbation.</b><p>La page Nouveau cercle de profil d'approbation s'affiche.</p></li>
<li><b>Entrez le nom du cercle d'approbation.</b></li>
<li><b>Entrez la description du cercle d'approbation dans le champ Description.</b></li>
<li><b>Tapez la valeur de l'URL du service &#233;criture IDFF.</b><p>L'URL du service &#233;criture IDFF indique l'emplacement du servlet qui &#233;crit le
cookie du domaine commun. Utilisez le format <tt>http://</tt><i> h&#244;te-domaine-commun</i><tt> :</tt><i>port</i><tt>/common/writer </tt>.</p></li>
<li><b>Tapez la valeur de l'URL du service lecture IDFF.</b><p>L'URL du service lecture IDFF indique l'emplacement du servlet qui lit le
cookie du domaine commun. Utilisez le format <tt>http://</tt><i> h&#244;te-domaine-commun</i><tt> :</tt><i>port</i><tt>/common/transfer </tt>..</p></li>
<li><b>Tapez la valeur de l'URL du service &#233;criture SAML2.</b><p>Ceci indique l'emplacement du service &#233;criture SAML2 qui &#233;crit le cookie dans
le domaine commun.</p></li>
<li><b>Tapez la valeur de l'URL du service lecture SAML2.</b><p>Ceci indique l'emplacement du service lecture SAML2 qui lit le cookie dans
le domaine commun.</p></li>
<li><b>Choisissez Actif ou Inactif.</b><p>Le statut par d&#233;faut est Actif. Le choix de Inactif d&#233;sactive les
communications au sein du domaine d'authentification.</p></li>
<li><b>S&#233;lectionnez le domaine dans lequel le cercle d'approbation sera cr&#233;&#233;. </b></li>
<li><b>Choisissez un ou plusieurs fournisseurs disponibles et cliquez sur la fl&#232;che Ajouter
pour les s&#233;lectionner.</b><p>La liste fournie contient les noms des entit&#233;s cr&#233;&#233;es et renseign&#233;es avec
des fournisseurs. Pour plus d'informations, voir <a href="federation.fsauthdomainsselectprovider.html">Ajouts de fournisseurs &#224; un cercle d'approbation</a></p></li>
<li><b>Cliquez sur OK pour terminer la configuration.</b><p>Le nouveau cercle d'approbation s'affiche dans la liste Cercle d'approbation.</p></li></ol>
<br/>

</body>
</html>
