<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Entit&#233;s : fournisseur et filiale
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="federation.fsentitydescriptors"></A><h2>Entit&#233;s : fournisseur et filiale</h2>
<A NAME="indexterm-63"></A><A NAME="indexterm-64"></A><A NAME="indexterm-65"></A><A NAME="indexterm-66"></A><p>Une <b>entit&#233;</b> peut &#234;tre configur&#233;e avec des <b>m&#233;tadonn&#233;es</b> (informations de configuration d&#233;finissant une architecture de service d'identit&#233; particuli&#232;re) d'un fournisseur d'identit&#233;s, d'un fournisseur de services ou des deux. Au contraire, une entit&#233; peut &#234;tre configur&#233;e comme une affiliation ou un groupe s&#233;lectionn&#233; de fournisseurs de chaque type. Les entit&#233;s fournisseur et d'affiliation (filiale) peuvent &#234;tre toutes les deux configur&#233;es &#224; l'aide de la console Access Manager. </p>
<p><hr size="1" noshade><p><b>Remarque &#8211; </b>Une entit&#233; peut &#234;tre cr&#233;&#233;e mais ne pourra pas &#234;tre assign&#233;e &#224; un domaine d'authentification tant qu'elle n'a pas &#233;t&#233; renseign&#233;e avec des fournisseurs.</p>
<hr size="1" noshade></p><p>Les deux types d'entit&#233; sont d&#233;crits dans le tableau suivant.</p>
<A NAME="gbxxa"></A><p><b>Tableau 1 </b>Types d'entit&#233;s</p>

<table cellspacing="5" border="1">
<tr><td><p><b>Entit&#233; fournisseur</b></p></td><td><p>Une <b>entit&#233; fournisseur</b> contient les m&#233;tadonn&#233;es de fournisseurs individuels de n'importe quel type. Tous les fournisseurs d'identit&#233;s et de services doivent &#234;tre configur&#233;s dans une entit&#233; fournisseur avant de pouvoir &#234;tre associ&#233;s &#224; un domaine d'authentification ou choisis pour &#234;tre inclus dans une <b>entit&#233; filiale</b>. Avec les attributs fournis dans la Console Access Manager, un fournisseur d'identit&#233;s individuel, un fournisseur de services individuel ou les deux peuvent &#234;tre d&#233;fini dans une entit&#233; fournisseur. Un profil d'entit&#233; fournisseur contient les groupes d'attributs suivants :</p><ul><li><p><A HREF="federation.fsentitydescriptorsprofile.html#federation.fsentitydescriptorsprofile">Attributs g&#233;n&#233;raux</A></p></li>
<li><p><A HREF="federation.fsidentityprovider.html#federation.fsidentityprovider">Fournisseur d'identit&#233;s</A></p></li>
<li><p><A HREF="federation.fsserviceprovider.html#federation.fsserviceprovider">Fournisseur de services</A></p></li>
</ul>
</td></tr>
<tr><td><p><b>Entit&#233; filiale</b></p></td><td><p>Avec une <b>affiliation</b> configur&#233;e, un utilisateur peut f&#233;d&#233;rer un groupe de sites associ&#233;s. Par exemple, quand un fournisseur de services &#233;met une demande d'authentification s&#233;curis&#233;e pour un utilisateur de la part d'une affiliation, l'utilisateur peut b&#233;n&#233;ficier d'une connexion unique avec tous les membres de l'affiliation. Une affiliation est b&#226;tie sans tenir compte des limites d'un domaine d'authentification.</p><p>Une <b>entit&#233; filiale</b> contient les m&#233;tadonn&#233;es qui d&#233;finissent le regroupement d'une ou plusieurs entit&#233;s fournisseur composant l'affiliation. Elle ne contient que les informations de configuration de l'affiliation elle-m&#234;me, et aucune information de configuration sur les fournisseurs. Un profil d'entit&#233; filiale contient les groupes d'attributs suivants :</p><ul><li><p><A HREF="federation.fsentitydescriptorsprofile.html#federation.fsentitydescriptorsprofile">Attributs g&#233;n&#233;raux</A></p></li>
<li><p><A HREF="federation.fsentitydescriptorsaffiliate.html#federation.fsentitydescriptorsaffiliate">Filiale</A></p></li>
</ul>
<p><hr size="1" noshade><p><b>Remarque &#8211; </b>Les membres d'une affiliation peuvent appeler des services soit individuellement, soit de n'importe quel membre de l'affiliation.</p><hr size="1" noshade></p></td></tr>
</table><p>Toutes les entit&#233;s configur&#233;es des deux types sont r&#233;pertori&#233;es sous Entit&#233;s. Les t&#226;ches suivantes sont associ&#233;es aux entit&#233;s :</p>
<ul><li><p><A HREF="federation.fsentitydescriptorsadd.html#federation.fsentitydescriptorsadd">Cr&#233;ation d'une entit&#233; fournisseur ou d'une entit&#233; filiale</A></p>
</li>
<li><p><A HREF="federation.fsentitydescriptorsprofile.html#federation.fsentitydescriptorsprofile">Modification des attributs g&#233;n&#233;raux d'une entit&#233; fournisseur ou d'une entit&#233; filiale</A></p>
</li>
<li><p><A HREF="federation.fsidentityprovider.html#federation.fsidentityprovider">Ajout d'un fournisseur d'identit&#233;s &#224; une entit&#233; fournisseur</A></p>
</li>
<li><p><A HREF="federation.fsidentityproviderhostedadd.html#federation.fsidentityproviderhostedadd">Ajout d'un nouveau fournisseur d'identit&#233;s h&#233;berg&#233; &#224; une entit&#233; fournisseur</A></p>
</li>
<li><p><A HREF="federation.fsidentityproviderremoteadd.html#federation.fsidentityproviderremoteadd">Ajout d'un nouveau fournisseur d'identit&#233;s distant &#224; une entit&#233; fournisseur</A></p>
</li>
<li><p><A HREF="federation.fsserviceprovider.html#federation.fsserviceprovider">Ajout d'un fournisseur de services &#224; une entit&#233; fournisseur</A></p>
</li>
<li><p><A HREF="federation.fsserviceproviderhostedadd.html#federation.fsserviceproviderhostedadd">Ajout d'un nouveau fournisseur de services h&#233;berg&#233; &#224; une entit&#233; fournisseur</A></p>
</li>
<li><p><A HREF="federation.fsserviceproviderremoteadd.html#federation.fsserviceproviderremoteadd">Ajout d'un nouveau fournisseur de services distant &#224; une entit&#233; fournisseur</A></p>
</li>
<li><p><A HREF="federation.fsidentityproviderhostedprofile.html#federation.fsidentityproviderhostedprofile">Modification des attributs d'un fournisseur d'identit&#233;s h&#233;berg&#233; dans une entit&#233; fournisseur</A></p>
</li>
<li><p><A HREF="federation.fsidentityproviderremoteprofile.html#federation.fsidentityproviderremoteprofile">Modification des attributs d'un fournisseur d'identit&#233;s distant dans une entit&#233; fournisseur</A></p>
</li>
<li><p><A HREF="federation.fsserviceproviderhostedprofile.html#federation.fsserviceproviderhostedprofile">Modification des attributs d'un fournisseur de services h&#233;berg&#233; dans une entit&#233; fournisseur</A></p>
</li>
<li><p><A HREF="federation.fsserviceproviderremoteprofile.html#federation.fsserviceproviderremoteprofile">Modification des attributs d'un fournisseur de services distant dans une entit&#233; fournisseur</A></p>
</li>
<li><p><A HREF="federation.fscreatecontactperson.html#federation.fscreatecontactperson">Ajout d'un contact &#224; un fournisseur dans une entit&#233; fournisseur</A></p>
</li>
<li><p><A HREF="federation.fseditcontactperson.html#federation.fseditcontactperson">Modification du profil d'un contact dans une entit&#233; fournisseur</A></p>
</li>
<li><p><A HREF="federation.fsentitydescriptorsaffiliate.html#federation.fsentitydescriptorsaffiliate">Ajout de membres &#224; une entit&#233; filiale</A></p>
</li>
</ul>

<br />

</body>
</html>
