<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Types de magasins de donn&#233;es Access Manager
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="idrepoadd"></A><h3>Types de magasins de donn&#233;es Access Manager</h3>
<p>Dans l'&#233;cran de s&#233;lection de magasin de donn&#233;es Access Manager, vous pouvez cr&#233;er les types de magasins de donn&#233;es suivants :</p>
<A NAME="gdlnj"></A><h4>Plug-in du r&#233;f&#233;rentiel d'Access Manager</h4>
<p>Ce type de magasin de donn&#233;es se trouve dans une instance Sun Java System Directory Server et contient l'arborescence d'informations Access Manager. Il utilise les fonctions Directory Server ne faisant pas partie de la sp&#233;cification LDAP version 3, comme les r&#244;les et la classe de service, et est compatible avec les versions ant&#233;rieures d'Access Manager.</p>
<p>Pour des d&#233;finitions d'attributs, reportez-vous &#224; <A HREF="amrepoattrs.html#amrepoattrs">Attributs du r&#233;f&#233;rentiel d'Access Manager</A>.</p>
<A NAME="gdlmv"></A><h4>Active Directory</h4>
<p>Ce type de magasin de donn&#233;es utilise la sp&#233;cification LDAP version 3 pour &#233;crire des donn&#233;es d'identit&#233; dans une instance de Microsoft Active Directory.</p>
<p>Pour des d&#233;finitions d'attributs, reportez-vous &#224; <A HREF="adattrs.html#adattrs">Attributs Active Directory</A>.</p>
<A NAME="gdlml"></A><h4>R&#233;f&#233;rentiel fichiers plats</h4>
<p>Ce r&#233;f&#233;rentiel vous permet de stocker des donn&#233;es et des identit&#233;s dans une structure DIT simple sur l'instance d'installation locale d'Access Manager sans cr&#233;er de magasin de donn&#233;es distinct. Il est g&#233;n&#233;ralement utilis&#233; pour tester ou approuver des d&#233;ploiements types.</p>
<p>Pour des d&#233;finitions d'attributs, reportez-vous &#224; <A HREF="flatfileattr.html#flatfileattr">Attributs du r&#233;f&#233;rentiel fichiers plats</A>.</p>
<A NAME="gdlmr"></A><h4>LDAPv3 g&#233;n&#233;rique</h4>
<p>Ce type de magasin de donn&#233;es vous permet d'&#233;crire des donn&#233;es d'identit&#233; dans une quelconque base de donn&#233;es compatible LDAPv3. Si la base de donn&#233;es LDAPv3 utilis&#233;e ne prend pas en charge la recherche persistante, vous ne pourrez pas utiliser la fonction de mise en cache.</p>
<p>Pour des d&#233;finitions d'attributs, reportez-vous &#224; <A HREF="gdoto.html#gdoto">Attributs LDAPv3 g&#233;n&#233;rique</A>.</p>
<A NAME="gdlnw"></A><h4>Sun Directory Server avec Access Manager Schema</h4>
<p>Ce type de magasin de donn&#233;es se trouve dans une instance Sun Java System Directory Server et contient l'arborescence d'informations Access Manager. Il est diff&#233;rent du plug-in du r&#233;f&#233;rentiel d'Access Manager en ce qu'un plus grand nombre d'attributs de configuration vous permet de mieux personnaliser le magasin de donn&#233;es.</p>
<p>Pour des d&#233;finitions d'attributs, reportez-vous &#224; <A HREF="sundirattrs.html#sundirattrs">Attributs Sun Directory Server avec Access Manager Schema</A>.</p>

<br />

</body>
</html>
