<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>
<head>

  <meta http-equiv="Content-type" content="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Types de magasins de donn&#233;es Federated Access Manager - Aide en ligne de la console Sun Java System Federated Access Manager 8.0
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>
  <meta name="Copyright" content="Copyright &#169; 2008 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">



<a name="idrepoadd"></a><h4>Types de magasins de donn&#233;es Federated Access Manager</h4>
<p>Dans l'&#233;cran de s&#233;lection de magasin de donn&#233;es Federated Access Manager, vous
pouvez cr&#233;er les types de magasins de donn&#233;es suivants :</p>

<a name="gdlnj"></a><h5>Plug-in de r&#233;f&#233;rentiel Federated Access Manager</h5>
<p>Ce type de magasin de donn&#233;es se trouve dans une instance Sun
Java System Directory Server et contient l'arborescence d'informations Federated Access Manager. Il
utilise les fonctions Directory Server ne faisant pas partie de la sp&#233;cification
LDAP version 3, comme les r&#244;les et la classe de service, et
est compatible avec les versions ant&#233;rieures de Federated Access Manager.</p><p>Pour des d&#233;finitions d'attributs, reportez-vous &#224; <a href="amrepoattrs.html">Attributs de r&#233;f&#233;rentiel Federated Access Manager</a>.</p>

<a name="gdlmv"></a><h5>Active Directory</h5>
<p>Ce type de magasin de donn&#233;es utilise la sp&#233;cification LDAP version 3
pour &#233;crire des donn&#233;es d'identit&#233; dans une instance de Microsoft Active Directory.</p><p>Pour des d&#233;finitions d'attributs, reportez-vous &#224; <a href="adattrs.html">Attributs Active Directory</a>.</p>

<a name="gdlml"></a><h5>R&#233;f&#233;rentiel fichiers plats</h5>
<p>Ce r&#233;f&#233;rentiel vous permet de stocker des donn&#233;es et des identit&#233;s dans
une structure DIT simple sur l'instance d'installation locale de Federated Access Manager
sans cr&#233;er de magasin de donn&#233;es distinct. Il est g&#233;n&#233;ralement utilis&#233; pour
tester ou approuver des d&#233;ploiements types.</p><p>Pour des d&#233;finitions d'attributs, reportez-vous &#224; <a href="flatfileattr.html">Attributs du r&#233;f&#233;rentiel fichiers plats</a>.</p>

<a name="gdlmr"></a><h5>LDAPv3 g&#233;n&#233;rique</h5>
<p>Ce type de magasin de donn&#233;es vous permet d'&#233;crire des donn&#233;es d'identit&#233;
dans une quelconque base de donn&#233;es compatible LDAPv3. Si la base de
donn&#233;es LDAPv3 utilis&#233;e ne prend pas en charge la recherche persistante, vous
ne pourrez pas utiliser la fonction de mise en cache.</p><p>Pour des d&#233;finitions d'attributs, reportez-vous &#224; <a href="gdoto.html">Attributs LDAPv3 g&#233;n&#233;rique</a>.</p>

<a name="gdlnw"></a><h5>Sun Directory Server avec Federated Access Manager Schema</h5>
<p>Ce type de magasin de donn&#233;es se trouve dans une instance Sun
Java System Directory Server et contient l'arborescence d'informations Federated Access Manager. Il
est diff&#233;rent du plug-in du r&#233;f&#233;rentiel de Federated Access Manager en ce
qu'un plus grand nombre d'attributs de configuration vous permet de mieux personnaliser
le magasin de donn&#233;es.</p><p>Pour des d&#233;finitions d'attributs, reportez-vous &#224; <a href="sundirattrs.html">Attributs Sun Directory Server avec Federated Access Manager Schema</a>. </p>
<br/>

</body>
</html>
