<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Magasin de donn&#233;es
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="service.scserviceprofile.sunamauthdatastoreservice"></A><h3>Magasin de donn&#233;es</h3>
<p><A NAME="indexterm-179"></A>Le module d'authentification Magasin de donn&#233;es autorise une connexion &#224; l'aide du r&#233;f&#233;rentiel d'identit&#233;s du domaine pour authentifier les utilisateurs. L'utilisation du module Magasin de donn&#233;es &#233;vite de cr&#233;er un module de plug-in d'authentification, de le charger, puis de configurer le module d'authentification si vous devez vous authentifier dans le m&#234;me r&#233;f&#233;rentiel de magasin de donn&#233;es. De plus, il n'est pas n&#233;cessaire de cr&#233;er un module d'authentification personnalis&#233; dans lequel l'authentification par fichier plat est requise pour le r&#233;f&#233;rentiel correspondant dans ce domaine.</p>
<A NAME="funad"></A><h4>Niveau d'authentification</h4>
<p>Le niveau d'authentification est d&#233;fini s&#233;par&#233;ment pour chaque m&#233;thode d'authentification. La valeur indique le niveau de confiance associ&#233; &#224; un m&#233;canisme d'authentification. Une fois qu'un utilisateur s'est authentifi&#233;, cette valeur est stock&#233;e dans le jeton SSO pour la session. Lorsque le jeton SSO est pr&#233;sent&#233; &#224; une application &#224; laquelle l'utilisateur souhaite acc&#233;der, l'application utilise la valeur stock&#233;e pour d&#233;terminer si le niveau est suffisant pour accorder l'acc&#232;s &#224; l'utilisateur. Si le niveau d'authentification enregistr&#233; dans le jeton SSO ne correspond pas &#224; la valeur minimale requise, l'application peut inviter l'utilisateur &#224; s'authentifier &#224; nouveau par l'interm&#233;diaire d'un service avec un niveau d'authentification plus &#233;lev&#233;. La valeur par d&#233;faut est 0.</p>
<p><hr size="1" noshade><p><b>Remarque &#8211; </b>Si aucun niveau d'authentification n'est pr&#233;cis&#233;, le jeton SSO stocke la valeur sp&#233;cifi&#233;e dans l'attribut d'authentification Noyau <A HREF="service.scserviceprofile.iplanetamauthservice.html#fwbfn">Niveau d'authentification par d&#233;faut</A>.</p>
<hr size="1" noshade></p>
<br />

</body>
</html>
