<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>R&#233;initialisation du mot de passe
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="service.scserviceprofile.iplanetampasswordresetservice"></A><h3>R&#233;initialisation du mot de passe</h3>
<p><A NAME="indexterm-197"></A>Access Manager fournit un service de r&#233;initialisation du mot de passe qui permet aux utilisateurs de recevoir un message &#233;lectronique contenant un nouveau mot de passe ou de r&#233;initialiser le mot de passe d'un service ou d'une application prot&#233;g&#233; par Access Manager. Les attributs de r&#233;initialisation du mot de passe sont des attributs de domaine. Ces attributs sont les suivants :</p>
<ul><li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwe">Validation de l'utilisateur</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwd">Question secr&#232;te</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwh">Filtre de recherche</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwi">DN de base</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwj">DN de liaison</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwl">Mot de passe de la liaison</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwk">Option de r&#233;initialisation du mot de passe</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwq">Option de notification de changement du mot de passe</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwp">R&#233;initialisation du mot de passe</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwm">Question personnelle</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwo">Nombre max. de questions</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwn">Forcer le changement de mot de passe &#224; la connexion suivante</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwr">Verrouillage d'&#233;chec de r&#233;initialisation de mot de passe</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuxh">Nombre de verrouillages d'&#233;chec de r&#233;initialisation de mot de passe</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuww">Intervalle de verrouillage d'&#233;chec de r&#233;initialisation de mot de passe</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuxg">Adresse &#233;lectronique o&#249; envoyer la notification de verrouillage</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuwt">Avertir utilisateur apr&#232;s N &#233;checs</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuxa">Dur&#233;e de verrouillage d'&#233;chec de r&#233;initialisation du mot de passe </A> </p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuxb">Nom d'attribut du verrouillage de r&#233;initialisation du mot de passe</A></p>
</li>
<li><p><A HREF="service.scserviceprofile.iplanetampasswordresetservice.html#fsuxt">Valeur de l'attribut de verrouillage de r&#233;initialisation du mot de passe</A></p>
</li>
</ul>
<A NAME="fsuwe"></A><h4>Validation de l'utilisateur</h4>
<p>Cet attribut sp&#233;cifie la valeur utilis&#233;e pour rechercher l'utilisateur dont le mot de passe doit &#234;tre r&#233;initialis&#233;.</p>
<A NAME="fsuwd"></A><h4>Question secr&#232;te</h4>
<p>Ce champ vous permet d'ajouter une liste de questions que l'utilisateur peut utiliser pour r&#233;initialiser son mot de passe. Pour ajouter une question, saisissez-la dans le champ Question secr&#232;te, puis cliquez sur Ajouter. Les questions s&#233;lectionn&#233;es apparaissent dans la page Profil utilisateur de l'utilisateur. L'utilisateur peut alors s&#233;lectionner une question pour r&#233;initialiser le mot de passe. Les utilisateurs peuvent cr&#233;er leur propre question si l'attribut Question personnelle activ&#233;e est s&#233;lectionn&#233;.</p>
<A NAME="fsuwh"></A><h4>Filtre de recherche</h4>
<p>Cet attribut sp&#233;cifie le filtre de recherche &#224; utiliser pour rechercher des entr&#233;es utilisateur.</p>
<A NAME="fsuwi"></A><h4>DN de base</h4>
<p>Cet attribut sp&#233;cifie le nom distinctif (DN) &#224; partir duquel d&#233;marre la recherche utilisateur. Si aucun nom distinctif n'est sp&#233;cifi&#233;, la recherche d&#233;marre &#224; partir du DN de domaine. Vous ne devez pas utiliser <tt>cn=directorymanager</tt> comme DN de base, en raison de conflits d'authentification de proxy.</p>
<A NAME="fsuwj"></A><h4>DN de liaison</h4>
<p>Cette valeur d'attribut est utilis&#233;e avec le mot de passe de liaison pour r&#233;initialiser le mot de passe de l'utilisateur.</p>
<A NAME="fsuwl"></A><h4>Mot de passe de la liaison</h4>
<p>Cette valeur d'attribut est utilis&#233;e avec le DN de liaison pour r&#233;initialiser le mot de passe de l'utilisateur.</p>
<A NAME="fsuwk"></A><h4>Option de r&#233;initialisation du mot de passe</h4>
<p>Cet attribut d&#233;termine le nom de classe pour la r&#233;initialisation du mot de passe. Le nom de classe par d&#233;faut est <tt>com.sun.identity.password.</tt><tt>RandomPasswordGenerator </tt> . La classe de r&#233;initialisation de mot de passe peut &#234;tre personnalis&#233;e gr&#226;ce &#224; un plug-in. Elle doit &#234;tre impl&#233;ment&#233;e par l'interface <tt>PasswordGenerator</tt>.</p>
<A NAME="fsuwq"></A><h4>Option de notification de changement du mot de passe</h4>
<p>Cet attribut d&#233;termine la m&#233;thode de notification &#224; l'utilisateur de la r&#233;initialisation du mot de passe. Le nom de classe par d&#233;faut est le suivant : <tt>com.sun.identity.password.</tt><tt>EmailPassword </tt>. La classe de notification du mot de passe peut &#234;tre personnalis&#233;e gr&#226;ce &#224; un plug-in. Elle doit &#234;tre impl&#233;ment&#233;e par l'interface <tt>NotifyPassword </tt>. Pour plus d'informations, reportez-vous au manuel Access Manager Developer's Guide.</p>
<A NAME="fsuwp"></A><h4>R&#233;initialisation du mot de passe</h4>
<p>La s&#233;lection de cet attribut active la fonction de r&#233;initialisation du mot de passe.</p>
<A NAME="fsuwm"></A><h4>Question personnelle</h4>
<p>La s&#233;lection de cet attribut permet &#224; l'utilisateur de cr&#233;er une question unique pour la r&#233;initialisation du mot de passe.</p>
<A NAME="fsuwo"></A><h4>Nombre max. de questions</h4>
<p>Cette valeur sp&#233;cifie le nombre maximum de questions &#224; poser dans la page de r&#233;initialisation de mot de passe.</p>
<A NAME="fsuwn"></A><h4>Forcer le changement de mot de passe &#224; la connexion suivante</h4>
<p>Lorsque cet attribut est activ&#233;, cette option contraint l'utilisateur &#224; modifier son mot de passe lors de la connexion suivante. Si vous souhaitez qu'un administrateur, autre que l'administrateur de niveau sup&#233;rieur, d&#233;finisse l'option de r&#233;initialisation forc&#233;e du mot de passe, vous devez modifier les ACI d'autorisation par d&#233;faut pour permettre l'acc&#232;s &#224; cet attribut.</p>
<A NAME="fsuwr"></A><h4>Verrouillage d'&#233;chec de r&#233;initialisation de mot de passe</h4>
<p>Cet attribut indique si les utilisateurs sont autoris&#233;s ou non &#224; r&#233;initialiser leur mot de passe en cas d'&#233;chec de la r&#233;initialisation du mot de passe &#224; l'aide de l'application R&#233;initialiser mot de passe. Par d&#233;faut, cette fonction n'est pas activ&#233;e.</p>
<A NAME="fsuxh"></A><h4>Nombre de verrouillages d'&#233;chec de r&#233;initialisation de mot de passe</h4>
<p>Cet attribut d&#233;finit le nombre de tentatives de r&#233;initialisation d'un mot de passe qu'un utilisateur peut effectuer, dans le d&#233;lai d&#233;fini dans le champ Intervalle de verrouillage d'&#233;chec de r&#233;initialisation de mot de passe, avant d'&#234;tre bloqu&#233;. Par exemple, si le nombre de verrouillage d'&#233;chec de r&#233;initialisation de mot de passe est d&#233;fini sur 5 et l'intervalle de verrouillage d'&#233;chec de connexion sur 5 minutes, l'utilisateur dispose de cinq chances dans un intervalle de cinq minutes pour r&#233;initialiser le mot de passe avant d'&#234;tre bloqu&#233;.</p>
<A NAME="fsuww"></A><h4>Intervalle de verrouillage d'&#233;chec de r&#233;initialisation de mot de passe</h4>
<p>Cet attribut d&#233;finit (en minutes) l'intervalle de temps durant lequel le nombre d&#233;fini de tentatives de r&#233;initialisation du mot de passe (d&#233;fini dans le champ Nombre de verrouillages d'&#233;chec de r&#233;initialisation de mot de passe) peut &#234;tre effectu&#233; avant le blocage de l'utilisateur.</p>
<A NAME="fsuxg"></A><h4>Adresse &#233;lectronique o&#249; envoyer la notification de verrouillage</h4>
<p>Cet attribut d&#233;finit une adresse e-mail qui recevra la notification en cas de blocage d'un utilisateur &#224; partir du service R&#233;initialisation du mot de passe. Indiquez l'adresse e-mail dans une liste s&#233;par&#233;e par des espaces.</p>
<A NAME="fsuwt"></A><h4>Avertir utilisateur apr&#232;s N &#233;checs</h4>
<p>Cet attribut indique le nombre d'&#233;checs de r&#233;initialisation de mot de passe au-del&#224; duquel Access Manager envoie un message d'avertissement signalant que l'utilisateur sera bloqu&#233;.</p>
<A NAME="fsuxa"></A><h4>Dur&#233;e de verrouillage d'&#233;chec de r&#233;initialisation du mot de passe </h4>
<p>Cet attribut d&#233;finit (en minutes) le d&#233;lai durant lequel l'utilisateur ne pourra pas tenter de r&#233;initialisation du mot de passe en cas de verrouillage.</p>
<A NAME="fsuxb"></A><h4>Nom d'attribut du verrouillage de r&#233;initialisation du mot de passe</h4>
<p>Cet attribut contient la valeur <i>inetuserstatus</i> qui est d&#233;fiie dans le champ Valeur de l'attribut de verrouillage de r&#233;initialisation du mot de passe. Si un utilisateur est exclu de la r&#233;initialisation du mot de passe et que la variable Dur&#233;e de verrouillage des &#233;checs de r&#233;initialisation du mot de passe (en minutes) a pour valeur 0, <i>inetuserstatus</i> est inactif, emp&#234;chant l'utilisateur de tenter de r&#233;initialiser son mot de passe.</p>
<A NAME="fsuxt"></A><h4>Valeur de l'attribut de verrouillage de r&#233;initialisation du mot de passe</h4>
<p>Cet attribut sp&#233;cifie la valeur de <i>inetuserstatus</i> (contenue dans le champ Nom d'attribut du verrouillage de r&#233;initialisation du mot de passe) du statut de l'utilisateur. Si un utilisateur est exclu de la r&#233;initialisation du mot de passe et que la variable Dur&#233;e de verrouillage des &#233;checs de r&#233;initialisation du mot de passe (en minutes) a pour valeur 0, <i>inetuserstatus</i> est inactif, emp&#234;chant l'utilisateur de tenter de r&#233;initialiser son mot de passe.</p>

<br />

</body>
</html>
