<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Configuration d'un gestionnaire de demandes
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="service.scsoapbindingrequesthandlerlistadd"></A><h4>Configuration d'un gestionnaire de demandes</h4>
<A NAME="indexterm-161"></A><A NAME="indexterm-162"></A><p>L'interface <tt>RequestHandler</tt> doit &#234;tre impl&#233;ment&#233;e c&#244;t&#233; serveur par chaque service d'identit&#233; Liberty utilisant Service de liaison SOAP. L'attribut Liste de gestionnaires de demandes stocke les informations sur les classes d'impl&#233;mentation des services Web qui impl&#233;mentent le gestionnaire de demandes. La liste des gestionnaires de demandes affiche les entr&#233;es qui contiennent des paires cl&#233;/valeur s&#233;par&#233;es par un tube comme dans : <tt>key=disco|class=com.example.identity.liberty.ws.disco.DiscoveryService </tt>.</p>
<ol><li><p><b>Cliquez sur Nouveau pour afficher les attributs Nouveau gestionnaire de demandes ou cliquez sur une valeur de cl&#233; configur&#233;e pour modifier les attributs existants.</b></p></li>
<li><p><b>Fournissez les valeurs pour les attributs en vous basant sur les informations suivantes :</b></p><table border="0" cellspacing="5"><tr><td valign="top"><p>key</p></td><td valign="top"><p>Ce param&#232;tre obligatoire correspond &#224; la derni&#232;re partie du chemin d'URI vers une extr&#233;mit&#233; SOAP. Le point d'arriv&#233;e SOAP dans Access Manager est le servlet r&#233;cepteur SOAP. L'URI pointant le r&#233;cepteur SOAP est <tt><b></tt><i>protocol <tt></i>://</tt><i>host<tt></i>:</tt><i>port<tt></i>/</tt><i> deploy-uri<tt></i>/Liberty/</tt><i>key<tt></i></b></tt>. Si vous d&#233;finissez <tt><b>disco</b></tt> comme cl&#233;, le chemin d'URI vers l'extr&#233;mit&#233; SOAP du Service de d&#233;couverte correspondant est : <tt><b></tt><i> protocol<tt></i>://</tt><i>host<tt></i>:</tt><i>port <tt></i>/amserver/Liberty/disco</b></tt>. Chaque client de service utilise une cl&#233; diff&#233;rente pour se connecter au r&#233;cepteur SOAP.</p>
</td></tr><tr><td valign="top"><p>class</p></td><td valign="top"><p>Ce param&#232;tre obligatoire d&#233;finit le nom de la classe d'impl&#233;mentation du gestionnaire de demandes pour ce service d'identit&#233;s particulier. Par exemple : <tt>class=com.exemple.identit&#233;.liberty.ws.disco.DiscoveryService</tt>.</p>
</td></tr><tr><td valign="top"><p>Action SOAP</p></td><td valign="top"><p>Ce param&#232;tre d&#233;finit un URI sp&#233;cifique &#224; SOAP facultatif.</p>
</td></tr></table>
</li>
<li><p><b>Cliquez sur OK pour terminer la configuration du gestionnaire de demandes.</b></p></li>
<li><p><b>Cliquez sur Enregistrer dans la page Service de liaison SOAP pour terminer la configuration du service.</b></p></li>
</ol>
<br />

</body>
</html>
