<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><!-- GenHTML@15714-->
<head>
  <META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=UTF-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Cr&#233;ation ou modification d'un agent
  </title>
  <script type="text/javascript" src="/com_sun_web_ui/js/browserVersion.js"></script>
  <script type="text/javascript" src="/com_sun_web_ui/js/stylesheet.js"></script>
  <script type="text/javascript"><!-- Empty script so IE5.0 Windows will draw table and button borders --></script>
  <meta name="Copyright" content="Copyright &copy; 2006 by Sun Microsystems, Inc. All Rights Reserved." />
</head>

<body class="HlpBdy">

<A NAME="subjectcreateagent"></A><h4>Cr&#233;ation ou modification d'un agent</h4>
<ol><li><p><b>Cliquez sur l'onglet Agents.</b></p></li>
<li><p><b>Cliquez sur Nouveau.</b></p></li>
<li><p><b>Renseignez les champs suivants :</b></p><p><b>Nom.</b>  saisissez le nom ou l' identit&#233; de l' agent. Il s'agit du nom que l'agent utilisera pour se connecter &#224; Access Manager. Les noms sur plusieurs octets ne sont pas accept&#233;s.</p>
<p><b>Mot de passe.</b>   saisissez le mot de passe de l' agent. Ce mot de passe doit &#234;tre diff&#233;rent du mot de passe utilis&#233; par l'agent lors de l'authentification LDAP.</p>
<p><b>Confirmation du mot de passe</b>.  : confirmez le mot de passe.</p>
<p><b>Statut de l'unit&#233;.</b>  saisissez le statut du dispositif de l' agent. S'il est d&#233;fini sur Actif, l'agent pourra s'authentifier aupr&#232;s d'Access Manager et communiquer avec Access Manager. S'il est d&#233;fini sur Inactif, l'agent ne pourra pas s'authentifier aupr&#232;s d'Access Manager.</p>
</li>
<li><p><b>Cliquez sur OK.</b></p></li>
<li><p><b>Une fois que vous avez cr&#233;&#233; l'agent, vous pouvez &#233;galement modifier les champs suivants :</b></p><p><b>Description.</b>  d&#233;crivez l' agent bri&#232;vement. Par exemple, vous pouvez entrer le nom de l'instance d'agent ou le nom de l'application qu'il prot&#232;ge.</p>
<p><b>Valeur de cl&#233; d'agent.</b>  d&#233;finissez les propri&#233;t&#233;s de l' agent avec une paire cl&#233;/agent. Cette propri&#233;t&#233; est utilis&#233;e par Access Manager pour recevoir les demandes d'assertions d'informations d'authentification sur les utilisateurs par les agents. Actuellement, seule une propri&#233;t&#233; est valide et toutes les autres propri&#233;t&#233;s seront ignor&#233;es. Utilisez le format suivant :</p>
<p><tt></tt><i>URLRacineAgent<tt></i>=http://</tt><i>nom_serveur:port<tt></i>/ </tt></p>
</li>
</ol>
<br />

</body>
</html>
